// Class CrowFPS.BTDecorator_CrowCooldown
// Size: 0x78 (Inherited: 0x70)
struct UBTDecorator_CrowCooldown : UBTDecorator_Cooldown {
	bool ResetCooldownTimeOnInitialize; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class CrowFPS.CrowCharacterBTServiceBase
// Size: 0x98 (Inherited: 0x98)
struct UCrowCharacterBTServiceBase : UBTService_BlackboardBase {
};

// Class CrowFPS.BTService_CrowFindTarget
// Size: 0xc0 (Inherited: 0x98)
struct UBTService_CrowFindTarget : UCrowCharacterBTServiceBase {
	struct FBlackboardKeySelector TargetInSight; // 0x98(0x28)
};

// Class CrowFPS.BTService_CrowLookAtTarget
// Size: 0x98 (Inherited: 0x98)
struct UBTService_CrowLookAtTarget : UCrowCharacterBTServiceBase {
};

// Class CrowFPS.BTService_CrowTestAction
// Size: 0x98 (Inherited: 0x98)
struct UBTService_CrowTestAction : UCrowCharacterBTServiceBase {
};

// Class CrowFPS.BTService_CrowUpdateTargetState
// Size: 0xc0 (Inherited: 0x98)
struct UBTService_CrowUpdateTargetState : UCrowCharacterBTServiceBase {
	struct FBlackboardKeySelector TargetInSight; // 0x98(0x28)
};

// Class CrowFPS.CrowCharacterBTTaskBase
// Size: 0x98 (Inherited: 0x98)
struct UCrowCharacterBTTaskBase : UBTTask_BlackboardBase {
};

// Class CrowFPS.BTTask_CrowCheckTargetInSight
// Size: 0x98 (Inherited: 0x98)
struct UBTTask_CrowCheckTargetInSight : UCrowCharacterBTTaskBase {
};

// Class CrowFPS.BTTask_CrowFindCoverPoint
// Size: 0xa0 (Inherited: 0x98)
struct UBTTask_CrowFindCoverPoint : UCrowCharacterBTTaskBase {
	enum class ECrowAIFindCoverPointMode FindMode; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class CrowFPS.BTTask_CrowFindRandomPatrol
// Size: 0xa0 (Inherited: 0x98)
struct UBTTask_CrowFindRandomPatrol : UCrowCharacterBTTaskBase {
	float PatrolRadius; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class CrowFPS.BTTask_CrowFindTarget
// Size: 0x98 (Inherited: 0x98)
struct UBTTask_CrowFindTarget : UCrowCharacterBTTaskBase {
};

// Class CrowFPS.BTTask_CrowFireTarget
// Size: 0xa8 (Inherited: 0x98)
struct UBTTask_CrowFireTarget : UCrowCharacterBTTaskBase {
	float FireTime; // 0x98(0x04)
	float CoolDownTime; // 0x9c(0x04)
	float CooldownRandomDeviation; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class CrowFPS.BTTask_CrowMoveTo
// Size: 0xb8 (Inherited: 0xb0)
struct UBTTask_CrowMoveTo : UBTTask_MoveTo {
	enum class ECrowAICharacterStance Stance; // 0xb0(0x01)
	enum class ECrowAICharacterMoveMode MoveMode; // 0xb1(0x01)
	char pad_B2[0x6]; // 0xb2(0x06)
};

// Class CrowFPS.BTTask_CrowOccupyCoverPoint
// Size: 0xc0 (Inherited: 0xb8)
struct UBTTask_CrowOccupyCoverPoint : UBTTask_CrowMoveTo {
	enum class ECrowAIFindCoverPointMode FindMode; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
};

// Class CrowFPS.BTTask_CrowSetBlackboardBool
// Size: 0xa0 (Inherited: 0x98)
struct UBTTask_CrowSetBlackboardBool : UCrowCharacterBTTaskBase {
	bool IsSet; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class CrowFPS.BTTask_CrowSetStance
// Size: 0xa0 (Inherited: 0x98)
struct UBTTask_CrowSetStance : UCrowCharacterBTTaskBase {
	enum class ECrowAICharacterStance Stance; // 0x98(0x01)
	enum class ECrowAICharacterMoveMode MoveMode; // 0x99(0x01)
	char pad_9A[0x6]; // 0x9a(0x06)
};

// Class CrowFPS.CrowActorComponentBase
// Size: 0xc0 (Inherited: 0xb0)
struct UCrowActorComponentBase : UActorComponent {
	struct UCrowComponentContainer* OwnerContainer; // 0xb0(0x08)
	struct AActor* CrowComponentOwnerActor; // 0xb8(0x08)

	void SetOwnerContainer(struct UCrowComponentContainer* ComponentContainer, struct AActor* OwnerActor); // Function CrowFPS.CrowActorComponentBase.SetOwnerContainer // (Final|Native|Protected) // @ game+0x18ad2c0
	struct UObject* BNE_GetCrowComponentType(); // Function CrowFPS.CrowActorComponentBase.BNE_GetCrowComponentType // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x18acd70
};

// Class CrowFPS.CrowActorComponentBreakableMesh
// Size: 0x210 (Inherited: 0x200)
struct UCrowActorComponentBreakableMesh : USceneComponent {
	struct UStaticMeshComponent* SM_Default; // 0x1f8(0x08)
	struct UStaticMeshComponent* SM_Broken; // 0x200(0x08)
	struct UStaticMeshComponent* SM_CustomDepth; // 0x208(0x08)
};

// Class CrowFPS.CrowActorInitializerBase
// Size: 0xc0 (Inherited: 0xb0)
struct UCrowActorInitializerBase : UActorComponent {
	struct AActor* TargetActor; // 0xb0(0x08)
	struct UCrowComponentContainer* ComponentContainer; // 0xb8(0x08)

	struct UCrowActorInitializerBase* SafeNewInitializer(struct AActor* TargetActor, struct UObject* Class); // Function CrowFPS.CrowActorInitializerBase.SafeNewInitializer // (Final|Native|Static|Public) // @ game+0x18ad170
};

// Class CrowFPS.CrowWidgetBase
// Size: 0x348 (Inherited: 0x260)
struct UCrowWidgetBase : UUserWidget {
	char pad_260[0x8]; // 0x260(0x08)
	struct UCrowWidgetBase* EventHandler; // 0x268(0x08)
	struct UCrowWidgetBase* EventHandlerWidgetType; // 0x270(0x08)
	struct FString HandlerWidgetName; // 0x278(0x10)
	enum class ECrowEvent Event; // 0x288(0x04)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct UAkAudioEvent* VisibleSound; // 0x290(0x08)
	struct UAkAudioEvent* InvisibleSound; // 0x298(0x08)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap; // 0x2a0(0x50)
	char pad_2F0[0x10]; // 0x2f0(0x10)
	struct TArray<struct UCrowWidgetTweenBase*> TweenerArray; // 0x300(0x10)
	struct UCrowWidgetManager* WidgetManager; // 0x310(0x08)
	struct UCrowWidgetBase* MasterWidget; // 0x318(0x08)
	char pad_320[0x28]; // 0x320(0x28)

	void OnPlayAkAudio(struct UAkAudioEvent* AudioEvent); // Function CrowFPS.CrowWidgetBase.OnPlayAkAudio // (Final|Native|Protected|BlueprintCallable) // @ game+0x19dfed0
	void OnFadeOutComplete(); // Function CrowFPS.CrowWidgetBase.OnFadeOutComplete // (Native|Protected) // @ game+0x19dfe90
	void OnFadeInComplete(); // Function CrowFPS.CrowWidgetBase.OnFadeInComplete // (Native|Protected) // @ game+0x19dfe70
	struct ACrowPlayerControllerBase* GetCrowPlayerController(); // Function CrowFPS.CrowWidgetBase.GetCrowPlayerController // (Final|Native|Protected) // @ game+0x19dfe00
	struct UCrowGameInstance* GetCrowGameInstance(); // Function CrowFPS.CrowWidgetBase.GetCrowGameInstance // (Final|Native|Protected) // @ game+0x19dfdd0
	struct ACrowCharacterPawn* GetCrowCharacterPawn(); // Function CrowFPS.CrowWidgetBase.GetCrowCharacterPawn // (Final|Native|Protected) // @ game+0x19dfda0
	void Close(); // Function CrowFPS.CrowWidgetBase.Close // (Native|Public) // @ game+0x19dfd80
};

// Class CrowFPS.CrowActorRotatorWidget
// Size: 0x370 (Inherited: 0x348)
struct UCrowActorRotatorWidget : UCrowWidgetBase {
	bool bIsRotateHorizontal; // 0x348(0x01)
	bool bIsRotateVertical; // 0x349(0x01)
	bool bInverseHorizontal; // 0x34a(0x01)
	bool bInversVertical; // 0x34b(0x01)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct AActor* TargetActor; // 0x350(0x08)
	char pad_358[0x18]; // 0x358(0x18)
};

// Class CrowFPS.CrowAICharacterController
// Size: 0x408 (Inherited: 0x328)
struct ACrowAICharacterController : AAIController {
	char pad_328[0x28]; // 0x328(0x28)
	struct FCrowAICharacterData Setup_AICharacterData; // 0x350(0x60)
	struct FCrowAICharacterParameter Setup_AICharacterParameter; // 0x3b0(0x20)
	struct FCrowAIFireTargetData Setup_AIFireTargetData; // 0x3d0(0x18)
	struct ACrowAICharacterPawn* AIPawn; // 0x3e8(0x08)
	struct ACrowAICharacterSpawner* AISpawner; // 0x3f0(0x08)
	struct FTimerHandle UpdateAIPerceptionTimerHandle; // 0x3f8(0x08)
	bool bStartFire; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)

	void StopAnimNetworked(struct UAnimMontage* AnimMontage, float BlendOut); // Function CrowFPS.CrowAICharacterController.StopAnimNetworked // (Final|Native|Public|BlueprintCallable) // @ game+0x18ad410
	void SetStance(enum class ECrowAICharacterStance Instance); // Function CrowFPS.CrowAICharacterController.SetStance // (Native|Public|BlueprintCallable) // @ game+0x18ad390
	void SetMoveMode(enum class ECrowAICharacterMoveMode InMoveMode); // Function CrowFPS.CrowAICharacterController.SetMoveMode // (Native|Public|BlueprintCallable) // @ game+0x18ad240
	float PlayAnimNetworked(struct UAnimMontage* AnimMontage, struct FName SectionName, float PlayRate, float StartPosition, bool bStopMontages); // Function CrowFPS.CrowAICharacterController.PlayAnimNetworked // (Final|Native|Public|BlueprintCallable) // @ game+0x18acfc0
	void OnTargetPerceptionUpdate(struct AActor* InTarget, struct FAIStimulus InStimulus); // Function CrowFPS.CrowAICharacterController.OnTargetPerceptionUpdate // (Native|Public) // @ game+0x18ace30
	bool IsAnyStanceChanging(); // Function CrowFPS.CrowAICharacterController.IsAnyStanceChanging // (Final|Native|Public|BlueprintCallable) // @ game+0x18ace00
};

// Class CrowFPS.CrowAIObjectCharacterBase
// Size: 0x268 (Inherited: 0x220)
struct ACrowAIObjectCharacterBase : AActor {
	bool bOverrideCrowAIObjectBillboardSprite; // 0x220(0x01)
	bool bOverrideCrowAIObjectCharacterMesh; // 0x221(0x01)
	bool bOverrideCrowAIObjectCharacterMeshMaterial; // 0x222(0x01)
	bool bOverrideCrowAIObjectCharacterPreviewAnim; // 0x223(0x01)
	char pad_224[0x4]; // 0x224(0x04)
	struct UTexture2D* OverrideCrowAIObjectBillboardSprite; // 0x228(0x08)
	struct USkeletalMesh* OverrideCrowAIObjectCharacterMesh; // 0x230(0x08)
	struct UMaterialInterface* OverrideCrowAIObjectCharacterMeshMaterial; // 0x238(0x08)
	struct UAnimSequenceBase* OverrideCrowAIObjectCharacterPreviewAnim; // 0x240(0x08)
	struct USceneComponent* RootSceneComponent; // 0x248(0x08)
	char pad_250[0x18]; // 0x250(0x18)
};

// Class CrowFPS.CrowAICharacterCoverPoint
// Size: 0x290 (Inherited: 0x268)
struct ACrowAICharacterCoverPoint : ACrowAIObjectCharacterBase {
	struct ACrowAICharacterPawn* OccupyedAICharacter; // 0x268(0x08)
	bool IsCollectable; // 0x270(0x01)
	enum class ECrowAICharacterStance OccupyStance; // 0x271(0x01)
	char pad_272[0x6]; // 0x272(0x06)
	struct UAnimSequenceBase* PreviewAnimStand; // 0x278(0x08)
	struct UAnimSequenceBase* PreviewAnimCrouch; // 0x280(0x08)
	struct UAnimSequenceBase* PreviewAnimProne; // 0x288(0x08)
};

// Class CrowFPS.CrowCharacterBase
// Size: 0x10d0 (Inherited: 0x1000)
struct ACrowCharacterBase : ACLSCharacter {
	char pad_1000[0x8]; // 0x1000(0x08)
	struct FCrowCharacterAppearance ReplicatedAppearance; // 0x1008(0x06)
	char pad_100E[0x2]; // 0x100e(0x02)
	struct TArray<struct FCrowClothItemData> DefaultClothesList; // 0x1010(0x10)
	struct TArray<uint32_t> DefaultTattooIndexList; // 0x1020(0x10)
	uint32_t DefaultResultMVPIndex; // 0x1030(0x04)
	bool bIsHuman; // 0x1034(0x01)
	char pad_1035[0x3]; // 0x1035(0x03)
	struct FName PelvisBoneName; // 0x1038(0x08)
	float ElapsedForceSyncRotation; // 0x1040(0x04)
	char bIsWeaponFiring : 1; // 0x1044(0x01)
	char pad_1044_1 : 7; // 0x1044(0x01)
	char pad_1045[0x3]; // 0x1045(0x03)
	float PronedEyeHeight; // 0x1048(0x04)
	char pad_104C[0x4]; // 0x104c(0x04)
	struct UCrowCharacterMovement* CrowMovement; // 0x1050(0x08)
	struct UCrowProneCapsuleComponent* ProneCollisionCapsuleComponent; // 0x1058(0x08)
	struct UCrowClothActorComponent* TP_ClothComponent; // 0x1060(0x08)
	struct FCrowCharacterAppearance CurrentAppearance; // 0x1068(0x06)
	char pad_106E[0x2]; // 0x106e(0x02)
	uint32_t CurrentTattooFaceIndex; // 0x1070(0x04)
	uint32_t CurrentTattooArmIndex; // 0x1074(0x04)
	struct UPhysicsAsset* CharacterPhysicsAsset; // 0x1078(0x08)
	struct UPhysicsAsset* RagdollPhysicsAsset; // 0x1080(0x08)
	struct UCrowLibraryMergeSKCTask* MergeMeshTask; // 0x1088(0x08)
	char pad_1090[0x8]; // 0x1090(0x08)
	struct USkeletalMesh* OptimizationWeaponMesh; // 0x1098(0x08)
	struct USkeletalMesh* OptimizationCharacterMesh; // 0x10a0(0x08)
	struct USkeletalMesh* BackupNoOptimizationCharacterMesh; // 0x10a8(0x08)
	struct UMaterialInterface* BackupNoOptimizationCharacterMaterial; // 0x10b0(0x08)
	int32_t CacheMergedMeshIndex; // 0x10b8(0x04)
	char pad_10BC[0x4]; // 0x10bc(0x04)
	struct UObject* BackupAnimClass; // 0x10c0(0x08)
	char pad_10C8[0x8]; // 0x10c8(0x08)

	void ServerMovePacked_CrowWorld(struct FCharacterServerMovePackedBits PackedBits, uint32_t WorldActorIndex, int16_t LayoutItemIndex); // Function CrowFPS.CrowCharacterBase.ServerMovePacked_CrowWorld // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x18cf340
	void Server_WeaponFiring(bool IsFiring); // Function CrowFPS.CrowCharacterBase.Server_WeaponFiring // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x18cf4d0
	void OnRep_IsWeaponFiring(); // Function CrowFPS.CrowCharacterBase.OnRep_IsWeaponFiring // (Native|Protected) // @ game+0x18cf280
	void OnRep_ChangeDefaultTattooIndexList(); // Function CrowFPS.CrowCharacterBase.OnRep_ChangeDefaultTattooIndexList // (Final|Native|Protected) // @ game+0x18cf260
	void OnRep_ChangeDefaultClothesList(); // Function CrowFPS.CrowCharacterBase.OnRep_ChangeDefaultClothesList // (Final|Native|Protected) // @ game+0x18cf240
	void OnRep_ChangeAppearance(); // Function CrowFPS.CrowCharacterBase.OnRep_ChangeAppearance // (Final|Native|Protected) // @ game+0x18cf240
	void OnCompleteMergedMeshTP(struct USkeletalMesh* InMergedMesh); // Function CrowFPS.CrowCharacterBase.OnCompleteMergedMeshTP // (Native|Public) // @ game+0x18cf1b0
	void Multicast_DrawDebugLine(struct FVector LineStart, struct FVector LineEnd, struct FColor LineColor); // Function CrowFPS.CrowCharacterBase.Multicast_DrawDebugLine // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|NetValidate) // @ game+0x18cf030
	bool IsOnVault(); // Function CrowFPS.CrowCharacterBase.IsOnVault // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18ceda0
	bool IsOnInteract(); // Function CrowFPS.CrowCharacterBase.IsOnInteract // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18ceda0
	bool IsMale(); // Function CrowFPS.CrowCharacterBase.IsMale // (Final|Native|Public) // @ game+0x18ced70
	struct UCrowClothActorComponent* GetTP_ClothComponent(); // Function CrowFPS.CrowCharacterBase.GetTP_ClothComponent // (Final|Native|Public) // @ game+0x18cec80
	struct FVector GetFireTargetPartOffset(enum class ECrowCharacterFireTargetPart InPart); // Function CrowFPS.CrowCharacterBase.GetFireTargetPartOffset // (Final|Native|Public|HasDefaults) // @ game+0x18cebb0
};

// Class CrowFPS.CrowCharacterPawn
// Size: 0x1c20 (Inherited: 0x10d0)
struct ACrowCharacterPawn : ACrowCharacterBase {
	char pad_10D0[0x8]; // 0x10d0(0x08)
	bool bStopAdditionalCollision; // 0x10d8(0x01)
	bool bUseViewDependsOnManager; // 0x10d9(0x01)
	char pad_10DA[0x4e]; // 0x10da(0x4e)
	struct ACrowPlayerStateBase* SavedPlayerState; // 0x1128(0x08)
	char pad_1130[0x4]; // 0x1130(0x04)
	struct FVector ServerHeadLocation; // 0x1134(0x0c)
	bool bEnableDrownedMoving; // 0x1140(0x01)
	char pad_1141[0x3]; // 0x1141(0x03)
	struct FName HeadCollisionSocketName; // 0x1144(0x08)
	struct FName NeckBoneName; // 0x114c(0x08)
	float SprintingAngleLimit; // 0x1154(0x04)
	struct FName CamSocketName; // 0x1158(0x08)
	float TurnOffsetTest; // 0x1160(0x04)
	struct FCrowCharacterLookLimitStance LimitControlRotation; // 0x1164(0xac)
	struct FCrowCharacterLookLimitStance LimitAimOffset; // 0x1210(0xac)
	float ProneLimitCheckDistance; // 0x12bc(0x04)
	float ProneLimitCheckRadius; // 0x12c0(0x04)
	float ProneLimitFrontBackVelocityFactor; // 0x12c4(0x04)
	float ProneLimitSideVelocityFactor; // 0x12c8(0x04)
	float ProneLimitNotMovingBaseLength; // 0x12cc(0x04)
	float ProneLimitNotMovingCheckDistance; // 0x12d0(0x04)
	char pad_12D4[0x4]; // 0x12d4(0x04)
	struct ACrowVehiclePawn* ReservedVehicle; // 0x12d8(0x08)
	bool bIsReservedVehicle; // 0x12e0(0x01)
	char pad_12E1[0x7]; // 0x12e1(0x07)
	struct ACrowVehiclePawn* BoardingVehicle; // 0x12e8(0x08)
	struct FName VehicleName; // 0x12f0(0x08)
	char SeatIndex; // 0x12f8(0x01)
	enum class EVehicleSeatType SeatType; // 0x12f9(0x01)
	char pad_12FA[0x2]; // 0x12fa(0x02)
	float SeatLeanForward; // 0x12fc(0x04)
	float SeatLeanBackward; // 0x1300(0x04)
	float SeatLeanSide; // 0x1304(0x04)
	float ProneAddedPitchValue; // 0x1308(0x04)
	struct FRotator DefaultVehicleControlInput; // 0x130c(0x0c)
	struct FVector2D VehicleControlPitchMinMax; // 0x1318(0x08)
	struct FVector2D VehicleControlYawMinMax; // 0x1320(0x08)
	struct FVector2D VehicleControlFirePitchMinMax; // 0x1328(0x08)
	struct FVector2D VehicleControlFireYawMinMax; // 0x1330(0x08)
	struct UCapsuleComponent* PickupItemChecker; // 0x1338(0x08)
	float PickupItemCheckerSize; // 0x1340(0x04)
	char pad_1344[0x1]; // 0x1344(0x01)
	bool IsPressUSEKey; // 0x1345(0x01)
	bool IsPressSubUSEKey; // 0x1346(0x01)
	char pad_1347[0x9]; // 0x1347(0x09)
	struct UCrowInputBase* InputDefault; // 0x1350(0x08)
	struct UCrowInputBase* InputFindConstructionSite; // 0x1358(0x08)
	struct UCrowInputBase* InputConstruction; // 0x1360(0x08)
	struct UCrowInputBase* InputUI; // 0x1368(0x08)
	struct UCrowInputBase* InputOnTablet; // 0x1370(0x08)
	struct TArray<struct ACrowItemBase*> NearItemList; // 0x1378(0x10)
	struct UCrowTeleportationActorComponent* CrowTeleportationActorComponent; // 0x1388(0x08)
	struct UCrowGasMaskComponent* CrowGasMaskComponent; // 0x1390(0x08)
	struct FLocoCameraTargets CameraTargets; // 0x1398(0x294)
	struct FLocoCameraSettings CurrentCameraSettings; // 0x162c(0x14)
	struct UCurveFloat* CameraLerpCurve1; // 0x1640(0x08)
	struct UCurveFloat* CameraLerpCurve2; // 0x1648(0x08)
	struct UCurveFloat* CameraLerpCurve3; // 0x1650(0x08)
	struct UTimelineComponent* CameraLerpTimeline; // 0x1658(0x08)
	char pad_1660[0x10]; // 0x1660(0x10)
	struct FCrowCharacterPeekSetup PeekSetup; // 0x1670(0x08)
	bool bIsLeftFoot; // 0x1678(0x01)
	bool bIsShootablePose; // 0x1679(0x01)
	char pad_167A[0x6]; // 0x167a(0x06)
	struct FVector UpdatedAnimationPelvisOffset; // 0x1680(0x0c)
	char pad_168C[0x10]; // 0x168c(0x10)
	float AimDelayDefault; // 0x169c(0x04)
	float AimDelaySlow; // 0x16a0(0x04)
	char pad_16A4[0x4]; // 0x16a4(0x04)
	struct UCrowLibraryMergeSKCTask* MergeMeshTask_FPArm; // 0x16a8(0x08)
	struct UCrowLibraryMergeSKCTask* MergeMeshTask_FPBody; // 0x16b0(0x08)
	bool bSkipOptimizationByScreensize; // 0x16b8(0x01)
	char pad_16B9[0x3]; // 0x16b9(0x03)
	enum class ECrowConditionFlags CrowConditionFlags; // 0x16bc(0x04)
	bool bIsSkydivingMode; // 0x16c0(0x01)
	char pad_16C1[0x7]; // 0x16c1(0x07)
	struct UCrowCharacterSkydivingComponent* SkydivingComponent; // 0x16c8(0x08)
	bool bResetRelativeMeshTransform; // 0x16d0(0x01)
	char pad_16D1[0x7]; // 0x16d1(0x07)
	struct UCrowWorldMapIcon* WorldMapIcon; // 0x16d8(0x08)
	struct UCrowIndicatorViewInfo* IndicatorInfo; // 0x16e0(0x08)
	bool bIsSpectatorMode; // 0x16e8(0x01)
	bool bIsAimAtSpectatorMode; // 0x16e9(0x01)
	char SpectatorCameraMode; // 0x16ea(0x01)
	char PrevSpectatorCameraMode; // 0x16eb(0x01)
	char pad_16EC[0x4]; // 0x16ec(0x04)
	struct FTimerHandle EndPlayEmotionTimerHandle; // 0x16f0(0x08)
	char PrevEmotionCameraMode; // 0x16f8(0x01)
	bool bIsPlayEmotion; // 0x16f9(0x01)
	char pad_16FA[0x2]; // 0x16fa(0x02)
	uint32_t CurrentEmotionIndex; // 0x16fc(0x04)
	float SwimingOxygen; // 0x1700(0x04)
	char pad_1704[0x4]; // 0x1704(0x04)
	struct UCrowZombieComponent* ZombieComponent; // 0x1708(0x08)
	float MaxSwimingOxygen; // 0x1710(0x04)
	float ConsumeOxygen; // 0x1714(0x04)
	float ConsumeOxygenPerSecond; // 0x1718(0x04)
	float RecoveryOxygen; // 0x171c(0x04)
	float RecoveryOxygenPerSecond; // 0x1720(0x04)
	float LackOfOxygenDamage; // 0x1724(0x04)
	float SwimGroundDustDelay; // 0x1728(0x04)
	char pad_172C[0x4]; // 0x172c(0x04)
	struct FTimerHandle ConsumeOxygenTimerHandle; // 0x1730(0x08)
	struct FTimerHandle RecoveryOxygenTimerHandler; // 0x1738(0x08)
	float PrevSwimImmersionDepth; // 0x1740(0x04)
	float SwimGroundDustTime; // 0x1744(0x04)
	float RandSwimGroundDustDelay; // 0x1748(0x04)
	struct FName PrevPhysicsVolumeName; // 0x174c(0x08)
	float ElapsedNotMovementTime; // 0x1754(0x04)
	float ElapsedHeadLocationUpdateTime; // 0x1758(0x04)
	char pad_175C[0x4]; // 0x175c(0x04)
	struct UCrowStatusBreathWidget* StatusWidget; // 0x1760(0x08)
	struct UCrowVehicleOceanTracker* OceanTracker; // 0x1768(0x08)
	char pad_1770[0x4]; // 0x1770(0x04)
	struct FCrowBattleSetup BattleSetup; // 0x1774(0x20)
	char pad_1794[0x4]; // 0x1794(0x04)
	struct FCrowCharacterSoundSetup SoundSetup; // 0x1798(0x10)
	struct FCrowBattleContainer BattleContainer; // 0x17a8(0x20)
	struct UCrowSpringArmComponent* SpringArmTP; // 0x17c8(0x08)
	struct UCameraComponent* CameraTP; // 0x17d0(0x08)
	struct UCameraComponent* CameraFP; // 0x17d8(0x08)
	struct USceneComponent* FPMeshPeekAxis; // 0x17e0(0x08)
	struct USceneComponent* FPMeshSightAxis; // 0x17e8(0x08)
	struct USkeletalMeshComponent* MeshFPBody; // 0x17f0(0x08)
	struct USkeletalMeshComponent* MeshFPArm; // 0x17f8(0x08)
	struct UPointLightComponent* LightFP; // 0x1800(0x08)
	struct UPointLightComponent* LightFPType; // 0x1808(0x08)
	struct FVector LightFPOffset; // 0x1810(0x0c)
	char pad_181C[0x4]; // 0x181c(0x04)
	struct UCrowClothActorComponent* FPBody_ClothComponent; // 0x1820(0x08)
	struct UCrowClothActorComponent* FPArm_ClothComponent; // 0x1828(0x08)
	struct UCrowCharacterMovementCollision* CharacterMovementCollision; // 0x1830(0x08)
	struct UCrowCharacterTriggerControl* TriggerControl; // 0x1838(0x08)
	struct UCrowGameInvenComponent* GameInventory; // 0x1840(0x08)
	struct UCrowPlayerConstruction* PlayerConstruction; // 0x1848(0x08)
	struct UCrowWeaponManagerComponent* WeaponManagerComponent; // 0x1850(0x08)
	struct AActor* TargetActor; // 0x1858(0x08)
	struct UCrowCharacterFallsComponent* FallsComp; // 0x1860(0x08)
	struct UArrowComponent* ThrowProjectileFireDirection; // 0x1868(0x08)
	struct UUserWidget* hudWidgetClass; // 0x1870(0x08)
	char pad_1878[0x8]; // 0x1878(0x08)
	struct FCrowGameIconDisplayInfo IconDisplayInfoEnemy; // 0x1880(0x88)
	struct USceneComponent* IconLocation; // 0x1908(0x08)
	struct UAkAudioEvent* SoundSprint; // 0x1910(0x08)
	struct UAkAudioEvent* SoundSprintEnd; // 0x1918(0x08)
	struct UAkAudioEvent* SoundSprint_Zombie; // 0x1920(0x08)
	struct UAkAudioEvent* SoundSprintEnd_Zombie; // 0x1928(0x08)
	float SoundSprinTime; // 0x1930(0x04)
	char pad_1934[0x4]; // 0x1934(0x04)
	struct UAkComponent* SprintSoundComponent; // 0x1938(0x08)
	struct UAkAudioEvent* SoundBreath; // 0x1940(0x08)
	struct UAkAudioEvent* SoundBreath_Zombie; // 0x1948(0x08)
	float SoundBreathTime; // 0x1950(0x04)
	char pad_1954[0xc]; // 0x1954(0x0c)
	struct TArray<struct ACrowInDoorTriggerVolume*> InDoorTriggerList; // 0x1960(0x10)
	struct TMap<enum class ECrowDamageCauser, struct UAkAudioEvent*> DeathSounds; // 0x1970(0x50)
	struct TMap<enum class ECrowDamageCauser, struct UAkAudioEvent*> DeathSounds_Zombie; // 0x19c0(0x50)
	char pad_1A10[0x10]; // 0x1a10(0x10)
	struct USkeletalMeshComponent* SaveHealKitMeshComp; // 0x1a20(0x08)
	struct USkeletalMesh* SaveHealKitSkelMesh_1P; // 0x1a28(0x08)
	struct USkeletalMesh* SaveHealKitSkelMesh_3P; // 0x1a30(0x08)
	struct FCrowDecalInfo InjuredBloodOnGroundDecal; // 0x1a38(0x50)
	float InjuredBloodDecalDist; // 0x1a88(0x04)
	int32_t CurrentReviveCnt; // 0x1a8c(0x04)
	float AddedMoveDist; // 0x1a90(0x04)
	char pad_1A94[0x4]; // 0x1a94(0x04)
	struct UCrowSoundStateComponent* SoundStateComponent; // 0x1a98(0x08)
	struct TArray<struct FCrowDotDamageInfo> DotDamageArray; // 0x1aa0(0x10)
	char pad_1AB0[0x8]; // 0x1ab0(0x08)
	struct TMap<uint64_t, struct FCrowDamageExpInfo> DamageExpMap; // 0x1ab8(0x50)
	struct FCLSAnimation AniFlashBangBegin; // 0x1b08(0x20)
	struct FCLSAnimation AniFlashBangLoop; // 0x1b28(0x20)
	struct FCLSAnimation AniFlashBangEnd; // 0x1b48(0x20)
	int32_t SequencePawnID; // 0x1b68(0x04)
	char pad_1B6C[0x4]; // 0x1b6c(0x04)
	struct TMap<uint64_t, struct AActor*> UAVReconMap; // 0x1b70(0x50)
	char pad_1BC0[0x8]; // 0x1bc0(0x08)
	struct TArray<struct UCrowFoliageAffectorComponent*> FoliageAffectors; // 0x1bc8(0x10)
	char pad_1BD8[0x8]; // 0x1bd8(0x08)
	struct UAnimMontage* LookingWeaponMontage; // 0x1be0(0x08)
	bool IsLookingWeapon; // 0x1be8(0x01)
	char pad_1BE9[0x17]; // 0x1be9(0x17)
	struct TArray<struct FCrowSoundScriptData> SoundScriptDatas; // 0x1c00(0x10)
	float SoundScriptExecutableTime; // 0x1c10(0x04)
	enum class ECrowScopeSightRate ServerCurrentScopeSightRate; // 0x1c14(0x01)
	char pad_1C15[0xb]; // 0x1c15(0x0b)

	void UpdateSwiming(float DeltaSeconds); // Function CrowFPS.CrowCharacterPawn.UpdateSwiming // (Final|Native|Protected) // @ game+0x18d4220
	void UpdateLadder(float DeltaSeconds); // Function CrowFPS.CrowCharacterPawn.UpdateLadder // (Final|Native|Protected) // @ game+0x18d41a0
	void UpdateInjuredBloodOnGround(); // Function CrowFPS.CrowCharacterPawn.UpdateInjuredBloodOnGround // (Final|Native|Public) // @ game+0x18d4180
	void UpdateCharacterMovementCollision(float DeltaSeconds); // Function CrowFPS.CrowCharacterPawn.UpdateCharacterMovementCollision // (Final|Native|Protected) // @ game+0x18d4100
	void UpdateCharacterMaintainSprint(float DeltaSeconds); // Function CrowFPS.CrowCharacterPawn.UpdateCharacterMaintainSprint // (Final|Native|Protected) // @ game+0x18d4080
	void TriggerTest(); // Function CrowFPS.CrowCharacterPawn.TriggerTest // (Final|Native|Public|BlueprintCallable) // @ game+0x18d4060
	void StopLookingWeaponMontage(); // Function CrowFPS.CrowCharacterPawn.StopLookingWeaponMontage // (Final|Native|Public) // @ game+0x18d4040
	void StartAimDelayed(); // Function CrowFPS.CrowCharacterPawn.StartAimDelayed // (Final|Native|Protected) // @ game+0x18d4020
	void SinglecastEnergy(uint16_t Energy); // Function CrowFPS.CrowCharacterPawn.SinglecastEnergy // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x18d3f90
	void SetRevive(); // Function CrowFPS.CrowCharacterPawn.SetRevive // (Final|Native|Public) // @ game+0x18d3e00
	void SetProneAimState(); // Function CrowFPS.CrowCharacterPawn.SetProneAimState // (Final|Native|Public) // @ game+0x18d3de0
	void SetFolaigeAffectorOffset(enum class ECrowCameraMode InCrowCameraMode); // Function CrowFPS.CrowCharacterPawn.SetFolaigeAffectorOffset // (Final|Native|Private) // @ game+0x18d3ce0
	void SetDyingState(bool isDying); // Function CrowFPS.CrowCharacterPawn.SetDyingState // (Final|Native|Public) // @ game+0x18d3c50
	void SetActiveHeadCollision(bool bActive); // Function CrowFPS.CrowCharacterPawn.SetActiveHeadCollision // (Final|Native|Public) // @ game+0x18d3aa0
	void ServerReadyToSkydiving(); // Function CrowFPS.CrowCharacterPawn.ServerReadyToSkydiving // (Final|Native|Public|BlueprintCallable) // @ game+0x18d35e0
	void Server_UseWeaponBox(struct ACrowSupplyWeaponActor* WeaponBox); // Function CrowFPS.CrowCharacterPawn.Server_UseWeaponBox // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x18d39e0
	void Server_UseAmmoBox(struct ACrowSupplyAmmoActor* AmmoBox); // Function CrowFPS.CrowCharacterPawn.Server_UseAmmoBox // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x18d3920
	void Server_Teleport(struct FVector Location); // Function CrowFPS.CrowCharacterPawn.Server_Teleport // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x18d3870
	void Server_MakeVanillaCharacterState(); // Function CrowFPS.CrowCharacterPawn.Server_MakeVanillaCharacterState // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x18d3820
	void Server_FlySpeed(float NewSpeed); // Function CrowFPS.CrowCharacterPawn.Server_FlySpeed // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x18d3760
	void Server_EndFlashBangFX(); // Function CrowFPS.CrowCharacterPawn.Server_EndFlashBangFX // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x18d3740
	void Server_CreshWindow(float MaxWindowHeightSize, struct FVector TargetLocation); // Function CrowFPS.CrowCharacterPawn.Server_CreshWindow // (Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate) // @ game+0x18d3620
	void Server_BeginFlashBangFX(); // Function CrowFPS.CrowCharacterPawn.Server_BeginFlashBangFX // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x18d3600
	void ReloadCrowConditionFlag(); // Function CrowFPS.CrowCharacterPawn.ReloadCrowConditionFlag // (Final|Native|Public) // @ game+0x18d35c0
	void RecoveryOxygenTimer(); // Function CrowFPS.CrowCharacterPawn.RecoveryOxygenTimer // (Final|Native|Public) // @ game+0x18d35a0
	void OnPressedWeaponLooking(); // Function CrowFPS.CrowCharacterPawn.OnPressedWeaponLooking // (Final|Native|Public) // @ game+0x18d3580
	void OnPickupCheckerEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function CrowFPS.CrowCharacterPawn.OnPickupCheckerEndOverlap // (Final|Native|Protected) // @ game+0x18d3420
	void OnPickupCheckerBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function CrowFPS.CrowCharacterPawn.OnPickupCheckerBeginOverlap // (Final|Native|Protected|HasOutParms) // @ game+0x18d31f0
	void OnLadderAnimMontageBlendOut(struct UAnimMontage* AnimMontage, bool bInterruped); // Function CrowFPS.CrowCharacterPawn.OnLadderAnimMontageBlendOut // (Final|Native|Protected) // @ game+0x18d3120
	void OnDestroyVehicle_CharPawn(struct AActor* DestroyedActor); // Function CrowFPS.CrowCharacterPawn.OnDestroyVehicle_CharPawn // (Final|Native|Public) // @ game+0x18d3090
	void OnCompleteMergedMeshFPBody(struct USkeletalMesh* InMergedMesh); // Function CrowFPS.CrowCharacterPawn.OnCompleteMergedMeshFPBody // (Native|Public) // @ game+0x18d3000
	void OnCompleteMergedMeshFPArm(struct USkeletalMesh* InMergedMesh); // Function CrowFPS.CrowCharacterPawn.OnCompleteMergedMeshFPArm // (Native|Public) // @ game+0x18d2f70
	void OnCapsuleHit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult Hit); // Function CrowFPS.CrowCharacterPawn.OnCapsuleHit // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x18d2d90
	void OnCapsuleEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function CrowFPS.CrowCharacterPawn.OnCapsuleEndOverlap // (Final|Native|Protected) // @ game+0x18d2c30
	void OnCapsuleBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function CrowFPS.CrowCharacterPawn.OnCapsuleBeginOverlap // (Final|Native|Protected|HasOutParms) // @ game+0x18d2a00
	void MulticastSetSkydivingMode(bool InValue); // Function CrowFPS.CrowCharacterPawn.MulticastSetSkydivingMode // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x18d27b0
	void Multicast_FlySpeed(float NewSpeed); // Function CrowFPS.CrowCharacterPawn.Multicast_FlySpeed // (Net|Native|Event|NetMulticast|Public|NetValidate) // @ game+0x18d2940
	void Multicast_EndFlashBangFX(); // Function CrowFPS.CrowCharacterPawn.Multicast_EndFlashBangFX // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x18d2920
	void Multicast_ChangeCrowConditionFlag(enum class ECrowConditionFlags CCFlag); // Function CrowFPS.CrowCharacterPawn.Multicast_ChangeCrowConditionFlag // (Net|NetReliableNative|Event|NetMulticast|Public|NetValidate) // @ game+0x18d2860
	void Multicast_BeginFlashBangFX(); // Function CrowFPS.CrowCharacterPawn.Multicast_BeginFlashBangFX // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x18d2840
	void LerpCameraSettings(float LerpAlpha); // Function CrowFPS.CrowCharacterPawn.LerpCameraSettings // (Final|Native|Public) // @ game+0x18d2730
	void Latent_OnDrownedMoving(); // Function CrowFPS.CrowCharacterPawn.Latent_OnDrownedMoving // (Final|Native|Protected) // @ game+0x18d2710
	void Latent_OnDeath(); // Function CrowFPS.CrowCharacterPawn.Latent_OnDeath // (Final|Native|Protected) // @ game+0x18d26f0
	void Latent_LadderStateUpdateDelay(); // Function CrowFPS.CrowCharacterPawn.Latent_LadderStateUpdateDelay // (Final|Native|Protected) // @ game+0xa996d0
	bool IsSkydiving(); // Function CrowFPS.CrowCharacterPawn.IsSkydiving // (Final|Native|Public) // @ game+0x18d26c0
	bool IsPossibleProneArea(); // Function CrowFPS.CrowCharacterPawn.IsPossibleProneArea // (Final|Native|Public) // @ game+0x18d2690
	bool IsCanRevive(); // Function CrowFPS.CrowCharacterPawn.IsCanRevive // (Final|Native|Public) // @ game+0x18d2630
	struct FName GetVehicleName(); // Function CrowFPS.CrowCharacterPawn.GetVehicleName // (Final|Native|Public|BlueprintCallable) // @ game+0x18d2610
	float GetStopBleedingPercent(); // Function CrowFPS.CrowCharacterPawn.GetStopBleedingPercent // (Final|Native|Public) // @ game+0x18d25e0
	struct UCrowStatusBreathWidget* GetStatusWidget(); // Function CrowFPS.CrowCharacterPawn.GetStatusWidget // (Final|Native|Public) // @ game+0x18d25b0
	struct UCrowSoundStateComponent* GetSoundStateComponent(); // Function CrowFPS.CrowCharacterPawn.GetSoundStateComponent // (Final|Native|Public) // @ game+0x18d2580
	enum class EVehicleSeatType GetSeatType(); // Function CrowFPS.CrowCharacterPawn.GetSeatType // (Final|Native|Public|BlueprintCallable) // @ game+0x18d2560
	char GetSeatIndex(); // Function CrowFPS.CrowCharacterPawn.GetSeatIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x18d2540
	float GetReviveSecond(); // Function CrowFPS.CrowCharacterPawn.GetReviveSecond // (Final|Native|Public) // @ game+0x18d2510
	float GetOverBleedingPercent(); // Function CrowFPS.CrowCharacterPawn.GetOverBleedingPercent // (Final|Native|Public) // @ game+0x18d24e0
	struct UCrowVehicleOceanTracker* GetOceanTracker(); // Function CrowFPS.CrowCharacterPawn.GetOceanTracker // (Final|Native|Public) // @ game+0x18d24c0
	bool GetIsDyingState(); // Function CrowFPS.CrowCharacterPawn.GetIsDyingState // (Native|Public|BlueprintCallable) // @ game+0x18d2490
	struct UCrowClothActorComponent* GetFPBody_ClothComponent(); // Function CrowFPS.CrowCharacterPawn.GetFPBody_ClothComponent // (Final|Native|Public) // @ game+0x18d2430
	struct UCrowClothActorComponent* GetFPArm_ClothComponent(); // Function CrowFPS.CrowCharacterPawn.GetFPArm_ClothComponent // (Final|Native|Public) // @ game+0x18d2410
	struct UCrowCharacterFallsComponent* GetFallsComponent(); // Function CrowFPS.CrowCharacterPawn.GetFallsComponent // (Final|Native|Public) // @ game+0x18d2450
	float GetDyingSecond(); // Function CrowFPS.CrowCharacterPawn.GetDyingSecond // (Final|Native|Public) // @ game+0x18d23e0
	struct UCrowCharacterMovementCollision* GetCrowCharacterMovementCollision(); // Function CrowFPS.CrowCharacterPawn.GetCrowCharacterMovementCollision // (Final|Native|Public) // @ game+0x18d23c0
	struct FCrowBattleContainer GetCrowBattleContainer(); // Function CrowFPS.CrowCharacterPawn.GetCrowBattleContainer // (Final|Native|Public|Const) // @ game+0x18d2390
	int32_t GetCanReviveMax(); // Function CrowFPS.CrowCharacterPawn.GetCanReviveMax // (Final|Native|Public) // @ game+0x18d2360
	struct ACrowVehiclePawn* GetBoardingVehicle(); // Function CrowFPS.CrowCharacterPawn.GetBoardingVehicle // (Final|Native|Public|BlueprintCallable) // @ game+0x18d2340
	void EndLookingWeaponMontage(); // Function CrowFPS.CrowCharacterPawn.EndLookingWeaponMontage // (Final|Native|Private) // @ game+0x18d2320
	void ConsumeOxygenTimer(); // Function CrowFPS.CrowCharacterPawn.ConsumeOxygenTimer // (Final|Native|Public) // @ game+0x18d22e0
	void Client_UseWeaponBox(struct ACrowSupplyWeaponActor* WeaponBox); // Function CrowFPS.CrowCharacterPawn.Client_UseWeaponBox // (Net|NetReliableNative|Event|Protected|NetClient|NetValidate) // @ game+0x18d2220
	void Client_UseAmmoBox(struct ACrowSupplyAmmoActor* AmmoBox); // Function CrowFPS.CrowCharacterPawn.Client_UseAmmoBox // (Net|NetReliableNative|Event|Protected|NetClient|NetValidate) // @ game+0x18d2160
};

// Class CrowFPS.CrowAICharacterPawn
// Size: 0x1c30 (Inherited: 0x1c20)
struct ACrowAICharacterPawn : ACrowCharacterPawn {
	struct ACrowAICharacterController* AIController; // 0x1c18(0x08)
	struct ACrowAICharacterCoverPoint* OccupyedCoverPoint; // 0x1c20(0x08)
};

// Class CrowFPS.CrowAICharacterSpawner
// Size: 0x2f0 (Inherited: 0x268)
struct ACrowAICharacterSpawner : ACrowAIObjectCharacterBase {
	bool DisableSpawner; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct FCrowAICharacterSpawnData SpawnData; // 0x270(0x48)
	enum class ECrowAISpawnerState SpawnerState; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct FTimerHandle ProcessSpawnerTimerHandle; // 0x2c0(0x08)
	struct ACrowAIZoneBase* AIZone; // 0x2c8(0x08)
	float WaitTimeForSpawn; // 0x2d0(0x04)
	uint32_t SpawnedAICharacterNum; // 0x2d4(0x04)
	uint32_t DeadAICharacterNum; // 0x2d8(0x04)
	char pad_2DC[0x4]; // 0x2dc(0x04)
	struct TArray<struct ACrowAICharacterPawn*> SpawnedAICharacterPawnList; // 0x2e0(0x10)
};

// Class CrowFPS.CrowAimComponentBase
// Size: 0x108 (Inherited: 0xc0)
struct UCrowAimComponentBase : UCrowActorComponentBase {
	struct UCameraComponent* AimMainCamera; // 0xc0(0x08)
	struct ACrowWeaponBase* CrowWeaponBase; // 0xc8(0x08)
	struct ACrowPlayerControllerBase* PlayerController; // 0xd0(0x08)
	char pad_D8[0x30]; // 0xd8(0x30)
};

// Class CrowFPS.CrowAimComponentVehicle
// Size: 0x130 (Inherited: 0x108)
struct UCrowAimComponentVehicle : UCrowAimComponentBase {
	struct UCrowVehicleSightComponent* VehicleSight; // 0x108(0x08)
	struct FTimerHandle BeginTimerHandle; // 0x110(0x08)
	struct FTimerHandle EndTimerHandle; // 0x118(0x08)
	struct UCurveVector* AimSocketOffsetCurve; // 0x120(0x08)
	float AimSocketOffsetCurveTime; // 0x128(0x04)
	float AimElapsedTimeSecond; // 0x12c(0x04)
};

// Class CrowFPS.CrowAirPlaneRespawnManager
// Size: 0x220 (Inherited: 0x220)
struct ACrowAirPlaneRespawnManager : AActor {
};

// Class CrowFPS.CrowAirPlaneRespawnSplineActor
// Size: 0x320 (Inherited: 0x220)
struct ACrowAirPlaneRespawnSplineActor : AActor {
	float CameraAttachDist; // 0x220(0x04)
	float CameraAttachHeight; // 0x224(0x04)
	float DroppingPossibleDist; // 0x228(0x04)
	float ForcedDroppingDist; // 0x22c(0x04)
	struct USplineComponent* SplineComponent; // 0x230(0x08)
	float RandomAngle; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct FCrowGameIconDisplayInfo IconDisplayInfoRoute; // 0x240(0x88)
	struct UCrowWorldMapIcon* IconRoute; // 0x2c8(0x08)
	char pad_2D0[0x50]; // 0x2d0(0x50)
};

// Class CrowFPS.CrowAISettings
// Size: 0xf8 (Inherited: 0x38)
struct UCrowAISettings : UDeveloperSettings {
	float ArrowSize; // 0x38(0x04)
	float ArrowOffset; // 0x3c(0x04)
	struct TSoftObjectPtr<struct UTexture2D> BillboardSprite; // 0x40(0x28)
	float BillboardSize; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct TSoftObjectPtr<struct USkeletalMesh> CharacterMesh; // 0x70(0x28)
	struct TSoftObjectPtr<struct UMaterialInterface> CharacterMeshMaterial; // 0x98(0x28)
	struct TSoftObjectPtr<struct UAnimSequenceBase> CharacterPreviewAnim; // 0xc0(0x28)
	struct FRotator CharacterMeshRotationOffset; // 0xe8(0x0c)
	char pad_F4[0x4]; // 0xf4(0x04)

	struct UCrowAISettings* Get(); // Function CrowFPS.CrowAISettings.Get // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x18acda0
};

// Class CrowFPS.CrowAIZoneBase
// Size: 0x2d0 (Inherited: 0x220)
struct ACrowAIZoneBase : AActor {
	int32_t SapwnAICharacterNum; // 0x220(0x04)
	enum class ECrowAIZoneState ZoneState; // 0x224(0x04)
	struct TArray<struct ACrowAIZoneRewardBase*> AIZoneRewardList; // 0x228(0x10)
	struct TArray<struct ACrowAICharacterSpawner*> AICharacterSpawnerList; // 0x238(0x10)
	struct TArray<struct ACrowAICharacterCoverPoint*> AICharacterCoverPointList; // 0x248(0x10)
	struct TArray<struct FCrowTeamPawnPair> TeamCharacterArray; // 0x258(0x10)
	struct FTimerHandle UpdateAIZoneTimerHandle; // 0x268(0x08)
	char pad_270[0x60]; // 0x270(0x60)

	void OnEndOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function CrowFPS.CrowAIZoneBase.OnEndOverlap // (Final|Native|Protected) // @ game+0x18b41e0
	void OnBeginOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function CrowFPS.CrowAIZoneBase.OnBeginOverlap // (Final|Native|Protected) // @ game+0x18b4110
	void Client_DrawDebugLine(struct FVector LineStart, struct FVector LineEnd, struct FColor LineColor); // Function CrowFPS.CrowAIZoneBase.Client_DrawDebugLine // (Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults|NetValidate) // @ game+0x18b3df0
};

// Class CrowFPS.CrowAIZoneRewardBase
// Size: 0x238 (Inherited: 0x220)
struct ACrowAIZoneRewardBase : AActor {
	struct ACrowSupplyEventBoxActor* RewardSupplyBoxActor; // 0x220(0x08)
	struct TArray<int32_t> FixItemIndexList; // 0x228(0x10)
};

// Class CrowFPS.CrowAkAmbientSound
// Size: 0x2b0 (Inherited: 0x260)
struct ACrowAkAmbientSound : AAkAmbientSound {
	bool bUseReplay; // 0x260(0x01)
	bool bIgnoreCurrentPlaying; // 0x261(0x01)
	char pad_262[0x2]; // 0x262(0x02)
	float ReplayTerm; // 0x264(0x04)
	bool bUsingEndEvent; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct UAkAudioEvent* EndEvent; // 0x270(0x08)
	float EndEventTerm; // 0x278(0x04)
	float EndEventCoolTime; // 0x27c(0x04)
	bool bDrawDebugInfo; // 0x280(0x01)
	bool bUseSoundStateTest; // 0x281(0x01)
	char pad_282[0x2]; // 0x282(0x02)
	float SoundStateRadius; // 0x284(0x04)
	enum class ECrowSoundStateType SoundStateType; // 0x288(0x01)
	char pad_289[0x1f]; // 0x289(0x1f)
	struct ATextRenderActor* TRA; // 0x2a8(0x08)
};

// Class CrowFPS.CrowAkAmbientSoundFade
// Size: 0x288 (Inherited: 0x260)
struct ACrowAkAmbientSoundFade : AAkAmbientSound {
	char pad_260[0x8]; // 0x260(0x08)
	struct FString RTPC_Name; // 0x268(0x10)
	struct UAkAudioEvent* EnterEvent; // 0x278(0x08)
	struct UAkAudioEvent* ExitEvent; // 0x280(0x08)
};

// Class CrowFPS.CrowAmmoTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowAmmoTable : UDataTable {
};

// Class CrowFPS.CrowAnimNotify_AkEvent
// Size: 0x50 (Inherited: 0x38)
struct UCrowAnimNotify_AkEvent : UAnimNotify {
	struct FName AttoachPointName; // 0x38(0x08)
	struct UAkAudioEvent* FPEvent; // 0x40(0x08)
	struct UAkAudioEvent* TPEvent; // 0x48(0x08)
};

// Class CrowFPS.CrowAnimNotifyBase
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyBase : UAnimNotify {

	bool IsThirdPersonMesh(struct USkeletalMeshComponent* MeshComp); // Function CrowFPS.CrowAnimNotifyBase.IsThirdPersonMesh // (Final|Native|Public|Const) // @ game+0x18b3f70
};

// Class CrowFPS.CrowAnimNotifyAmmoReplaceClip
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyAmmoReplaceClip : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyAmmoReloadOne
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyAmmoReloadOne : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowCharacterAnimNoitfy_SimpleLog
// Size: 0x38 (Inherited: 0x38)
struct UCrowCharacterAnimNoitfy_SimpleLog : UAnimNotify {
};

// Class CrowFPS.CrowCharacterAnimNoitfy_TurnInPlace
// Size: 0x38 (Inherited: 0x30)
struct UCrowCharacterAnimNoitfy_TurnInPlace : UAnimNotifyState {
	struct UCurveFloat* RotationCurveAsset; // 0x30(0x08)
};

// Class CrowFPS.CrowCharacterAnimNoitfy_ToRagdoll
// Size: 0x38 (Inherited: 0x38)
struct UCrowCharacterAnimNoitfy_ToRagdoll : UAnimNotify {
};

// Class CrowFPS.CrowCharacterAnimNotify_CameraShake
// Size: 0x48 (Inherited: 0x38)
struct UCrowCharacterAnimNotify_CameraShake : UAnimNotify {
	struct UMatineeCameraShake* ShakeClass; // 0x38(0x08)
	float Scale; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class CrowFPS.CrowCharacterAnimNotify_FootStep
// Size: 0x50 (Inherited: 0x38)
struct UCrowCharacterAnimNotify_FootStep : UAnimNotify {
	enum class ECrowCharacterFootStepType FootStepType; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float Loudness; // 0x3c(0x04)
	struct FName BoneName; // 0x40(0x08)
	struct FName ToeName; // 0x48(0x08)
};

// Class CrowFPS.CrowCharacterAnimNotify_LeftFoot
// Size: 0x50 (Inherited: 0x50)
struct UCrowCharacterAnimNotify_LeftFoot : UCrowCharacterAnimNotify_FootStep {
};

// Class CrowFPS.CrowCharacterAnimNotify_RightFoot
// Size: 0x50 (Inherited: 0x50)
struct UCrowCharacterAnimNotify_RightFoot : UCrowCharacterAnimNotify_FootStep {
};

// Class CrowFPS.CrowCharacterAnimNotify_Rotate
// Size: 0x40 (Inherited: 0x38)
struct UCrowCharacterAnimNotify_Rotate : UAnimNotify {
	char pad_38[0x8]; // 0x38(0x08)
};

// Class CrowFPS.CrowCharacterAnimNotify_Rotate90
// Size: 0x40 (Inherited: 0x40)
struct UCrowCharacterAnimNotify_Rotate90 : UCrowCharacterAnimNotify_Rotate {
};

// Class CrowFPS.CrowCharacterAnimNotify_Rotate180
// Size: 0x40 (Inherited: 0x40)
struct UCrowCharacterAnimNotify_Rotate180 : UCrowCharacterAnimNotify_Rotate {
};

// Class CrowFPS.CrowCharacterAnimNotify_ShowWeapon
// Size: 0x38 (Inherited: 0x38)
struct UCrowCharacterAnimNotify_ShowWeapon : UAnimNotify {
};

// Class CrowFPS.CrowCharacterAnimNotify_HideWeapon
// Size: 0x38 (Inherited: 0x38)
struct UCrowCharacterAnimNotify_HideWeapon : UAnimNotify {
};

// Class CrowFPS.CrowCharacterAnimNotify_Swim
// Size: 0x98 (Inherited: 0x38)
struct UCrowCharacterAnimNotify_Swim : UAnimNotify {
	bool IsFP; // 0x38(0x01)
	enum class ECrowCharacterSwimAction Action; // 0x39(0x01)
	char Speed; // 0x3a(0x01)
	enum class ECrowCharacterSwimBodyParts BodyParts; // 0x3b(0x01)
	struct FName SocketName; // 0x3c(0x08)
	struct FVector LocationOffset; // 0x44(0x0c)
	struct FRotator RotationOffset; // 0x50(0x0c)
	bool bIsAttachedBone; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
	struct FName PreviewMaterialName; // 0x60(0x08)
	bool PreviewIsDiving; // 0x68(0x01)
	char pad_69[0x2f]; // 0x69(0x2f)
};

// Class CrowFPS.CrowCharacterAnimNotify_SpreadParachute
// Size: 0x38 (Inherited: 0x38)
struct UCrowCharacterAnimNotify_SpreadParachute : UAnimNotify {
};

// Class CrowFPS.CrowCharacterAnimNotify_GasMask
// Size: 0x40 (Inherited: 0x38)
struct UCrowCharacterAnimNotify_GasMask : UAnimNotify {
	enum class ECrowCharacterGasMaskNotifyType NotifyType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class CrowFPS.CrowCharacterAnimNotify_SkydivingEnd
// Size: 0x40 (Inherited: 0x40)
struct UCrowCharacterAnimNotify_SkydivingEnd : UCrowCharacterAnimNotify_Rotate {
};

// Class CrowFPS.CrowCharacterAnimNotify_PlayParticle1P
// Size: 0x90 (Inherited: 0x90)
struct UCrowCharacterAnimNotify_PlayParticle1P : UAnimNotify_PlayParticleEffect {
};

// Class CrowFPS.CrowCharacterAnimNotify_PlayParticle3P
// Size: 0x90 (Inherited: 0x90)
struct UCrowCharacterAnimNotify_PlayParticle3P : UAnimNotify_PlayParticleEffect {
};

// Class CrowFPS.CrowAnimNotifyGrenadePullPin
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyGrenadePullPin : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyGrenadeBegin
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyGrenadeBegin : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyGrenadeRelease
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyGrenadeRelease : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyGrenadeEnd
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyGrenadeEnd : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyHandlerBase
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyHandlerBase : UAnimNotify {
};

// Class CrowFPS.CrowAnimNotifyWeaponBase
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponBase : UCrowAnimNotifyHandlerBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponFire1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponFire1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponFire3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponFire3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponShellEject1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponShellEject1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponShellEject3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponShellEject3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadBegin1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadBegin1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadEnd1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadEnd1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadBegin3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadBegin3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadEnd3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadEnd3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponDeselected1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponDeselected1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponDeselected3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponDeselected3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponAttachLeftHand1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponAttachLeftHand1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponAttachLeftHand3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponAttachLeftHand3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponAttachRightHand1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponAttachRightHand1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponAttachRightHand3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponAttachRightHand3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponThrowMagazine1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponThrowMagazine1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponThrowMagazine3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponThrowMagazine3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponAttachNewMagazine1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponAttachNewMagazine1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponAttachNewMagazine3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponAttachNewMagazine3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponDetachOldMagazine1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponDetachOldMagazine1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponDetachOldMagazine3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponDetachOldMagazine3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponAttachBag3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponAttachBag3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadShortBegin1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadShortBegin1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadShortBegin3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadShortBegin3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadShortDetach1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadShortDetach1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadShortDetach3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadShortDetach3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadShortAttach1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadShortAttach1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadShortAttach3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadShortAttach3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadShortEnd1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadShortEnd1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponReloadShortEnd3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponReloadShortEnd3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponShow
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponShow : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponHide
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponHide : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponMeleeThrow1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponMeleeThrow1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponMeleeThrow3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponMeleeThrow3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponThrowPinOut1P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponThrowPinOut1P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponThrowPinOut3P
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponThrowPinOut3P : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponShowAllBullet
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponShowAllBullet : UCrowAnimNotifyWeaponBase {
};

// Class CrowFPS.CrowAnimNotifyInterface
// Size: 0x28 (Inherited: 0x28)
struct UCrowAnimNotifyInterface : UInterface {

	void OnAnimNotify(enum class ECrowCrowAnimNotify Notify, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function CrowFPS.CrowAnimNotifyInterface.OnAnimNotify // (Native|Event|Public|BlueprintEvent) // @ game+0x18b4010
};

// Class CrowFPS.CrowAnimNotifyWeaponEquipBegin
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponEquipBegin : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponEquipReplace
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponEquipReplace : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponEquipReady
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponEquipReady : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponEquipEnd
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponEquipEnd : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponAim
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponAim : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowAnimNotifyWeaponStow
// Size: 0x38 (Inherited: 0x38)
struct UCrowAnimNotifyWeaponStow : UCrowAnimNotifyBase {
};

// Class CrowFPS.CrowArmorTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowArmorTable : UDataTable {
};

// Class CrowFPS.CrowArrowComponent
// Size: 0x460 (Inherited: 0x460)
struct UCrowArrowComponent : UArrowComponent {
};

// Class CrowFPS.CrowAttachedWorldIcon
// Size: 0x2c8 (Inherited: 0x220)
struct ACrowAttachedWorldIcon : AActor {
	struct USceneComponent* IconLocation; // 0x220(0x08)
	enum class ECrowIconType IconType; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct FCrowGameIconDisplayInfo IconDisplayInfo; // 0x230(0x88)
	struct AActor* ParentActor; // 0x2b8(0x08)
	struct UCrowWorldIconWidgetBase* Indicator; // 0x2c0(0x08)

	void OnParentActorDestroyed(struct AActor* DestroyedActor); // Function CrowFPS.CrowAttachedWorldIcon.OnParentActorDestroyed // (Final|Native|Protected) // @ game+0x18b8c80
};

// Class CrowFPS.CrowAudioCheckComponent
// Size: 0x210 (Inherited: 0x200)
struct UCrowAudioCheckComponent : USceneComponent {
	struct TArray<struct UShapeComponent*> Collision; // 0x1f8(0x10)
	enum class EActorType ActorType; // 0x208(0x01)

	void SetActorType(enum class EActorType NewActorType); // Function CrowFPS.CrowAudioCheckComponent.SetActorType // (Final|Native|Public) // @ game+0x18b9190
	enum class EActorType GetActorType(); // Function CrowFPS.CrowAudioCheckComponent.GetActorType // (Final|Native|Public) // @ game+0x18b8750
};

// Class CrowFPS.CrowBackPackInfoWidget
// Size: 0x388 (Inherited: 0x348)
struct UCrowBackPackInfoWidget : UCrowWidgetBase {
	struct UGridPanel* GP_BackPackSlot; // 0x348(0x08)
	struct UCrowInventoryInputEventHandler* WB_CrowDragDropPanel; // 0x350(0x08)
	struct UBorder* BD_BackGround_ItemSlot; // 0x358(0x08)
	struct UUserWidget* BackPackListItem; // 0x360(0x08)
	int32_t RowCount; // 0x368(0x04)
	int32_t ColumnCount; // 0x36c(0x04)
	struct TArray<struct UCrowBackPackListItemWidget*> BackPackItemList; // 0x370(0x10)
	struct UCrowGameInvenComponent* CrowGameInvenComponent; // 0x380(0x08)
};

// Class CrowFPS.CrowInvenItemSlot
// Size: 0x668 (Inherited: 0x348)
struct UCrowInvenItemSlot : UCrowWidgetBase {
	bool IsShowMouseDesc; // 0x348(0x01)
	char pad_349[0x7]; // 0x349(0x07)
	struct ACrowItemBase* ItemData; // 0x350(0x08)
	struct FCrowWeaponPartsTableRow WeaponPartsTableRow; // 0x358(0x2f8)
	struct UCrowItemInfoWidget* ItemInfoWidget; // 0x650(0x08)
	struct UUserWidget* ItemToolTipWidget; // 0x658(0x08)
	char pad_660[0x8]; // 0x660(0x08)
};

// Class CrowFPS.CrowBackPackListItemWidget
// Size: 0x6c8 (Inherited: 0x668)
struct UCrowBackPackListItemWidget : UCrowInvenItemSlot {
	int32_t SlotIndex; // 0x668(0x04)
	char pad_66C[0x4]; // 0x66c(0x04)
	struct ACrowPickupInventory* PickUpInven; // 0x670(0x08)
	struct UImage* IMG_Frame; // 0x678(0x08)
	struct UImage* IMG_ItemIcon; // 0x680(0x08)
	struct UImage* IMG_Lock; // 0x688(0x08)
	struct UTextBlock* TB_ItemAmount; // 0x690(0x08)
	struct UTextBlock* TB_ItemName; // 0x698(0x08)
	struct UCrowDragDropWidgetBase* WB_CrowDragDropPanel; // 0x6a0(0x08)
	struct UImage* IMG_WeaponBack; // 0x6a8(0x08)
	struct UImage* IMG_Back; // 0x6b0(0x08)
	struct UCrowDragItem* DragItem; // 0x6b8(0x08)
	bool bIsLock; // 0x6c0(0x01)
	char pad_6C1[0x7]; // 0x6c1(0x07)
};

// Class CrowFPS.CrowBackPackLootWidget
// Size: 0x348 (Inherited: 0x348)
struct UCrowBackPackLootWidget : UCrowWidgetBase {
};

// Class CrowFPS.CrowBannerIndicatorBtnWidget
// Size: 0x360 (Inherited: 0x348)
struct UCrowBannerIndicatorBtnWidget : UCrowWidgetBase {
	char pad_348[0x8]; // 0x348(0x08)
	struct UCrowButton* IndicatorBtn; // 0x350(0x08)
	struct TWeakObjectPtr<struct UCrowWidgetBase> BannerWidget; // 0x358(0x08)

	void CallBannerOrder(); // Function CrowFPS.CrowBannerIndicatorBtnWidget.CallBannerOrder // (Final|Native|Public) // @ game+0x18b8730
};

// Class CrowFPS.CrowBannerItem
// Size: 0x358 (Inherited: 0x348)
struct UCrowBannerItem : UCrowWidgetBase {
	struct UImage* BannerImage; // 0x348(0x08)
	char pad_350[0x8]; // 0x350(0x08)

	void CallBannerLink(); // Function CrowFPS.CrowBannerItem.CallBannerLink // (Final|Native|Public) // @ game+0x18b8710
};

// Class CrowFPS.CrowBannerWidget
// Size: 0x390 (Inherited: 0x348)
struct UCrowBannerWidget : UCrowWidgetBase {
	struct UUserWidget* ChildClass; // 0x348(0x08)
	struct UUserWidget* IndicatorClass; // 0x350(0x08)
	struct UScrollBox* ScrollBoxWidget; // 0x358(0x08)
	struct UHorizontalBox* Indicator; // 0x360(0x08)
	char pad_368[0x28]; // 0x368(0x28)

	void InitBanner(struct TArray<int32_t> InBannerIndexList); // Function CrowFPS.CrowBannerWidget.InitBanner // (Final|Native|Public|BlueprintCallable) // @ game+0x18b8950
};

// Class CrowFPS.CrowBattleActorInterface
// Size: 0x28 (Inherited: 0x28)
struct UCrowBattleActorInterface : UInterface {

	struct UCrowBattleStatus* GetBattleStatus(); // Function CrowFPS.CrowBattleActorInterface.GetBattleStatus // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x18b8800
	struct UCrowBattleShape* GetBattleShape(); // Function CrowFPS.CrowBattleActorInterface.GetBattleShape // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x18b87d0
	struct UCrowBattleIdentity* GetBattleIdentity(); // Function CrowFPS.CrowBattleActorInterface.GetBattleIdentity // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x18b87a0
	struct UCrowBattleDamageHandlerBase* GetBattleDamageHandler(); // Function CrowFPS.CrowBattleActorInterface.GetBattleDamageHandler // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x18b8770
};

// Class CrowFPS.CrowBattleCalculator
// Size: 0x28 (Inherited: 0x28)
struct UCrowBattleCalculator : UObject {
};

// Class CrowFPS.CrowBattleDamageHandlerBase
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowBattleDamageHandlerBase : UActorComponent {
};

// Class CrowFPS.CrowBattleHUDCrosshair
// Size: 0x288 (Inherited: 0x260)
struct UCrowBattleHUDCrosshair : UUserWidget {
	char pad_260[0x20]; // 0x260(0x20)
	struct UOverlay* OV_Crosshair; // 0x280(0x08)

	void ToggleCrosshair(bool isOn); // Function CrowFPS.CrowBattleHUDCrosshair.ToggleCrosshair // (Final|Native|Public) // @ game+0x18b9330
	void OnSingleRecoil(); // Function CrowFPS.CrowBattleHUDCrosshair.OnSingleRecoil // (Final|Native|Public|BlueprintCallable) // @ game+0x18b8d30
	void OnDisplayingRecoil(); // Function CrowFPS.CrowBattleHUDCrosshair.OnDisplayingRecoil // (Final|Native|Public|BlueprintCallable) // @ game+0x18b8c40
};

// Class CrowFPS.CrowBattleHUDMain
// Size: 0x270 (Inherited: 0x260)
struct UCrowBattleHUDMain : UUserWidget {
	struct UCrowBattleHUDCrosshair* crosshairWidget; // 0x260(0x08)
	struct UCrowBattleHUDWeaponState* weaponStateWidget; // 0x268(0x08)

	void OnCreateWeaponStateWidget(struct UUserWidget* weaponStateWidget); // Function CrowFPS.CrowBattleHUDMain.OnCreateWeaponStateWidget // (Final|Native|Protected|BlueprintCallable) // @ game+0x18b8bb0
	void OnCreateCrosshairWidget(struct UUserWidget* crosshairWidget); // Function CrowFPS.CrowBattleHUDMain.OnCreateCrosshairWidget // (Final|Native|Protected|BlueprintCallable) // @ game+0x18b8b20
};

// Class CrowFPS.CrowBattleHUDWeaponState
// Size: 0x268 (Inherited: 0x260)
struct UCrowBattleHUDWeaponState : UUserWidget {
	struct UTextBlock* TextVehicleSpeed; // 0x260(0x08)

	void BIE_PrintString(struct FString String); // Function CrowFPS.CrowBattleHUDWeaponState.BIE_PrintString // (Event|Protected|BlueprintEvent) // @ game+0x1d38500
	void BIE_OnShowTextVehicleSpeed(); // Function CrowFPS.CrowBattleHUDWeaponState.BIE_OnShowTextVehicleSpeed // (Event|Protected|BlueprintEvent) // @ game+0x1d38500
	void BIE_OnInitTextVehicleSpeed(); // Function CrowFPS.CrowBattleHUDWeaponState.BIE_OnInitTextVehicleSpeed // (Event|Protected|BlueprintEvent) // @ game+0x1d38500
	void BIE_OnHideTextVehicleSpeed(); // Function CrowFPS.CrowBattleHUDWeaponState.BIE_OnHideTextVehicleSpeed // (Event|Protected|BlueprintEvent) // @ game+0x1d38500
};

// Class CrowFPS.CrowBattleIdentity
// Size: 0xd0 (Inherited: 0xb0)
struct UCrowBattleIdentity : UActorComponent {
	struct AActor* OwnerActor; // 0xb0(0x08)
	struct FText UIName; // 0xb8(0x18)

	void SetUIName(struct FText NewName); // Function CrowFPS.CrowBattleIdentity.SetUIName // (Final|Native|Public|BlueprintCallable) // @ game+0x18b9210
	bool IsEnemyOf(struct UCrowBattleIdentity* Other); // Function CrowFPS.CrowBattleIdentity.IsEnemyOf // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18b8a40
	void Init(struct AActor* NewOwnerActor); // Function CrowFPS.CrowBattleIdentity.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x18b88c0
	struct FText GetUIName(); // Function CrowFPS.CrowBattleIdentity.GetUIName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18b8830
};

// Class CrowFPS.CrowFullScreenWidgetBase
// Size: 0x368 (Inherited: 0x348)
struct UCrowFullScreenWidgetBase : UCrowWidgetBase {
	char pad_348[0x8]; // 0x348(0x08)
	struct TArray<struct FCrowHideWidgetInfo> HideWidgetArray; // 0x350(0x10)
	char pad_360[0x8]; // 0x360(0x08)
};

// Class CrowFPS.CrowBattleInventoryLoot
// Size: 0x410 (Inherited: 0x368)
struct UCrowBattleInventoryLoot : UCrowFullScreenWidgetBase {
	struct UUserWidget* SlotWidget; // 0x368(0x08)
	struct UUserWidget* ItemToolTipWidget; // 0x370(0x08)
	float CloseDistance; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)
	struct UCrowBackPackInfoWidget* WB_BackPackInfo; // 0x380(0x08)
	struct UScrollBox* SCB_LootingSlotWidget; // 0x388(0x08)
	struct UCanvasPanel* ItemPanel; // 0x390(0x08)
	struct UCrowInvenWeaponListSubItemWidget* WB_HelmetSlot; // 0x398(0x08)
	struct UCrowInvenWeaponListSubItemWidget* WB_ArmorSlot; // 0x3a0(0x08)
	struct UCrowInvenWeaponListSubItemWidget* WB_BackPackSlot; // 0x3a8(0x08)
	struct UCrowInvenWeaponListSubItemWidget* WB_KitSlot; // 0x3b0(0x08)
	struct UTextBlock* TB_InvenType; // 0x3b8(0x08)
	struct UCrowGameInvenComponent* InvenComponent; // 0x3c0(0x08)
	struct UCrowLootInvenItemInfo* ItemInfoWidget; // 0x3c8(0x08)
	struct ACrowItemBase* CurrArmorItem; // 0x3d0(0x08)
	struct ACrowItemBase* CurrHelmetItem; // 0x3d8(0x08)
	struct ACrowItemBase* CurrBackPackItem; // 0x3e0(0x08)
	struct ACrowItemBase* CurrKitItem; // 0x3e8(0x08)
	struct ACrowItemBase* CurrentItem; // 0x3f0(0x08)
	struct ACrowPickupInventory* CurrentPickupInven; // 0x3f8(0x08)
	int32_t CurrentCount; // 0x400(0x04)
	int32_t PickupInvenIndex; // 0x404(0x04)
	struct FVector2D CurrentMousePosition; // 0x408(0x08)

	void OnCloseInven(); // Function CrowFPS.CrowBattleInventoryLoot.OnCloseInven // (Final|Native|Public|BlueprintCallable) // @ game+0x18b8b00
};

// Class CrowFPS.CrowBattleInventoryWidget
// Size: 0x400 (Inherited: 0x368)
struct UCrowBattleInventoryWidget : UCrowFullScreenWidgetBase {
	struct UCrowInventoryInputEventHandler* DragStartInputHandler; // 0x368(0x08)
	struct UCrowInventoryInputEventHandler* DragEndInputHandler; // 0x370(0x08)
	struct UCrowInvenItemSlot* DragStartWidget; // 0x378(0x08)
	struct UCrowInvenItemSlot* DragEndWidget; // 0x380(0x08)
	struct UCrowBackPackInfoWidget* WB_BackPackInfo; // 0x388(0x08)
	struct UCrowLoadoutInfoWidget* WB_LoadoutInfo; // 0x390(0x08)
	struct UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_2; // 0x398(0x08)
	struct UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_3; // 0x3a0(0x08)
	struct UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_4; // 0x3a8(0x08)
	struct UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_5; // 0x3b0(0x08)
	struct UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_6; // 0x3b8(0x08)
	struct UCrowInvenArmorInfoWidget* WB_InvenArmorInfo; // 0x3c0(0x08)
	struct UCrowDropBoxWidget* WB_DropBox_L; // 0x3c8(0x08)
	struct UCrowDropBoxWidget* WB_DropBox__R; // 0x3d0(0x08)
	struct UButton* BTN_PIE_Exit; // 0x3d8(0x08)
	struct TArray<struct UCrowTutorialInventoryWidget*> DiscriptionWidgetList; // 0x3e0(0x10)
	struct TWeakObjectPtr<struct UCrowGameInvenComponent> CrowGameInvenComponent; // 0x3f0(0x08)
	struct UCrowInventoryInputEventHandler* SelectDragWidget; // 0x3f8(0x08)
};

// Class CrowFPS.CrowInputBase
// Size: 0x140 (Inherited: 0x138)
struct UCrowInputBase : UInputComponent {
	struct UObject* BindObject; // 0x138(0x08)
};

// Class CrowFPS.CrowBattleMenuInput
// Size: 0x170 (Inherited: 0x140)
struct UCrowBattleMenuInput : UCrowInputBase {
	struct APlayerController* PlayerController; // 0x140(0x08)
	char pad_148[0x28]; // 0x148(0x28)

	void ToggleScoreBoard(); // Function CrowFPS.CrowBattleMenuInput.ToggleScoreBoard // (Final|Native|Private) // @ game+0x18b9400
	void ToggleLoadout(); // Function CrowFPS.CrowBattleMenuInput.ToggleLoadout // (Final|Native|Private) // @ game+0x18b93e0
	void ToggleItemInfoViewMode(); // Function CrowFPS.CrowBattleMenuInput.ToggleItemInfoViewMode // (Final|Native|Private) // @ game+0x18b93c0
	void ScrollAxis(float Axis); // Function CrowFPS.CrowBattleMenuInput.ScrollAxis // (Final|Native|Private) // @ game+0x18b9110
	void RepeatRadialMenuThrow(); // Function CrowFPS.CrowBattleMenuInput.RepeatRadialMenuThrow // (Final|Native|Private) // @ game+0x18b90f0
	void RepeatRadialMenuSpray(); // Function CrowFPS.CrowBattleMenuInput.RepeatRadialMenuSpray // (Final|Native|Private) // @ game+0x18b90d0
	void RepeatRadialMenuHealKit(); // Function CrowFPS.CrowBattleMenuInput.RepeatRadialMenuHealKit // (Final|Native|Private) // @ game+0x18b90b0
	void RepeatEmotion(); // Function CrowFPS.CrowBattleMenuInput.RepeatEmotion // (Final|Native|Private) // @ game+0x18b9090
	void ReleasedVoiceTalk(); // Function CrowFPS.CrowBattleMenuInput.ReleasedVoiceTalk // (Final|Native|Private) // @ game+0x18b9070
	void ReleasedUse(); // Function CrowFPS.CrowBattleMenuInput.ReleasedUse // (Final|Native|Private) // @ game+0x18b9050
	void ReleasedSubUse(); // Function CrowFPS.CrowBattleMenuInput.ReleasedSubUse // (Final|Native|Private) // @ game+0x18b9030
	void ReleasedSquadMatchMenu(); // Function CrowFPS.CrowBattleMenuInput.ReleasedSquadMatchMenu // (Final|Native|Private) // @ game+0x18b9010
	void ReleasedRadialMenuThrow(); // Function CrowFPS.CrowBattleMenuInput.ReleasedRadialMenuThrow // (Final|Native|Private) // @ game+0x18b8ff0
	void ReleasedRadialMenuSpray(); // Function CrowFPS.CrowBattleMenuInput.ReleasedRadialMenuSpray // (Final|Native|Private) // @ game+0x18b8fd0
	void ReleasedRadialMenuHealKit(); // Function CrowFPS.CrowBattleMenuInput.ReleasedRadialMenuHealKit // (Final|Native|Private) // @ game+0x18b8fb0
	void ReleasedPing(); // Function CrowFPS.CrowBattleMenuInput.ReleasedPing // (Final|Native|Private) // @ game+0x18b8f90
	void ReleasedInputGuide(); // Function CrowFPS.CrowBattleMenuInput.ReleasedInputGuide // (Final|Native|Private) // @ game+0x18b8f70
	void ReleasedInGameModeGuide(); // Function CrowFPS.CrowBattleMenuInput.ReleasedInGameModeGuide // (Final|Native|Private) // @ game+0x18b8f50
	void ReleasedEmotion(); // Function CrowFPS.CrowBattleMenuInput.ReleasedEmotion // (Final|Native|Private) // @ game+0x18b8f30
	void ReleasedConquestSkill(); // Function CrowFPS.CrowBattleMenuInput.ReleasedConquestSkill // (Final|Native|Private) // @ game+0x18b8f10
	void PressVoiceAllMute(); // Function CrowFPS.CrowBattleMenuInput.PressVoiceAllMute // (Final|Native|Private) // @ game+0x18b8d70
	void PressedVoiceTalk(); // Function CrowFPS.CrowBattleMenuInput.PressedVoiceTalk // (Final|Native|Private) // @ game+0x18b8ef0
	void PressedUse(); // Function CrowFPS.CrowBattleMenuInput.PressedUse // (Final|Native|Private) // @ game+0x18b8ed0
	void PressedSubUse(); // Function CrowFPS.CrowBattleMenuInput.PressedSubUse // (Final|Native|Private) // @ game+0x18b8eb0
	void PressedSquadMatchMenu(); // Function CrowFPS.CrowBattleMenuInput.PressedSquadMatchMenu // (Final|Native|Private) // @ game+0x18b8e90
	void PressedRadialMenuThrow(); // Function CrowFPS.CrowBattleMenuInput.PressedRadialMenuThrow // (Final|Native|Private) // @ game+0x18b8e70
	void PressedRadialMenuSpray(); // Function CrowFPS.CrowBattleMenuInput.PressedRadialMenuSpray // (Final|Native|Private) // @ game+0x18b8e50
	void PressedRadialMenuHealKit(); // Function CrowFPS.CrowBattleMenuInput.PressedRadialMenuHealKit // (Final|Native|Private) // @ game+0x18b8e30
	void PressedPing(); // Function CrowFPS.CrowBattleMenuInput.PressedPing // (Final|Native|Private) // @ game+0x18b8e10
	void PressedInputGuide(); // Function CrowFPS.CrowBattleMenuInput.PressedInputGuide // (Final|Native|Private) // @ game+0x18b8df0
	void PressedInGameModeGuide(); // Function CrowFPS.CrowBattleMenuInput.PressedInGameModeGuide // (Final|Native|Private) // @ game+0x18b8dd0
	void PressedEmotion(); // Function CrowFPS.CrowBattleMenuInput.PressedEmotion // (Final|Native|Private) // @ game+0x18b8db0
	void PressedConquestSkill(); // Function CrowFPS.CrowBattleMenuInput.PressedConquestSkill // (Final|Native|Private) // @ game+0x18b8d90
	void OpenGameMenu(); // Function CrowFPS.CrowBattleMenuInput.OpenGameMenu // (Final|Native|Private) // @ game+0x18b8d50
	void OnPressWorldMap(); // Function CrowFPS.CrowBattleMenuInput.OnPressWorldMap // (Final|Native|Private) // @ game+0x18b8d10
	void OnHome(); // Function CrowFPS.CrowBattleMenuInput.OnHome // (Final|Native|Private) // @ game+0x18b8c60
	void MinimapZoom(); // Function CrowFPS.CrowBattleMenuInput.MinimapZoom // (Final|Native|Private) // @ game+0x18b8ae0
};

// Class CrowFPS.CrowBattlePassTableManager
// Size: 0x168 (Inherited: 0x28)
struct UCrowBattlePassTableManager : UObject {
	struct TMap<struct FName, struct FCrowBattlePassSeasonTableRow> SeasonTableRows; // 0x28(0x50)
	struct TMap<struct FString, struct FCrowBattlePassPackageData> PackageTableRowDatas; // 0x78(0x50)
	struct TMap<struct FName, struct FCrowBattlePassFreePassCostTableRow> FreePassCostTableRows; // 0xc8(0x50)
	struct TMap<struct FName, struct FCrowBattlePassLevelInfoTableRow> LevelInfoTableRows; // 0x118(0x50)
};

// Class CrowFPS.CrowBattlePassWidget
// Size: 0x3c8 (Inherited: 0x348)
struct UCrowBattlePassWidget : UCrowWidgetBase {
	struct TArray<struct UCrowBattlePassItemSlotWidget*> BattlePassItemSlotWidgets; // 0x348(0x10)
	struct UWidgetSwitcher* WS_BattlePass_PurchaseImageState; // 0x358(0x08)
	struct UWidgetSwitcher* WS_BattlePass_PurchaseInfoState; // 0x360(0x08)
	struct UTextBlock* TB_BattlePass_Inactive_Season; // 0x368(0x08)
	struct UTextBlock* TB_BattlePass_Active_Season; // 0x370(0x08)
	struct UTextBlock* TB_BattlePass_Inactive_Season_Period; // 0x378(0x08)
	struct UTextBlock* TB_BattlePass_Active_Season_Period; // 0x380(0x08)
	struct UButton* BT_BattlePass_Purchase; // 0x388(0x08)
	struct UButton* BT_BattlePass_FreePass; // 0x390(0x08)
	struct UWidgetSwitcher* WS_BattlePass_FreePass; // 0x398(0x08)
	struct UTextBlock* TB_BattlePass_FreePass_SelectedLevel; // 0x3a0(0x08)
	struct UButton* BT_Arrow_L; // 0x3a8(0x08)
	struct UButton* BT_Arrow_R; // 0x3b0(0x08)
	struct UCrowBattlePassItemSlotWidget* WB_BattlePass_Items; // 0x3b8(0x08)
	bool bIsActivated; // 0x3c0(0x01)
	char ActivatedSeasonIndex; // 0x3c1(0x01)
	uint16_t BattlePassLevel; // 0x3c2(0x02)
	char pad_3C4[0x4]; // 0x3c4(0x04)

	void OnClicked_BT_BattlePass_Purchase(); // Function CrowFPS.CrowBattlePassWidget.OnClicked_BT_BattlePass_Purchase // (Final|Native|Protected) // @ game+0xa996d0
	void OnClicked_BT_BattlePass_FreePass(); // Function CrowFPS.CrowBattlePassWidget.OnClicked_BT_BattlePass_FreePass // (Final|Native|Protected) // @ game+0xa996d0
	void OnClicked_BT_Arrow_R(); // Function CrowFPS.CrowBattlePassWidget.OnClicked_BT_Arrow_R // (Final|Native|Protected) // @ game+0xa996d0
	void OnClicked_BT_Arrow_L(); // Function CrowFPS.CrowBattlePassWidget.OnClicked_BT_Arrow_L // (Final|Native|Protected) // @ game+0xa996d0
};

// Class CrowFPS.CrowBattlePassItemSlotWidget
// Size: 0x438 (Inherited: 0x348)
struct UCrowBattlePassItemSlotWidget : UCrowWidgetBase {
	bool bIsOpend; // 0x348(0x01)
	char pad_349[0x1]; // 0x349(0x01)
	uint16_t NeedLevel; // 0x34a(0x02)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct FCrowRewardItem FreeRewardItem; // 0x350(0x30)
	struct FCrowRewardItem PaidRewardItem; // 0x380(0x30)
	struct UButton* BT_FreeItem; // 0x3b0(0x08)
	struct UImage* IMG_FreeItem_Inactive_BG; // 0x3b8(0x08)
	struct UImage* IMG_FreeItem_Inactive_BG2; // 0x3c0(0x08)
	struct UImage* IMG_FreeItem_Active_BG; // 0x3c8(0x08)
	struct UImage* IMG_FreeItem_Active_BG2; // 0x3d0(0x08)
	struct UImage* IMG_FreeItem; // 0x3d8(0x08)
	struct UImage* IMG_FreeItem_Check; // 0x3e0(0x08)
	struct UTextBlock* TB_Level; // 0x3e8(0x08)
	struct UImage* IMG_Lock; // 0x3f0(0x08)
	struct UProgressBar* PB_BattlePassExp; // 0x3f8(0x08)
	struct UButton* BT_PaidItem; // 0x400(0x08)
	struct UImage* IMG_PaidItem_Inactive_BG; // 0x408(0x08)
	struct UImage* IMG_PaidItem_Inactive_BG2; // 0x410(0x08)
	struct UImage* IMG_PaidItem_Active_BG; // 0x418(0x08)
	struct UImage* IMG_PaidItem_Active_BG2; // 0x420(0x08)
	struct UImage* IMG_PaidItem; // 0x428(0x08)
	struct UImage* IMG_PaidItem_Check; // 0x430(0x08)

	void OnHovered_BT_PaidItem(); // Function CrowFPS.CrowBattlePassItemSlotWidget.OnHovered_BT_PaidItem // (Final|Native|Protected) // @ game+0xa996d0
	void OnHovered_BT_FreeItem(); // Function CrowFPS.CrowBattlePassItemSlotWidget.OnHovered_BT_FreeItem // (Final|Native|Protected) // @ game+0xa996d0
	void OnClicked_BT_PaidItem(); // Function CrowFPS.CrowBattlePassItemSlotWidget.OnClicked_BT_PaidItem // (Final|Native|Protected) // @ game+0xa996d0
	void OnClicked_BT_FreeItem(); // Function CrowFPS.CrowBattlePassItemSlotWidget.OnClicked_BT_FreeItem // (Final|Native|Protected) // @ game+0xa996d0
};

// Class CrowFPS.CrowBattleShape
// Size: 0x38 (Inherited: 0x28)
struct UCrowBattleShape : UObject {
	struct AActor* OwnerActor; // 0x28(0x08)
	struct UPrimitiveComponent* CenterComponent; // 0x30(0x08)

	void SetCenter(struct UPrimitiveComponent* NewCenterComponent); // Function CrowFPS.CrowBattleShape.SetCenter // (Final|Native|Public|BlueprintCallable) // @ game+0x18bc940
	void Init(struct AActor* NewOwnerActor); // Function CrowFPS.CrowBattleShape.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x18bc010
	struct FVector GetCentralPoint(); // Function CrowFPS.CrowBattleShape.GetCentralPoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x18bbf90
	struct UPrimitiveComponent* GetCenterComponent(); // Function CrowFPS.CrowBattleShape.GetCenterComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18bbf60
};

// Class CrowFPS.CrowBattleStatus
// Size: 0xd8 (Inherited: 0xb0)
struct UCrowBattleStatus : UActorComponent {
	struct AActor* OwnerActor; // 0xb0(0x08)
	float Health; // 0xb8(0x04)
	float MaxHealth; // 0xbc(0x04)
	float DyingHealth; // 0xc0(0x04)
	float HeadArmorCurrent; // 0xc4(0x04)
	float HeadArmorMax; // 0xc8(0x04)
	float BodyArmorCurrent; // 0xcc(0x04)
	float BodyArmorMax; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)

	void SetOwnerActor(struct AActor* NewOwnerActor); // Function CrowFPS.CrowBattleStatus.SetOwnerActor // (Final|Native|Public|BlueprintCallable) // @ game+0x18b88c0
	void MulticastSynchronizeHealth(float SyncHealth, float SyncDyingHealth); // Function CrowFPS.CrowBattleStatus.MulticastSynchronizeHealth // (Net|NetReliableNative|Event|NetMulticast|Public|NetValidate) // @ game+0x18bc430
	void MulticastSetHealth(float NewHealth, bool UseContaminationCameraShake); // Function CrowFPS.CrowBattleStatus.MulticastSetHealth // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x18bc350
	bool IsAlive(); // Function CrowFPS.CrowBattleStatus.IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18bc1b0
	void Init(struct AActor* NewOwnerActor, float NewHealth, float DyingHealth); // Function CrowFPS.CrowBattleStatus.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x18bc0a0
	float GetMaxHealth(); // Function CrowFPS.CrowBattleStatus.GetMaxHealth // (Final|Native|Public|Const) // @ game+0x18bbff0
	float GetHealth(); // Function CrowFPS.CrowBattleStatus.GetHealth // (Final|Native|Public|Const) // @ game+0x18bbfd0
	void CheckCharacterDying(struct FDamageEvent DamageEvent, struct AController* EventInstigator); // Function CrowFPS.CrowBattleStatus.CheckCharacterDying // (Final|Native|Public|HasOutParms) // @ game+0x18bbd60
	void ChangeHealthRate(float Rate); // Function CrowFPS.CrowBattleStatus.ChangeHealthRate // (Final|Native|Public) // @ game+0x18bbce0
	void ChangeHealth(float Delta, struct FDamageEvent DamageEvent, struct AController* EventInstigator); // Function CrowFPS.CrowBattleStatus.ChangeHealth // (Final|Native|Public|HasOutParms) // @ game+0x18bbbb0
	void AddHealth(float Delta); // Function CrowFPS.CrowBattleStatus.AddHealth // (Final|Native|Public) // @ game+0x18bbb10
};

// Class CrowFPS.CrowBinderActorComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UCrowBinderActorComponent : UActorComponent {
	struct UCrowComponentContainer* OwnerContainer; // 0xb0(0x08)
	struct AActor* CrowComponentOwnerActor; // 0xb8(0x08)

	void SetOwnerContainer(struct UCrowComponentContainer* ComponentContainer, struct AActor* OwnerActor); // Function CrowFPS.CrowBinderActorComponent.SetOwnerContainer // (Final|Native|Protected) // @ game+0x18ad2c0
	struct UObject* BNE_GetBinderClassType(); // Function CrowFPS.CrowBinderActorComponent.BNE_GetBinderClassType // (Native|Event|Public|BlueprintEvent|Const) // @ game+0xc9e8f0
};

// Class CrowFPS.CrowBinderTargetBase
// Size: 0x40 (Inherited: 0x28)
struct UCrowBinderTargetBase : UObject {
	struct APawn* RootPawn; // 0x28(0x08)
	struct UCrowBinderActorComponent* OwnerBinder; // 0x30(0x08)
	int32_t BindingFlags; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)

	void SetOwnerBinder(struct UCrowBinderActorComponent* InOwnerBinder); // Function CrowFPS.CrowBinderTargetBase.SetOwnerBinder // (Final|Native|Public) // @ game+0x18bc9d0
};

// Class CrowFPS.CrowBMPositionChangeWidget
// Size: 0x480 (Inherited: 0x348)
struct UCrowBMPositionChangeWidget : UCrowWidgetBase {
	struct UTextBlock* TBMapName; // 0x348(0x08)
	struct UTextBlock* TBRound; // 0x350(0x08)
	struct UTextBlock* TBTeamPosition; // 0x358(0x08)
	struct UTextBlock* TBMyTeamName; // 0x360(0x08)
	struct UImage* IMGMyTeamIcon; // 0x368(0x08)
	struct UImage* IMGMyTeamIconChange; // 0x370(0x08)
	struct UImage* IMGMyTeamBg00; // 0x378(0x08)
	struct UImage* IMGMyTeamBg01; // 0x380(0x08)
	struct UImage* IMGMyTeamBg02; // 0x388(0x08)
	struct UImage* IMGMyTeamEffect00; // 0x390(0x08)
	struct UImage* IMGMyTeamEffect01; // 0x398(0x08)
	struct UTextBlock* TBEnemyTeamName; // 0x3a0(0x08)
	struct UImage* IMGEnemyTeamIcon; // 0x3a8(0x08)
	struct UImage* IMGEnemyTeamIconChange; // 0x3b0(0x08)
	struct UImage* IMGEnemyTeamBg; // 0x3b8(0x08)
	struct UWidgetAnimation* AniStart; // 0x3c0(0x08)
	struct UWidgetAnimation* AniStartMatchPoint; // 0x3c8(0x08)
	struct UTexture2D* AttackerTeamIcon; // 0x3d0(0x08)
	struct UTexture2D* DefencerTeamIcon; // 0x3d8(0x08)
	struct FLinearColor RedTeamBg00Color; // 0x3e0(0x10)
	struct FLinearColor RedTeamBg01Color; // 0x3f0(0x10)
	struct FLinearColor RedTeamBg02Color; // 0x400(0x10)
	struct FLinearColor RedTeamEffect00Color; // 0x410(0x10)
	struct FLinearColor RedTeamEffect01Color; // 0x420(0x10)
	struct FLinearColor BlueTeamBg00Color; // 0x430(0x10)
	struct FLinearColor BlueTeamBg01Color; // 0x440(0x10)
	struct FLinearColor BlueTeamBg02Color; // 0x450(0x10)
	struct FLinearColor BlueTeamEffect00Color; // 0x460(0x10)
	struct FLinearColor BlueTeamEffect01Color; // 0x470(0x10)
};

// Class CrowFPS.CrowBMStartMatchWidget
// Size: 0x478 (Inherited: 0x348)
struct UCrowBMStartMatchWidget : UCrowWidgetBase {
	struct UTextBlock* TBMapName; // 0x348(0x08)
	struct UTextBlock* TBRound; // 0x350(0x08)
	struct UTextBlock* TBTeamPosition; // 0x358(0x08)
	struct UTextBlock* TBMyTeamName; // 0x360(0x08)
	struct UImage* IMGMyTeamIcon; // 0x368(0x08)
	struct UImage* IMGMyTeamBg00; // 0x370(0x08)
	struct UImage* IMGMyTeamBg01; // 0x378(0x08)
	struct UImage* IMGMyTeamBg02; // 0x380(0x08)
	struct UImage* IMGMyTeamEffect00; // 0x388(0x08)
	struct UImage* IMGMyTeamEffect01; // 0x390(0x08)
	struct UTextBlock* TBEnemyTeamName; // 0x398(0x08)
	struct UImage* IMGEnemyTeamIcon; // 0x3a0(0x08)
	struct UImage* IMGEnemyTeamBg; // 0x3a8(0x08)
	struct UWidgetAnimation* AniStart; // 0x3b0(0x08)
	struct UWidgetAnimation* AniStartMatchPoint; // 0x3b8(0x08)
	struct UTexture2D* AttackerTeamIcon; // 0x3c0(0x08)
	struct UTexture2D* DefencerTeamIcon; // 0x3c8(0x08)
	struct FLinearColor RedTeamBg00Color; // 0x3d0(0x10)
	struct FLinearColor RedTeamBg01Color; // 0x3e0(0x10)
	struct FLinearColor RedTeamBg02Color; // 0x3f0(0x10)
	struct FLinearColor RedTeamEffect00Color; // 0x400(0x10)
	struct FLinearColor RedTeamEffect01Color; // 0x410(0x10)
	struct FLinearColor BlueTeamBg00Color; // 0x420(0x10)
	struct FLinearColor BlueTeamBg01Color; // 0x430(0x10)
	struct FLinearColor BlueTeamBg02Color; // 0x440(0x10)
	struct FLinearColor BlueTeamEffect00Color; // 0x450(0x10)
	struct FLinearColor BlueTeamEffect01Color; // 0x460(0x10)
	struct FTimerHandle WaitRPCTeamInfoTimerHandle; // 0x470(0x08)
};

// Class CrowFPS.CrowBoardWidget
// Size: 0x368 (Inherited: 0x348)
struct UCrowBoardWidget : UCrowWidgetBase {
	struct UCrowButton* BT_Banner_2; // 0x348(0x08)
	struct UCrowButton* BT_Banner_3; // 0x350(0x08)
	struct UCrowButton* BT_Banner_4; // 0x358(0x08)
	struct UCrowButton* BT_Banner_5; // 0x360(0x08)

	void OnClicked_BT_Banner_5(); // Function CrowFPS.CrowBoardWidget.OnClicked_BT_Banner_5 // (Final|Native|Protected) // @ game+0x18bc530
	void OnClicked_BT_Banner_4(); // Function CrowFPS.CrowBoardWidget.OnClicked_BT_Banner_4 // (Final|Native|Protected) // @ game+0x18bc530
	void OnClicked_BT_Banner_3(); // Function CrowFPS.CrowBoardWidget.OnClicked_BT_Banner_3 // (Final|Native|Protected) // @ game+0x18bc530
	void OnClicked_BT_Banner_2(); // Function CrowFPS.CrowBoardWidget.OnClicked_BT_Banner_2 // (Final|Native|Protected) // @ game+0x18bc530
};

// Class CrowFPS.CrowBomBardRouteWidget
// Size: 0x360 (Inherited: 0x348)
struct UCrowBomBardRouteWidget : UCrowWidgetBase {
	struct UCanvasPanel* CP_route; // 0x348(0x08)
	struct UBorder* BD_Zone; // 0x350(0x08)
	struct UImage* IMG_Effect; // 0x358(0x08)
};

// Class CrowFPS.CrowBombardTargetWidget
// Size: 0x360 (Inherited: 0x348)
struct UCrowBombardTargetWidget : UCrowWidgetBase {
	struct UCanvasPanel* CP_Timer; // 0x348(0x08)
	struct UTextBlock* TB_Time; // 0x350(0x08)
	struct UBorder* BD_Zone; // 0x358(0x08)
};

// Class CrowFPS.CrowBomberActor
// Size: 0x338 (Inherited: 0x220)
struct ACrowBomberActor : AActor {
	struct FVector TopLeftPoint; // 0x220(0x0c)
	struct FVector BottomRightPoint; // 0x22c(0x0c)
	char pad_238[0x10]; // 0x238(0x10)
	struct AActor* ProjectileSubClass; // 0x248(0x08)
	int32_t ProjectileCount; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct FCrowGameIconDisplayInfo IconDisplayInfo; // 0x258(0x88)
	struct USceneComponent* RootComp; // 0x2e0(0x08)
	struct FVector TargetLoc; // 0x2e8(0x0c)
	bool IsFire; // 0x2f4(0x01)
	char pad_2F5[0x3]; // 0x2f5(0x03)
	float FirePosDir; // 0x2f8(0x04)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct AActor* SpawnTargetAreaActor; // 0x300(0x08)
	struct UCrowWorldMapIcon* Icon; // 0x308(0x08)
	struct FVector PrevBombingTargetPos; // 0x310(0x0c)
	float IntervalTime; // 0x31c(0x04)
	int32_t CurrentCounting; // 0x320(0x04)
	char pad_324[0x4]; // 0x324(0x04)
	struct FVector PrevBombingPos; // 0x328(0x0c)
	float Dir; // 0x334(0x04)

	void FireReady(); // Function CrowFPS.CrowBomberActor.FireReady // (Final|Native|Private) // @ game+0x18bbf40
	void Fire(); // Function CrowFPS.CrowBomberActor.Fire // (Final|Native|Private) // @ game+0x18bbf20
	bool DelayFireTime(float DeltaTime); // Function CrowFPS.CrowBomberActor.DelayFireTime // (Final|Native|Private) // @ game+0x18bbe70
};

// Class CrowFPS.CrowBomberProjectileActor
// Size: 0x240 (Inherited: 0x220)
struct ACrowBomberProjectileActor : AActor {
	struct UCapsuleComponent* CollisionComp; // 0x220(0x08)
	struct UProjectileMovementComponent* MovementComp; // 0x228(0x08)
	struct FVector TargetPosition; // 0x230(0x0c)
	char pad_23C[0x4]; // 0x23c(0x04)

	void OnHit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult HitResult); // Function CrowFPS.CrowBomberProjectileActor.OnHit // (Native|Protected|HasOutParms|HasDefaults) // @ game+0x18bc550
	void MulticastHit(struct FVector HitLocation); // Function CrowFPS.CrowBomberProjectileActor.MulticastHit // (Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults|NetValidate) // @ game+0x18bc2a0
};

// Class CrowFPS.CrowBomberProjectileFXActor
// Size: 0x220 (Inherited: 0x220)
struct ACrowBomberProjectileFXActor : AActor {
};

// Class CrowFPS.CrowItemBase
// Size: 0x2b0 (Inherited: 0x220)
struct ACrowItemBase : AActor {
	float MeshBoundsScale; // 0x220(0x04)
	char pad_224[0x4]; // 0x224(0x04)
	struct UBoxComponent* BoxComponent; // 0x228(0x08)
	struct UCrowItemTableManager* TableManager; // 0x230(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> DynamicMaterialArray; // 0x238(0x10)
	char pad_248[0x58]; // 0x248(0x58)
	struct UCrowIndicatorViewInfo* ItemDropIndicatorViewInfo; // 0x2a0(0x08)
	struct UCrowWorldMapIcon* ItemDropWorldMapIcon; // 0x2a8(0x08)

	void MultiCastDropItem(struct FVector_NetQuantize100 Location, struct FRotator Rotation, float Distance); // Function CrowFPS.CrowItemBase.MultiCastDropItem // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|NetValidate) // @ game+0x19292e0
};

// Class CrowFPS.CrowItemMesh
// Size: 0x300 (Inherited: 0x2b0)
struct ACrowItemMesh : ACrowItemBase {
	struct UMeshComponent* MeshComponent; // 0x2b0(0x08)
	struct UParticleSystemComponent* MeshParticleComponent; // 0x2b8(0x08)
	struct ACrowItemMeshActor* MeshActor; // 0x2c0(0x08)
	bool bIsMoveMeshOrigin; // 0x2c8(0x01)
	char pad_2C9[0x7]; // 0x2c9(0x07)
	struct FCrowItemData ItemData; // 0x2d0(0x30)
};

// Class CrowFPS.CrowEquipmentBase
// Size: 0x308 (Inherited: 0x300)
struct ACrowEquipmentBase : ACrowItemMesh {
	bool bIsSelected; // 0x300(0x01)
	bool bIsVisible; // 0x301(0x01)
	char SlotIndex; // 0x302(0x01)
	char pad_303[0x5]; // 0x303(0x05)
};

// Class CrowFPS.CrowWeaponBase
// Size: 0x1dd0 (Inherited: 0x308)
struct ACrowWeaponBase : ACrowEquipmentBase {
	char pad_308[0x10]; // 0x308(0x10)
	bool bVisibleInVehicle; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	struct FCrowWeaponData WeaponData; // 0x320(0x168)
	enum class ECrowWeaponKeyFlags WeaponKeyFlags; // 0x488(0x01)
	char pad_489[0x7]; // 0x489(0x07)
	struct FCrowWeaponAccData WeaponAccData; // 0x490(0xb0)
	char pad_540[0x8]; // 0x540(0x08)
	struct FCrowWeaponData ClientWeaponData; // 0x548(0x168)
	struct FCrowWeaponAccData ClientWeaponAccData; // 0x6b0(0xb0)
	char pad_760[0x8]; // 0x760(0x08)
	struct FTimerHandle LimitHoldBreath; // 0x768(0x08)
	struct FTimerHandle HoldBreathCoolTimeHandle; // 0x770(0x08)
	struct UCrowWeaponModel* WeaponModelFirst; // 0x778(0x08)
	struct UCrowWeaponModel* WeaponModelThird; // 0x780(0x08)
	struct UCrowWeaponSpreadComponent* SpreadComponent; // 0x788(0x08)
	struct UCrowWeaponRecoilComponent* RecoilComponent; // 0x790(0x08)
	struct ACrowPlayerControllerBase* PlayerController; // 0x798(0x08)
	struct AController* Controller; // 0x7a0(0x08)
	struct APawn* WeaponOwner; // 0x7a8(0x08)
	struct UCrowAimComponentBase* AimComponent; // 0x7b0(0x08)
	struct UCrowWeaponCrosshairBase* crosshairWidget; // 0x7b8(0x08)
	struct UCrowGameInvenComponent* GameInventory; // 0x7c0(0x08)
	struct UMaterialParameterCollectionInstance* MPCWeaponFOVInstance; // 0x7c8(0x08)
	struct ACrowProjectileBase* ProjectileClass; // 0x7d0(0x08)
	struct TArray<struct UCrowWeaponStateBase*> WeaponStateArray; // 0x7d8(0x10)
	struct UCrowWeaponStateBase* WeaponStateCurrent; // 0x7e8(0x08)
	struct UCrowWeaponStateReload* WeaponStateReload; // 0x7f0(0x08)
	struct UCrowWeaponSubStateBase* WeaponSubStateFire; // 0x7f8(0x08)
	struct UCrowWeaponSubStateAim* WeaponSubStateAim; // 0x800(0x08)
	bool bIsFirstPerson; // 0x808(0x01)
	enum class ECrowWeaponState WeaponState; // 0x809(0x01)
	bool bIsAI; // 0x80a(0x01)
	enum class ECrowItemSpawnType SpawnType; // 0x80b(0x01)
	float DefaultFOV; // 0x80c(0x04)
	bool bIsAimming; // 0x810(0x01)
	char pad_811[0xf]; // 0x811(0x0f)
	struct FCrowWeaponTableRow WeaponTable; // 0x820(0x11e0)
	struct FCrowAmmoTableRow AmmoTable; // 0x1a00(0x220)
	char pad_1C20[0x2]; // 0x1c20(0x02)
	struct FCrowWeaponAniStateInfo WeaponAniStateInfo; // 0x1c22(0x05)
	char pad_1C27[0x1]; // 0x1c27(0x01)
	struct FCrowCharacterAnimWeapon AnimWeaponFirst; // 0x1c28(0x40)
	struct FCrowCharacterAnimWeapon AnimWeaponThird; // 0x1c68(0x40)
	struct FCrowWeaponPartsOptions PartsOptions; // 0x1ca8(0x44)
	char pad_1CEC[0x44]; // 0x1cec(0x44)
	bool UseDefaultSettings; // 0x1d30(0x01)
	char pad_1D31[0x3]; // 0x1d31(0x03)
	uint32_t WeaponIndex; // 0x1d34(0x04)
	uint32_t PartsBarrel; // 0x1d38(0x04)
	uint32_t PartsMagazine; // 0x1d3c(0x04)
	uint32_t PartsMuzzle; // 0x1d40(0x04)
	uint32_t PartsPistolGrip; // 0x1d44(0x04)
	uint32_t PartsPrimarySight; // 0x1d48(0x04)
	uint32_t PartsSecondarySight; // 0x1d4c(0x04)
	uint32_t PartsSideBarrel; // 0x1d50(0x04)
	uint32_t PartsStock; // 0x1d54(0x04)
	uint32_t PartsUnderBarrel; // 0x1d58(0x04)
	char pad_1D5C[0x4]; // 0x1d5c(0x04)
	struct USkeletalMesh* BackupNoOptimizationWeaponMesh; // 0x1d60(0x08)
	struct UMaterialInterface* BackupNoOptimizationWeaponMaterial; // 0x1d68(0x08)
	bool bSkipOptimizationMeshTick; // 0x1d70(0x01)
	char pad_1D71[0x7]; // 0x1d71(0x07)
	struct TMap<enum class ECrowWeaponPartsType, struct FCrowOptimizationPartsInfo> OptimizationMeshList; // 0x1d78(0x50)
	char pad_1DC8[0x8]; // 0x1dc8(0x08)

	void RequestSimulatedReloadComplete(char MaxCount); // Function CrowFPS.CrowWeaponBase.RequestSimulatedReloadComplete // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x19ce650
	void RequestSimulatedFire(struct FCrowWeaponFire WeaponFire); // Function CrowFPS.CrowWeaponBase.RequestSimulatedFire // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x19ce580
	void RequestKeyFlags(char KeyFlags); // Function CrowFPS.CrowWeaponBase.RequestKeyFlags // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x19ce4d0
	void RequestChangeState(enum class ECrowWeaponState NewState); // Function CrowFPS.CrowWeaponBase.RequestChangeState // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x19ce420
	void OnEndHoldBreashLimit(); // Function CrowFPS.CrowWeaponBase.OnEndHoldBreashLimit // (Final|Native|Public) // @ game+0x19ce370
	void OnEndHoldBreashCoolTime(); // Function CrowFPS.CrowWeaponBase.OnEndHoldBreashCoolTime // (Final|Native|Public) // @ game+0x19ce350
	void MultiCastSimulatedFire(struct FCrowWeaponFire WeaponFire); // Function CrowFPS.CrowWeaponBase.MultiCastSimulatedFire // (Net|NetReliableNative|Event|NetMulticast|Protected|NetValidate) // @ game+0x19ce1f0
	void MultiCastSelectImmediately(); // Function CrowFPS.CrowWeaponBase.MultiCastSelectImmediately // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x19ce1d0
	void MultiCastKeyFlags(char KeyFlags); // Function CrowFPS.CrowWeaponBase.MultiCastKeyFlags // (Net|NetReliableNative|Event|NetMulticast|Protected|NetValidate) // @ game+0x19ce120
	void MultiCastDeselectImmediately(); // Function CrowFPS.CrowWeaponBase.MultiCastDeselectImmediately // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x19ce100
	void MulticastChangeState(enum class ECrowWeaponState NewState); // Function CrowFPS.CrowWeaponBase.MulticastChangeState // (Net|NetReliableNative|Event|NetMulticast|Protected|NetValidate) // @ game+0x19ce050
	void BIE_PlayFireEffect(struct FCrowWeaponFire WeaponFire, bool IsLocalFire); // Function CrowFPS.CrowWeaponBase.BIE_PlayFireEffect // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1d38500
};

// Class CrowFPS.CrowWeaponCharacter
// Size: 0x1e70 (Inherited: 0x1dd0)
struct ACrowWeaponCharacter : ACrowWeaponBase {
	bool bIsAutoSelect; // 0x1dc8(0x01)
	struct UMeshComponent* WeaponModelThirdAttached; // 0x1dd0(0x08)
	struct ACrowCharacterPawn* CharacterOwner; // 0x1dd8(0x08)
	struct UCrowCharacterMovement* CharacterMovement; // 0x1de0(0x08)
	struct UCrowWeaponSubStateFire* CharacterSubStateFire; // 0x1de8(0x08)
	struct UCrowCharacterAimComponent* CharacterAimComponent; // 0x1df0(0x08)
	char pad_1DF9[0x27]; // 0x1df9(0x27)
	struct FTimerHandle LongPressedAimTimerHandler; // 0x1e20(0x08)
	struct UCrowZeroingInfo* ZeroingInfo; // 0x1e28(0x08)
	struct ACrowWeaponDummyParts* DummyMagazine1P; // 0x1e30(0x08)
	struct ACrowWeaponDummyParts* DummyMagazine3P; // 0x1e38(0x08)
	char pad_1E40[0x30]; // 0x1e40(0x30)
};

// Class CrowFPS.CrowWeaponKit
// Size: 0x1e80 (Inherited: 0x1e70)
struct ACrowWeaponKit : ACrowWeaponCharacter {
	char pad_1E70[0x10]; // 0x1e70(0x10)
};

// Class CrowFPS.CrowBombingKit
// Size: 0x1f50 (Inherited: 0x1e80)
struct ACrowBombingKit : ACrowWeaponKit {
	struct AActor* TargetClass; // 0x1e80(0x08)
	struct UCrowWidgetBase* BinocularsLenzWidget; // 0x1e88(0x08)
	float FOVValue; // 0x1e90(0x04)
	float Time; // 0x1e94(0x04)
	float RespondSoundTime; // 0x1e98(0x04)
	char pad_1E9C[0x4]; // 0x1e9c(0x04)
	struct UAkAudioEvent* PointSetEvent; // 0x1ea0(0x08)
	struct UAkAudioEvent* RequestEvent; // 0x1ea8(0x08)
	struct UAkAudioEvent* RespondEvent; // 0x1eb0(0x08)
	struct UCrowWidgetBase* ScopeWidget; // 0x1eb8(0x08)
	float CameraFOV; // 0x1ec0(0x04)
	float CurrFOV; // 0x1ec4(0x04)
	float TargetFOV; // 0x1ec8(0x04)
	float CurrTime; // 0x1ecc(0x04)
	struct FTimerHandle TimeHandle; // 0x1ed0(0x08)
	struct FKey AimKey; // 0x1ed8(0x18)
	struct FName AimKeyName; // 0x1ef0(0x08)
	struct UObject* BomberActor; // 0x1ef8(0x08)
	struct UObject* KitTargetClass; // 0x1f00(0x08)
	struct ACrowKitBomberTarget* KitTargetActor; // 0x1f08(0x08)
	struct FTransform TargetTran; // 0x1f10(0x30)
	struct FVector FireCharacterPos; // 0x1f40(0x0c)
	char pad_1F4C[0x4]; // 0x1f4c(0x04)

	void RespondSoundTimer(); // Function CrowFPS.CrowBombingKit.RespondSoundTimer // (Final|Native|Protected) // @ game+0x18bc920
	void RequestKitAim(bool IsAim); // Function CrowFPS.CrowBombingKit.RequestKitAim // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x18bc860
	void OnSpawnTimer(); // Function CrowFPS.CrowBombingKit.OnSpawnTimer // (Final|Native|Protected) // @ game+0x18bc740
	void MultiCastKitAim(bool IsAim); // Function CrowFPS.CrowBombingKit.MultiCastKitAim // (Net|NetReliableNative|Event|NetMulticast|Public|NetValidate) // @ game+0x18bc1e0
	void FinishAimBombingKit(); // Function CrowFPS.CrowBombingKit.FinishAimBombingKit // (Final|Native|Protected) // @ game+0x18bbf00
	void AimBombingKit(); // Function CrowFPS.CrowBombingKit.AimBombingKit // (Final|Native|Protected) // @ game+0x18bbb90
};

// Class CrowFPS.CrowBombingTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowBombingTable : UDataTable {
};

// Class CrowFPS.CrowBombingTableManager
// Size: 0x58 (Inherited: 0x28)
struct UCrowBombingTableManager : UObject {
	struct TArray<struct FCrowBombingTableRow> ArrayBombingTableRow; // 0x28(0x10)
	float BombingAngle; // 0x38(0x04)
	struct FVector TargetPos; // 0x3c(0x0c)
	struct FVector2D MapSizeRatio; // 0x48(0x08)
	char pad_50[0x8]; // 0x50(0x08)
};

// Class CrowFPS.CrowBombMissionBattleMenuInput
// Size: 0x150 (Inherited: 0x140)
struct UCrowBombMissionBattleMenuInput : UCrowInputBase {
	struct APlayerController* PC; // 0x140(0x08)
	bool bRepeatThrow; // 0x148(0x01)
	char pad_149[0x7]; // 0x149(0x07)

	void ToggleLoadout(); // Function CrowFPS.CrowBombMissionBattleMenuInput.ToggleLoadout // (Final|Native|Private) // @ game+0x18bca60
	void RepeatRadialMenuThrow(); // Function CrowFPS.CrowBombMissionBattleMenuInput.RepeatRadialMenuThrow // (Final|Native|Private) // @ game+0x18bc840
	void ReleasedVoiceTalk(); // Function CrowFPS.CrowBombMissionBattleMenuInput.ReleasedVoiceTalk // (Final|Native|Private) // @ game+0x18bc820
	void ReleasedUse(); // Function CrowFPS.CrowBombMissionBattleMenuInput.ReleasedUse // (Final|Native|Private) // @ game+0x18b9050
	void ReleasedSubUse(); // Function CrowFPS.CrowBombMissionBattleMenuInput.ReleasedSubUse // (Final|Native|Private) // @ game+0x18b9030
	void ReleasedRadialMenuThrow(); // Function CrowFPS.CrowBombMissionBattleMenuInput.ReleasedRadialMenuThrow // (Final|Native|Private) // @ game+0x18bc800
	void ReleasedInputGuide(); // Function CrowFPS.CrowBombMissionBattleMenuInput.ReleasedInputGuide // (Final|Native|Private) // @ game+0x18bc7e0
	void PressVoiceAllMute(); // Function CrowFPS.CrowBombMissionBattleMenuInput.PressVoiceAllMute // (Final|Native|Private) // @ game+0x18b8d70
	void PressedVoiceTalk(); // Function CrowFPS.CrowBombMissionBattleMenuInput.PressedVoiceTalk // (Final|Native|Private) // @ game+0x18bc7c0
	void PressedUse(); // Function CrowFPS.CrowBombMissionBattleMenuInput.PressedUse // (Final|Native|Private) // @ game+0x18b8ed0
	void PressedSubUse(); // Function CrowFPS.CrowBombMissionBattleMenuInput.PressedSubUse // (Final|Native|Private) // @ game+0x18b8eb0
	void PressedRadialMenuThrow(); // Function CrowFPS.CrowBombMissionBattleMenuInput.PressedRadialMenuThrow // (Final|Native|Private) // @ game+0x18b8e50
	void PressedInputGuide(); // Function CrowFPS.CrowBombMissionBattleMenuInput.PressedInputGuide // (Final|Native|Private) // @ game+0x18bc7a0
	void OpenScoreBoard(); // Function CrowFPS.CrowBombMissionBattleMenuInput.OpenScoreBoard // (Final|Native|Private) // @ game+0x18bc780
	void OpenGameMenu(); // Function CrowFPS.CrowBombMissionBattleMenuInput.OpenGameMenu // (Final|Native|Private) // @ game+0x18bc760
	void MinimapZoom(); // Function CrowFPS.CrowBombMissionBattleMenuInput.MinimapZoom // (Final|Native|Private) // @ game+0x18b8ae0
	void CloseScoreBoard(); // Function CrowFPS.CrowBombMissionBattleMenuInput.CloseScoreBoard // (Final|Native|Private) // @ game+0x18bbe50
};

// Class CrowFPS.CrowBombMissionResultRoundWidget
// Size: 0x380 (Inherited: 0x348)
struct UCrowBombMissionResultRoundWidget : UCrowWidgetBase {
	struct UImage* IMGWinAttackerIcon; // 0x348(0x08)
	struct UImage* IMGWinDefencerIcon; // 0x350(0x08)
	struct UImage* IMGLoseAttackerIcon; // 0x358(0x08)
	struct UImage* IMGLoseDefencerIcon; // 0x360(0x08)
	struct UWidgetAnimation* AniShow; // 0x368(0x08)
	struct UWidgetAnimation* AniWin; // 0x370(0x08)
	struct UWidgetAnimation* AniLose; // 0x378(0x08)
};

// Class CrowFPS.CrowBombMissionScoreBoardWidget
// Size: 0x400 (Inherited: 0x348)
struct UCrowBombMissionScoreBoardWidget : UCrowWidgetBase {
	char pad_348[0x8]; // 0x348(0x08)
	struct UCrowBombMissionScoreSlotWidget* ScoreInfoListItem; // 0x350(0x08)
	struct UTextBlock* TBRound; // 0x358(0x08)
	struct UVerticalBox* VBMyTeamList; // 0x360(0x08)
	struct UVerticalBox* VBEnemyTeamList; // 0x368(0x08)
	struct UCrowBombMissionTeamScoreWidget* MyTeamScoreWidget; // 0x370(0x08)
	struct UCrowBombMissionTeamScoreWidget* EnemyTeamScoreWidget; // 0x378(0x08)
	struct TArray<struct FCrowBombMissionScoreListItemData> RedTeamPlayerList; // 0x380(0x10)
	struct TArray<struct FCrowBombMissionScoreListItemData> BlueTeamPlayerList; // 0x390(0x10)
	struct ACrowPlayerStateBombMission* LocalPlayerState; // 0x3a0(0x08)
	struct ACrowGameStateBombMission* GameStateBombMission; // 0x3a8(0x08)
	struct FCrowBombMissionTeamScoreData RedTeamScoreData; // 0x3b0(0x10)
	struct FCrowBombMissionTeamScoreData BlueTeamScoreData; // 0x3c0(0x10)
	struct UBorder* BDMyTeam; // 0x3d0(0x08)
	struct UBorder* BDEnemyTeam; // 0x3d8(0x08)
	struct FLinearColor RedTeamColor; // 0x3e0(0x10)
	struct FLinearColor BlueTeamColor; // 0x3f0(0x10)
};

// Class CrowFPS.CrowBombMissionScoreSlotWidget
// Size: 0x3b0 (Inherited: 0x348)
struct UCrowBombMissionScoreSlotWidget : UCrowWidgetBase {
	struct UTextBlock* TBPlayerName; // 0x348(0x08)
	struct UTextBlock* TBScore; // 0x350(0x08)
	struct UTextBlock* TBKillCount; // 0x358(0x08)
	struct UTextBlock* TBDeathCount; // 0x360(0x08)
	struct UTextBlock* TBPlantCompositoinCCount; // 0x368(0x08)
	struct UTextBlock* TBDefuseCompositionCCount; // 0x370(0x08)
	struct UImage* IMGCompositionC; // 0x378(0x08)
	struct UImage* IMGBackgroundPlayer; // 0x380(0x08)
	struct UImage* IMGBackgroundBlue0; // 0x388(0x08)
	struct UImage* IMGBackgroundBlue1; // 0x390(0x08)
	struct UImage* IMGBackgroundOrange0; // 0x398(0x08)
	struct UImage* IMGBackgroundOrange1; // 0x3a0(0x08)
	struct UImage* IMGBackgroundDeath; // 0x3a8(0x08)
};

// Class CrowFPS.CrowBombMissionTeamScoreWidget
// Size: 0x390 (Inherited: 0x348)
struct UCrowBombMissionTeamScoreWidget : UCrowWidgetBase {
	struct UImage* IMGTeamIconAttack; // 0x348(0x08)
	struct UImage* IMGTeamIconDefence; // 0x350(0x08)
	struct UTextBlock* TBRound; // 0x358(0x08)
	struct UTextBlock* TBTeamName; // 0x360(0x08)
	struct UTextBlock* TBScore; // 0x368(0x08)
	struct FLinearColor RedTeamColor; // 0x370(0x10)
	struct FLinearColor BlueTeamColor; // 0x380(0x10)
};

// Class CrowFPS.CrowBookMarkWidget
// Size: 0x368 (Inherited: 0x348)
struct UCrowBookMarkWidget : UCrowWidgetBase {
	char pad_348[0x10]; // 0x348(0x10)
	struct UCrowButton* BT_BookMark; // 0x358(0x08)
	struct UTextBlock* TB_BookmarkTimer; // 0x360(0x08)

	void OnClickSelectBookMark(); // Function CrowFPS.CrowBookMarkWidget.OnClickSelectBookMark // (Final|Native|Public) // @ game+0x18c0020
};

// Class CrowFPS.CrowBuffTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowBuffTable : UDataTable {
};

// Class CrowFPS.CrowBuffWidget
// Size: 0x328 (Inherited: 0x260)
struct UCrowBuffWidget : UUserWidget {
	struct UCrowButton* BT_BuffSlot_1; // 0x260(0x08)
	struct UImage* IMG_Buff_1; // 0x268(0x08)
	struct UCrowButton* BT_BuffSlot_2; // 0x270(0x08)
	struct UImage* IMG_Buff_2; // 0x278(0x08)
	struct UCrowButton* BT_BuffSlot_3; // 0x280(0x08)
	struct UImage* IMG_Buff_3; // 0x288(0x08)
	struct UCrowButton* BT_BuffSlot_4; // 0x290(0x08)
	struct UImage* IMG_Buff_4; // 0x298(0x08)
	struct UCrowButton* BT_BuffSlot_5; // 0x2a0(0x08)
	struct UImage* IMG_Buff_5; // 0x2a8(0x08)
	struct UCrowButton* BT_BuffSlot_6; // 0x2b0(0x08)
	struct UImage* IMG_Buff_6; // 0x2b8(0x08)
	struct UCrowButton* BT_BuffSlot_7; // 0x2c0(0x08)
	struct UImage* IMG_Buff_7; // 0x2c8(0x08)
	struct UCrowButton* BT_BuffSlot_8; // 0x2d0(0x08)
	struct UImage* IMG_Buff_8; // 0x2d8(0x08)
	struct UCrowButton* BT_BuffSlot_9; // 0x2e0(0x08)
	struct UImage* IMG_Buff_9; // 0x2e8(0x08)
	struct UCanvasPanel* CP_Buff_ToolTip; // 0x2f0(0x08)
	struct UTextBlock* TB_Name; // 0x2f8(0x08)
	struct UTextBlock* TB_Desc; // 0x300(0x08)
	struct UTextBlock* TB_RemainTime; // 0x308(0x08)
	struct TArray<struct FCrowBuffIconInfo> BuffIconInfoArray; // 0x310(0x10)
	char pad_320[0x8]; // 0x320(0x08)

	void OnUnHovered_BuffSlot(); // Function CrowFPS.CrowBuffWidget.OnUnHovered_BuffSlot // (Final|Native|Protected) // @ game+0x18c0160
	void OnHovered_BuffSlot_9(); // Function CrowFPS.CrowBuffWidget.OnHovered_BuffSlot_9 // (Final|Native|Protected) // @ game+0x18c0140
	void OnHovered_BuffSlot_8(); // Function CrowFPS.CrowBuffWidget.OnHovered_BuffSlot_8 // (Final|Native|Protected) // @ game+0x18c0120
	void OnHovered_BuffSlot_7(); // Function CrowFPS.CrowBuffWidget.OnHovered_BuffSlot_7 // (Final|Native|Protected) // @ game+0x18c0100
	void OnHovered_BuffSlot_6(); // Function CrowFPS.CrowBuffWidget.OnHovered_BuffSlot_6 // (Final|Native|Protected) // @ game+0x18c00e0
	void OnHovered_BuffSlot_5(); // Function CrowFPS.CrowBuffWidget.OnHovered_BuffSlot_5 // (Final|Native|Protected) // @ game+0x18c00c0
	void OnHovered_BuffSlot_4(); // Function CrowFPS.CrowBuffWidget.OnHovered_BuffSlot_4 // (Final|Native|Protected) // @ game+0x18c00a0
	void OnHovered_BuffSlot_3(); // Function CrowFPS.CrowBuffWidget.OnHovered_BuffSlot_3 // (Final|Native|Protected) // @ game+0x18c0080
	void OnHovered_BuffSlot_2(); // Function CrowFPS.CrowBuffWidget.OnHovered_BuffSlot_2 // (Final|Native|Protected) // @ game+0x18c0060
	void OnHovered_BuffSlot_1(); // Function CrowFPS.CrowBuffWidget.OnHovered_BuffSlot_1 // (Final|Native|Protected) // @ game+0x18c0040
};

// Class CrowFPS.CrowBuildingSelectableActorBase
// Size: 0x228 (Inherited: 0x220)
struct ACrowBuildingSelectableActorBase : AActor {
	char bIsSelectable : 1; // 0x220(0x01)
	char pad_220_1 : 7; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)

	void SetSelectableRecursively(struct AActor* ParentActor, bool NewSelectable); // Function CrowFPS.CrowBuildingSelectableActorBase.SetSelectableRecursively // (Final|Native|Protected) // @ game+0x18c8d00
	void SetSelectable(bool NewSelectable, bool IsRecursively); // Function CrowFPS.CrowBuildingSelectableActorBase.SetSelectable // (Native|Public) // @ game+0x18c8c20
};

// Class CrowFPS.CrowBuildingActor
// Size: 0x4b0 (Inherited: 0x228)
struct ACrowBuildingActor : ACrowBuildingSelectableActorBase {
	bool LockPropTransforms; // 0x228(0x01)
	struct FCrowBuildingEditorPreview EditorPreview; // 0x229(0x03)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct FCrowBuildingCustomLOD BuildingLOD; // 0x230(0x78)
	bool IsMergingLODBody; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	struct FCrowBuildingDemolitionSetting DemolitionSetting; // 0x2b0(0x70)
	struct FCrowBuildingEditorLayout BuildingLayout; // 0x320(0x50)
	struct TArray<struct FCrowBuildingDecalData> DecalDatas; // 0x370(0x10)
	struct TArray<struct FCrowBuildingReflectionData> ReflectionDatas; // 0x380(0x10)
	bool bIsIndestructible; // 0x390(0x01)
	char pad_391[0x3]; // 0x391(0x03)
	float MaxHealth; // 0x394(0x04)
	float LightProbeRatioMultiplier; // 0x398(0x04)
	bool bForceMoveToBldLevel; // 0x39c(0x01)
	bool ClusterSyncActor; // 0x39d(0x01)
	char pad_39E[0x2]; // 0x39e(0x02)
	struct UCrowWorldDamageCheckerBase* DamageChecker; // 0x3a0(0x08)
	struct UCrowWorldDestructionAUD* DestructionAUD; // 0x3a8(0x08)
	struct FCrowBuildingVisualizer Visualizer; // 0x3b0(0x58)
	struct FBoxSphereBounds BuildingBounds; // 0x408(0x1c)
	struct FBox BuildingBoundingBox; // 0x424(0x1c)
	bool IsUsingSyncHub; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct ACrowWorldSyncHubActor* SyncHubActor; // 0x448(0x08)
	int32_t PartsCount; // 0x450(0x04)
	char pad_454[0x4]; // 0x454(0x04)
	struct TArray<struct FCrowBuildingPartsState> RawPartsStates; // 0x458(0x10)
	struct TArray<struct FCrowBuildingHISMCInfo> HISMCInfoArray; // 0x468(0x10)
	bool HasCleanedUpForDestroy; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)
	struct TArray<struct UDecalComponent*> AdditionalDecals; // 0x480(0x10)
	struct USceneComponent* BuildRoot; // 0x490(0x08)
	struct USceneComponent* PositionRoot; // 0x498(0x08)
	struct UCrowBuildingModularBuilder* ModularBuilder; // 0x4a0(0x08)
	struct UCrowSoundStateVolumeComponent* SoundStateVolumeComponent; // 0x4a8(0x08)

	void SetForceModeToBldLevel(bool bForceMove); // Function CrowFPS.CrowBuildingActor.SetForceModeToBldLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x18c0180
	void OnFinishMergeMesh(struct TArray<struct UObject*> InAssetsToSync); // Function CrowFPS.CrowBuildingActor.OnFinishMergeMesh // (Final|Native|Public|HasOutParms) // @ game+0x10ce9e0
	void Disassemble(); // Function CrowFPS.CrowBuildingActor.Disassemble // (Final|Native|Public) // @ game+0xa996d0
	void Build(); // Function CrowFPS.CrowBuildingActor.Build // (Final|Native|Public) // @ game+0x18c0000
};

// Class CrowFPS.CrowBuildingConfig
// Size: 0x28 (Inherited: 0x28)
struct UCrowBuildingConfig : UObject {
};

// Class CrowFPS.CrowBuildingDynamicPartsTableRef
// Size: 0x78 (Inherited: 0x28)
struct UCrowBuildingDynamicPartsTableRef : UObject {
	struct TMap<struct FName, struct FCrowBuildingDynamicParts> PartsMap; // 0x28(0x50)
};

// Class CrowFPS.CrowBuildingEditorChecker
// Size: 0x298 (Inherited: 0x220)
struct ACrowBuildingEditorChecker : AActor {
	struct USceneComponent* SceneRoot; // 0x220(0x08)
	struct UTextRenderComponent* TextRender; // 0x228(0x08)
	struct UStaticMeshComponent* CubeMesh; // 0x230(0x08)
	bool HideInformation; // 0x238(0x01)
	char pad_239[0x7]; // 0x239(0x07)
	struct TArray<struct TWeakObjectPtr<struct AActor>> CollectedActors; // 0x240(0x10)
	struct TArray<struct TWeakObjectPtr<struct AActor>> AddedActors; // 0x250(0x10)
	struct TArray<struct TWeakObjectPtr<struct AActor>> MovedActors; // 0x260(0x10)
	struct TArray<struct TWeakObjectPtr<struct AActor>> EditorRootActors; // 0x270(0x10)
	struct TArray<struct TWeakObjectPtr<struct AActor>> EditorCheckerActors; // 0x280(0x10)
	bool IsActivateChecker; // 0x290(0x01)
	char pad_291[0x7]; // 0x291(0x07)

	void ShowFloatingActor(); // Function CrowFPS.CrowBuildingEditorChecker.ShowFloatingActor // (Final|Native|Public) // @ game+0x18c4610
	void AttachToRoot(); // Function CrowFPS.CrowBuildingEditorChecker.AttachToRoot // (Final|Native|Public) // @ game+0x18c3a70
};

// Class CrowFPS.CrowBuildingEditorHelper
// Size: 0x4d0 (Inherited: 0x4d0)
struct UCrowBuildingEditorHelper : UStaticMeshComponent {
};

// Class CrowFPS.CrowBuildingEditorNode
// Size: 0x238 (Inherited: 0x228)
struct ACrowBuildingEditorNode : ACrowBuildingSelectableActorBase {
	struct USceneComponent* LinkRoot; // 0x228(0x08)
	char NodeIndex; // 0x230(0x01)
	char pad_231[0x7]; // 0x231(0x07)

	void ToggleVisible(); // Function CrowFPS.CrowBuildingEditorNode.ToggleVisible // (Final|Native|Public) // @ game+0xa996d0
	void ToggleSelectable(); // Function CrowFPS.CrowBuildingEditorNode.ToggleSelectable // (Final|Native|Public) // @ game+0x18c4650
	void SetNodeIndex(char InNodeIndex); // Function CrowFPS.CrowBuildingEditorNode.SetNodeIndex // (Final|Native|Public) // @ game+0x18c4590
	void SetHiddenRecursive(struct AActor* ParentActor, bool IsHidden, bool SkipParent); // Function CrowFPS.CrowBuildingEditorNode.SetHiddenRecursive // (Final|Native|Protected) // @ game+0x18c4480
	void SetHidden(bool IsHidden); // Function CrowFPS.CrowBuildingEditorNode.SetHidden // (Final|Native|Protected) // @ game+0xc9e760
	char GetNodeIndex(); // Function CrowFPS.CrowBuildingEditorNode.GetNodeIndex // (Final|Native|Public|Const) // @ game+0x18c3f10
};

// Class CrowFPS.CrowBuildingEditorLayer
// Size: 0x238 (Inherited: 0x238)
struct ACrowBuildingEditorLayer : ACrowBuildingEditorNode {

	void DuplicateLayer(); // Function CrowFPS.CrowBuildingEditorLayer.DuplicateLayer // (Final|Native|Public) // @ game+0x18c3ef0
	void AddLayer(); // Function CrowFPS.CrowBuildingEditorLayer.AddLayer // (Final|Native|Public) // @ game+0x18c3a50
};

// Class CrowFPS.CrowBuildingEditorPartsActor
// Size: 0x240 (Inherited: 0x228)
struct ACrowBuildingEditorPartsActor : ACrowBuildingSelectableActorBase {
	struct TArray<struct FCrowBuildingEditorSubMesh> SubMeshList; // 0x228(0x10)
	struct UStaticMeshComponent* MainMeshComponent; // 0x238(0x08)

	void ShowMaterialInfo(); // Function CrowFPS.CrowBuildingEditorPartsActor.ShowMaterialInfo // (Final|Native|Public) // @ game+0x18c4630
	void ReplaceWithStaticMesh(); // Function CrowFPS.CrowBuildingEditorPartsActor.ReplaceWithStaticMesh // (Final|Native|Public) // @ game+0xa996d0
};

// Class CrowFPS.CrowBuildingEditorRoot
// Size: 0x398 (Inherited: 0x238)
struct ACrowBuildingEditorRoot : ACrowBuildingEditorNode {
	char bHideInGame : 1; // 0x238(0x01)
	char bHideAfterCreating : 1; // 0x238(0x01)
	char bHideInformation : 1; // 0x238(0x01)
	char pad_238_3 : 5; // 0x238(0x01)
	char pad_239[0x7]; // 0x239(0x07)
	struct FCrowBuildingEditorLayout CachedLayout; // 0x240(0x50)
	struct TMap<int16_t, struct TWeakObjectPtr<struct ACrowBuildingEditorPartsActor>> CachedParts; // 0x290(0x50)
	struct UCrowBuildingEditorHelper* EditorHelper; // 0x2e0(0x08)
	struct UTextRenderComponent* TextRender; // 0x2e8(0x08)
	struct UStaticMeshComponent* SphereMesh; // 0x2f0(0x08)
	struct FCrowBuildingDemolitionSetting DemolitionSetting; // 0x2f8(0x70)
	struct UStaticMesh* LODBodyAsset; // 0x368(0x08)
	struct UStaticMesh* LODExtraAsset; // 0x370(0x08)
	bool SkipLODExtraMesh; // 0x378(0x01)
	bool bIsIndestructible; // 0x379(0x01)
	char pad_37A[0x2]; // 0x37a(0x02)
	float MaxHealth; // 0x37c(0x04)
	float LightProbeRatioMultiplier; // 0x380(0x04)
	bool bForceMoveToBldLevel; // 0x384(0x01)
	bool ClusterSyncActor; // 0x385(0x01)
	char pad_386[0x2]; // 0x386(0x02)
	struct UCrowWorldDamageCheckerBase* DamageChecker; // 0x388(0x08)
	struct UCrowWorldDestructionAUD* DestructionAUD; // 0x390(0x08)

	bool UpdateNodeIndexesRecursively(struct AActor* ParentActor, char CurrentIndex); // Function CrowFPS.CrowBuildingEditorRoot.UpdateNodeIndexesRecursively // (Final|Native|Protected|HasOutParms) // @ game+0x18c4670
	void MigrateAttachedActors(struct ACrowBuildingActor* BuildingActor); // Function CrowFPS.CrowBuildingEditorRoot.MigrateAttachedActors // (Final|Native|Protected) // @ game+0x18c3fd0
	bool HasMaterialOverride(struct UStaticMeshComponent* StaticMeshComponent); // Function CrowFPS.CrowBuildingEditorRoot.HasMaterialOverride // (Final|Native|Protected) // @ game+0x18c3f30
	void CreateWorldEditorActor(); // Function CrowFPS.CrowBuildingEditorRoot.CreateWorldEditorActor // (Final|Native|Public) // @ game+0xa996d0
	struct ACrowBuildingActor* CreateBuildingActor(); // Function CrowFPS.CrowBuildingEditorRoot.CreateBuildingActor // (Final|Native|Protected) // @ game+0x18c3ea0
	void CollectNewPropData(struct ACrowWorldPropActor* PartsActor); // Function CrowFPS.CrowBuildingEditorRoot.CollectNewPropData // (Final|Native|Protected) // @ game+0x18c3e10
	void CollectNewPartsData(struct ACrowBuildingEditorPartsActor* PartsActor); // Function CrowFPS.CrowBuildingEditorRoot.CollectNewPartsData // (Final|Native|Protected) // @ game+0x18c3d80
	void CollectNewMeshDataFromPartsActor(struct ACrowBuildingEditorPartsActor* PartsActor); // Function CrowFPS.CrowBuildingEditorRoot.CollectNewMeshDataFromPartsActor // (Final|Native|Protected) // @ game+0x18c3cf0
	void CollectNewMeshData(struct UStaticMeshComponent* StaticMeshComponent); // Function CrowFPS.CrowBuildingEditorRoot.CollectNewMeshData // (Final|Native|Protected) // @ game+0x18c3c60
	void CollectNewItemSpawnerData(struct ACrowItemSpawner* ItemSpawnerActor); // Function CrowFPS.CrowBuildingEditorRoot.CollectNewItemSpawnerData // (Final|Native|Protected) // @ game+0x18c3bd0
	void CollectLayoutRecursively(struct AActor* ParentActor); // Function CrowFPS.CrowBuildingEditorRoot.CollectLayoutRecursively // (Final|Native|Protected) // @ game+0x18c3b40
	void CollectLayout(); // Function CrowFPS.CrowBuildingEditorRoot.CollectLayout // (Final|Native|Protected) // @ game+0x18c3b20
};

// Class CrowFPS.CrowBuildingEditorDefaultLODTableRef
// Size: 0xc8 (Inherited: 0x28)
struct UCrowBuildingEditorDefaultLODTableRef : UObject {
	struct TMap<struct FString, struct FCrowBuildingLODTableRowInfo> StaticMeshMap; // 0x28(0x50)
	struct TMap<struct FString, struct FCrowBuildingLODTableRowInfo> PartsActorMap; // 0x78(0x50)
};

// Class CrowFPS.CrowBuildingHISMCDetailCache
// Size: 0x78 (Inherited: 0x28)
struct UCrowBuildingHISMCDetailCache : UObject {
	struct TMap<struct UStaticMesh*, struct FCrowBuildingHISMCDetail> CachedDetails; // 0x28(0x50)
};

// Class CrowFPS.CrowVirtualISMC
// Size: 0x6a0 (Inherited: 0x670)
struct UCrowVirtualISMC : UHierarchicalInstancedStaticMeshComponent {
	struct TArray<struct FCrowVirtualISMCInstance> VirtualInstances; // 0x668(0x10)
	struct TArray<int32_t> LookupVirtualInstanceIndex; // 0x678(0x10)
	struct TArray<int32_t> RecycleVirtualIndexes; // 0x688(0x10)
	int32_t ShowVirtualInstanceCount; // 0x698(0x04)

	bool UpdateVirtualInstanceTransform(int32_t VirtualInstanceIndex, struct FTransform InstanceTransform); // Function CrowFPS.CrowVirtualISMC.UpdateVirtualInstanceTransform // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x19ced50
	bool ShowVirtualInstance(int32_t VirtualInstanceIndex); // Function CrowFPS.CrowVirtualISMC.ShowVirtualInstance // (Final|Native|Public|BlueprintCallable) // @ game+0x19ce9c0
	void RemoveVirtualInstance(int32_t VirtualInstanceIndex); // Function CrowFPS.CrowVirtualISMC.RemoveVirtualInstance // (Final|Native|Public|BlueprintCallable) // @ game+0x19ce390
	bool IsShowingVirtualInstance(int32_t VirtualInstanceIndex); // Function CrowFPS.CrowVirtualISMC.IsShowingVirtualInstance // (Final|Native|Public|BlueprintCallable) // @ game+0x19cdfb0
	bool HideVirtualInstance(int32_t VirtualInstanceIndex); // Function CrowFPS.CrowVirtualISMC.HideVirtualInstance // (Final|Native|Public|BlueprintCallable) // @ game+0x19cdda0
	bool GetVirtualInstanceTransform(int32_t VirtualInstanceIndex, struct FTransform OutInstanceTransform); // Function CrowFPS.CrowVirtualISMC.GetVirtualInstanceTransform // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x19cdc50
	void ForceUpdateBuffer(); // Function CrowFPS.CrowVirtualISMC.ForceUpdateBuffer // (Native|Public|BlueprintCallable) // @ game+0x19cdc00
	void ClearAllVirtualInstances(); // Function CrowFPS.CrowVirtualISMC.ClearAllVirtualInstances // (Final|Native|Public|BlueprintCallable) // @ game+0x19cdaa0
	int32_t AddVirtualInstance(struct FTransform InstanceTransform, bool InitiallyHidden); // Function CrowFPS.CrowVirtualISMC.AddVirtualInstance // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x19cd960
};

// Class CrowFPS.CrowBuildingHISMC
// Size: 0x6a0 (Inherited: 0x6a0)
struct UCrowBuildingHISMC : UCrowVirtualISMC {
};

// Class CrowFPS.CrowBuildingModularBuilder
// Size: 0xe8 (Inherited: 0xb0)
struct UCrowBuildingModularBuilder : UActorComponent {
	struct TArray<struct FCrowBuildingGeneratedParts> GeneratedPartsArray; // 0xb0(0x10)
	bool IsFirstShowHideProps; // 0xc0(0x01)
	bool IsHidingProps; // 0xc1(0x01)
	char pad_C2[0x6]; // 0xc2(0x06)
	struct TArray<struct TWeakObjectPtr<struct ACrowWorldPropActor>> ChildProps; // 0xc8(0x10)
	struct TArray<struct TWeakObjectPtr<struct ACrowItemSpawner>> ChildItemSpawners; // 0xd8(0x10)

	bool PartsVariationPrev(struct FCrowBuildingEditorLayout InModularLayout, struct UActorComponent* Component); // Function CrowFPS.CrowBuildingModularBuilder.PartsVariationPrev // (Final|Native|Public|HasOutParms) // @ game+0x18c4270
	bool PartsVariationNext(struct FCrowBuildingEditorLayout InModularLayout, struct UActorComponent* Component); // Function CrowFPS.CrowBuildingModularBuilder.PartsVariationNext // (Final|Native|Public|HasOutParms) // @ game+0x18c4060
	void DestroyAllModularItemComponents(); // Function CrowFPS.CrowBuildingModularBuilder.DestroyAllModularItemComponents // (Final|Native|Public) // @ game+0x18c3ed0
	void ClearHISMCInstances(struct ACrowBuildingActor* BuildingActor); // Function CrowFPS.CrowBuildingModularBuilder.ClearHISMCInstances // (Final|Native|Public) // @ game+0x18c3a90
};

// Class CrowFPS.CrowBuildingSMC
// Size: 0x600 (Inherited: 0x4d0)
struct UCrowBuildingSMC : UStaticMeshComponent {
	bool Preview; // 0x4d0(0x01)
	char LODType; // 0x4d1(0x01)
	char pad_4D2[0x2]; // 0x4d2(0x02)
	int32_t LODLevel; // 0x4d4(0x04)
	char pad_4D8[0x8]; // 0x4d8(0x08)
	struct FCrowBuildingPartsInfo PartsInfo; // 0x4e0(0x40)
	struct TWeakObjectPtr<struct UStaticMeshComponent> DecalReceiver; // 0x520(0x08)
	struct UMaterialInterface* DecalReceiverMaterial; // 0x528(0x08)
	struct UStaticMesh* RemainMesh; // 0x530(0x08)
	bool bIsDestructible; // 0x538(0x01)
	bool UsingTriggerMesh; // 0x539(0x01)
	bool bIsGlassMaterial; // 0x53a(0x01)
	char pad_53B[0x1]; // 0x53b(0x01)
	struct FVector DestructibleSocket; // 0x53c(0x0c)
	struct FVector BoundingBoxCenter; // 0x548(0x0c)
	char pad_554[0x4]; // 0x554(0x04)
	struct FCrowBuildingHISMCDetail MeshDetail; // 0x558(0x68)
	struct TArray<struct FKAggregateGeom> Geometries; // 0x5c0(0x10)
	struct TArray<struct UBodySetup*> BodySetups; // 0x5d0(0x10)
	char MeshGeometryFlag; // 0x5e0(0x01)
	char pad_5E1[0x7]; // 0x5e1(0x07)
	struct UStaticMesh* TriggerMesh; // 0x5e8(0x08)
	char pad_5F0[0x10]; // 0x5f0(0x10)

	void SetRemainMesh(struct UStaticMesh* InRemainMesh); // Function CrowFPS.CrowBuildingSMC.SetRemainMesh // (Final|Native|Public) // @ game+0x18c8b90
	void SetPreview(bool InPreview); // Function CrowFPS.CrowBuildingSMC.SetPreview // (Final|Native|Public) // @ game+0x18c8b00
	void SetPartsInfo(struct FCrowBuildingPartsInfo InPartsInfo); // Function CrowFPS.CrowBuildingSMC.SetPartsInfo // (Final|Native|Public|HasOutParms) // @ game+0x18c89b0
	void SetGeometryFlag(enum class EBuildingHISMCGeomType GeomType); // Function CrowFPS.CrowBuildingSMC.SetGeometryFlag // (Final|Native|Protected) // @ game+0x18c8930
	void PrepareDepthDecalReceiver(); // Function CrowFPS.CrowBuildingSMC.PrepareDepthDecalReceiver // (Final|Native|Public) // @ game+0xa996d0
	bool IsPreview(); // Function CrowFPS.CrowBuildingSMC.IsPreview // (Final|Native|Public|Const) // @ game+0x18c8780
	struct FCrowBuildingHISMCDetail GetSMCDetail(); // Function CrowFPS.CrowBuildingSMC.GetSMCDetail // (Final|Native|Public|Const) // @ game+0x18c86f0
	struct FCrowBuildingPartsInfo GetPartsInfo(); // Function CrowFPS.CrowBuildingSMC.GetPartsInfo // (Final|Native|Public|Const) // @ game+0x18c8670
	bool GetGeometryTypeByName(struct FName InGeomName, enum class EBuildingHISMCGeomType OutGeomType); // Function CrowFPS.CrowBuildingSMC.GetGeometryTypeByName // (Final|Native|Protected|HasOutParms) // @ game+0x18c8580
	struct UBodySetup* GetBodySetupByGeomType(enum class EBuildingHISMCGeomType GeomType); // Function CrowFPS.CrowBuildingSMC.GetBodySetupByGeomType // (Final|Native|Public|Const) // @ game+0x18c84f0
	void GenerateBodySetups(struct UStaticMesh* StaticMeshAsset); // Function CrowFPS.CrowBuildingSMC.GenerateBodySetups // (Final|Native|Protected) // @ game+0x18c8460
	void CollectGeometry(struct UStaticMesh* InStaticMesh); // Function CrowFPS.CrowBuildingSMC.CollectGeometry // (Final|Native|Protected) // @ game+0x18c83d0
};

// Class CrowFPS.CrowBuildingSyncDataTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowBuildingSyncDataTable : UDataTable {
};

// Class CrowFPS.CrowButton
// Size: 0x698 (Inherited: 0x428)
struct UCrowButton : UButton {
	char pad_428[0x8]; // 0x428(0x08)
	struct FMulticastInlineDelegate OnDoubleClicked; // 0x430(0x10)
	struct TArray<struct UCrowWidgetTweenBase*> TweenerArray; // 0x440(0x10)
	float DisableOpacity; // 0x450(0x04)
	float DoubleClickTime; // 0x454(0x04)
	struct TArray<struct UImage*> ImageTweenColorArray; // 0x458(0x10)
	struct TArray<struct UTextBlock*> TextBlockTweenColorArray; // 0x468(0x10)
	struct TArray<struct UImage*> IconTweenColorArray; // 0x478(0x10)
	struct FLinearColor OnPressColorFrom; // 0x488(0x10)
	struct FLinearColor OnPressColorEnd; // 0x498(0x10)
	float OnPressTweenTime; // 0x4a8(0x04)
	struct FLinearColor OnPressTextColorFrom; // 0x4ac(0x10)
	struct FLinearColor OnPressTextColorEnd; // 0x4bc(0x10)
	float OnPressTextTweenTime; // 0x4cc(0x04)
	struct FLinearColor OnPressIconColorFrom; // 0x4d0(0x10)
	struct FLinearColor OnPressIconColorEnd; // 0x4e0(0x10)
	float OnPressIconTweenTime; // 0x4f0(0x04)
	struct FLinearColor OnReleaseColorFrom; // 0x4f4(0x10)
	struct FLinearColor OnReleaseColorEnd; // 0x504(0x10)
	float OnReleaseTweenTime; // 0x514(0x04)
	struct FLinearColor OnReleaseTextColorFrom; // 0x518(0x10)
	struct FLinearColor OnReleaseTextColorEnd; // 0x528(0x10)
	float OnReleaseTextTweenTime; // 0x538(0x04)
	struct FLinearColor OnReleaseIconColorFrom; // 0x53c(0x10)
	struct FLinearColor OnReleaseIconColorEnd; // 0x54c(0x10)
	float OnReleaseIconTweenTime; // 0x55c(0x04)
	struct FLinearColor OnHoverColorFrom; // 0x560(0x10)
	struct FLinearColor OnHoverColorEnd; // 0x570(0x10)
	float OnHoverTweenTime; // 0x580(0x04)
	struct FLinearColor OnHoverTextColorFrom; // 0x584(0x10)
	struct FLinearColor OnHoverTextColorEnd; // 0x594(0x10)
	float OnHoverTextTweenTime; // 0x5a4(0x04)
	struct FLinearColor OnHoverIconColorFrom; // 0x5a8(0x10)
	struct FLinearColor OnHoverIconColorEnd; // 0x5b8(0x10)
	float OnHoverIconTweenTime; // 0x5c8(0x04)
	bool UseLegacy; // 0x5cc(0x01)
	char pad_5CD[0x3]; // 0x5cd(0x03)
	struct FLinearColor OnUnHoverColorFrom; // 0x5d0(0x10)
	struct FLinearColor OnUnHoverColorEnd; // 0x5e0(0x10)
	float OnUnHoverTweenTime; // 0x5f0(0x04)
	struct FLinearColor OnUnHoverTextColorFrom; // 0x5f4(0x10)
	struct FLinearColor OnUnHoverTextColorEnd; // 0x604(0x10)
	float OnUnHoverTextTweenTime; // 0x614(0x04)
	struct FLinearColor OnUnHoverIconColorFrom; // 0x618(0x10)
	struct FLinearColor OnUnHoverIconColorEnd; // 0x628(0x10)
	float OnUnHoverIconTweenTime; // 0x638(0x04)
	char pad_63C[0x4]; // 0x63c(0x04)
	struct UAkAudioEvent* AudioEvent_Clicked; // 0x640(0x08)
	bool UseHoveredSound; // 0x648(0x01)
	char pad_649[0x7]; // 0x649(0x07)
	struct UAkAudioEvent* AudioEvent_Hovered; // 0x650(0x08)
	char pad_658[0xc]; // 0x658(0x0c)
	float PreOpacity; // 0x664(0x04)
	struct UCrowWidgetBase* EventHandler; // 0x668(0x08)
	struct UCrowWidgetBase* HandlerClass; // 0x670(0x08)
	struct FString HandlerName; // 0x678(0x10)
	enum class ECrowEvent Event; // 0x688(0x04)
	bool ClickCaptured; // 0x68c(0x01)
	char pad_68D[0x3]; // 0x68d(0x03)
	float CapturedDelta; // 0x690(0x04)
	bool EnableHoverdTween; // 0x694(0x01)
	char pad_695[0x3]; // 0x695(0x03)
};

// Class CrowFPS.CrowButtonContainerBase
// Size: 0x380 (Inherited: 0x348)
struct UCrowButtonContainerBase : UCrowWidgetBase {
	struct TArray<struct UCrowWidgetToggleButton*> ButtonList; // 0x348(0x10)
	struct UCanvasPanel* CP_Main; // 0x358(0x08)
	struct UWidget* MainTabPanel; // 0x360(0x08)
	char DefaultIndex; // 0x368(0x01)
	bool IsStartSelectDefaultIndex; // 0x369(0x01)
	bool IsStartSelectAction; // 0x36a(0x01)
	bool UseAutoButtonIndex; // 0x36b(0x01)
	char pad_36C[0x14]; // 0x36c(0x14)

	void OnChangeSelectTabButton(int32_t SelectIndex); // Function CrowFPS.CrowButtonContainerBase.OnChangeSelectTabButton // (Final|Native|Protected) // @ game+0x18c87a0
};

// Class CrowFPS.CrowCameraModifierFlashBang
// Size: 0x68 (Inherited: 0x48)
struct UCrowCameraModifierFlashBang : UCameraModifier {
	struct UMaterialInstance* FlashBangBlindMaterialInstance; // 0x48(0x08)
	struct UMaterialInstance* FlashBangAfterImageMaterialInstance; // 0x50(0x08)
	struct UMaterialInstanceDynamic* FlashBangBlindMaterialInsDynamic; // 0x58(0x08)
	struct UMaterialInstanceDynamic* FlashBangAfterImageMaterialInsDynamic; // 0x60(0x08)
};

// Class CrowFPS.CrowCameraPivotHeliComponent
// Size: 0x210 (Inherited: 0x200)
struct UCrowCameraPivotHeliComponent : USceneComponent {
	float MinPitch; // 0x1f8(0x04)
	float MaxPitch; // 0x1fc(0x04)
	struct UCurveFloat* RollCurve; // 0x200(0x08)

	void Pitch(float IVal); // Function CrowFPS.CrowCameraPivotHeliComponent.Pitch // (Final|Native|Public|BlueprintCallable) // @ game+0x18c88b0
};

// Class CrowFPS.CrowCarAnimInstance
// Size: 0x2f0 (Inherited: 0x2d0)
struct UCrowCarAnimInstance : UCrowLandWheelsAnimInstance {
	float WheelMaxAngleToSteeringMaxAngle; // 0x2c8(0x04)
	struct UCrowVehicleEventDispatcher* EventDispatcher; // 0x2d0(0x08)
	struct UCrowVehicleSightComponent* Sight; // 0x2d8(0x08)
	struct TArray<struct FCrowCarWeaponAnimData> WeaponAnimDatas; // 0x2e0(0x10)
};

// Class CrowFPS.CrowCategoryAppearanceWidget
// Size: 0x378 (Inherited: 0x348)
struct UCrowCategoryAppearanceWidget : UCrowWidgetBase {
	struct UVerticalBox* VB_Custmize_Appearance; // 0x348(0x08)
	struct UHorizontalBox* HB_Appearance; // 0x350(0x08)
	struct UCrowCustomAppearanceListWidget* CustomAppearanceListWidget; // 0x358(0x08)
	struct TArray<struct UCrowCategorySlotBigWidget*> AppearanceSlotWidgetArray; // 0x360(0x10)
	struct ACrowSceneLobby* SceneLobby; // 0x370(0x08)
};

// Class CrowFPS.CrowCategorySlotBigWidget
// Size: 0x3b0 (Inherited: 0x348)
struct UCrowCategorySlotBigWidget : UCrowWidgetBase {
	struct UImage* IMG_Selected; // 0x348(0x08)
	struct UCrowButton* BT_Slot; // 0x350(0x08)
	struct UTextBlock* TB_Name; // 0x358(0x08)
	struct UImage* IMG_Used; // 0x360(0x08)
	struct UImage* IMG_New; // 0x368(0x08)
	char pad_370[0x10]; // 0x370(0x10)
	struct FText SlotName; // 0x380(0x18)
	enum class ECrowItemType ItemCategoryType; // 0x398(0x01)
	enum class ECrowWeaponUIType WeaponCategoryType; // 0x399(0x01)
	enum class ECrowWeaponAccType WeaponAccCategoryType; // 0x39a(0x01)
	enum class ECrowCharacterAppearanceType AppearanceCategoryType; // 0x39b(0x01)
	char pad_39C[0x4]; // 0x39c(0x04)
	struct UTextBlock* TBName_Seleted; // 0x3a0(0x08)
	bool Selected; // 0x3a8(0x01)
	bool Used; // 0x3a9(0x01)
	char pad_3AA[0x6]; // 0x3aa(0x06)

	void OnClicked_BT_Slot(); // Function CrowFPS.CrowCategorySlotBigWidget.OnClicked_BT_Slot // (Final|Native|Protected) // @ game+0x18c8870
};

// Class CrowFPS.CrowCategorySlotSmallWidget
// Size: 0x4e0 (Inherited: 0x348)
struct UCrowCategorySlotSmallWidget : UCrowWidgetBase {
	struct UImage* IMG_Selected; // 0x348(0x08)
	struct UImage* IMG_New; // 0x350(0x08)
	struct UCrowButton* BT_Customize_SmallSlot; // 0x358(0x08)
	struct UTextBlock* TB_CategoryName; // 0x360(0x08)
	struct UWidgetSwitcher* WS_ItemIMG; // 0x368(0x08)
	struct UImage* IMG_IconIMG_Category; // 0x370(0x08)
	struct UImage* IMG_IconIMG_Item; // 0x378(0x08)
	char pad_380[0x10]; // 0x380(0x10)
	struct FText CategoryContentsName; // 0x390(0x18)
	struct FSlateBrush CategoryDefaultImage; // 0x3a8(0x88)
	struct FSlateBrush CategoryItemImage; // 0x430(0x88)
	enum class ECrowItemType ItemCategoryType; // 0x4b8(0x01)
	enum class ECrowCharacterAppearanceType AppearanceCategoryType; // 0x4b9(0x01)
	bool Equiped; // 0x4ba(0x01)
	bool Disabled; // 0x4bb(0x01)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct UTextBlock* TBCategoryName_Sel; // 0x4c0(0x08)
	bool Selected; // 0x4c8(0x01)
	char pad_4C9[0x3]; // 0x4c9(0x03)
	int32_t ButtonIndex; // 0x4cc(0x04)
	char pad_4D0[0x10]; // 0x4d0(0x10)

	void OnClicked_CategorySlotSmall(); // Function CrowFPS.CrowCategorySlotSmallWidget.OnClicked_CategorySlotSmall // (Final|Native|Protected) // @ game+0x18c8890
};

// Class CrowFPS.CrowChangeNicknameWidget
// Size: 0x390 (Inherited: 0x368)
struct UCrowChangeNicknameWidget : UCrowFullScreenWidgetBase {
	struct UCrowButton* BT_Ok; // 0x368(0x08)
	struct UCrowButton* BT_Cancel; // 0x370(0x08)
	struct UEditableTextBox* TB_Nickname_Text; // 0x378(0x08)
	struct UTextBlock* TB_CurrentNickname; // 0x380(0x08)
	int32_t ChangeNicknameItemIndex; // 0x388(0x04)
	char pad_38C[0x4]; // 0x38c(0x04)

	void OnClick_BT_Ok(); // Function CrowFPS.CrowChangeNicknameWidget.OnClick_BT_Ok // (Final|Native|Protected) // @ game+0x18c8850
	void OnClick_BT_Cancel(); // Function CrowFPS.CrowChangeNicknameWidget.OnClick_BT_Cancel // (Final|Native|Protected) // @ game+0x18c8830
};

// Class CrowFPS.CrowCharacterAimComponent
// Size: 0x200 (Inherited: 0x108)
struct UCrowCharacterAimComponent : UCrowAimComponentBase {
	struct UCrowWeaponPartsPrimarySight* PrimarySightPart; // 0x108(0x08)
	struct UCrowWeaponPartsPrimarySight* SecondarySightPart; // 0x110(0x08)
	struct UCrowWeaponPartsPrimarySight* CurrentSightPart; // 0x118(0x08)
	struct UCrowWeaponZoomWidget* ZoomWidget; // 0x120(0x08)
	struct UCrowLocalPostProcessComponent* PostProcessComp; // 0x128(0x08)
	struct FTransform WeaponRootTransform; // 0x130(0x30)
	struct ACrowCharacterPawn* CharacterPawn; // 0x160(0x08)
	struct UCurveFloat* AimCurveX; // 0x168(0x08)
	struct UCurveFloat* AimCurveY; // 0x170(0x08)
	struct UCrowDOFComponent* DOFComponent; // 0x178(0x08)
	struct TArray<struct FCrowAimEvent> AimEventArray; // 0x180(0x10)
	char pad_190[0x70]; // 0x190(0x70)
};

// Class CrowFPS.CrowPingWidgetBase
// Size: 0x378 (Inherited: 0x348)
struct UCrowPingWidgetBase : UCrowWidgetBase {
	struct AActor* PingTargetActor; // 0x348(0x08)
	struct UCanvasPanel* CP_Ping; // 0x350(0x08)
	struct UWidgetAnimation* AniPingTargetStart; // 0x358(0x08)
	struct UWidgetAnimation* AniPingTargetLoop; // 0x360(0x08)
	struct UWidgetAnimation* AniPingHoverLoop; // 0x368(0x08)
	char pad_370[0x8]; // 0x370(0x08)

	void OnPingTargetStartFinished(); // Function CrowFPS.CrowPingWidgetBase.OnPingTargetStartFinished // (Final|Native|Protected) // @ game+0x1960ee0
};

// Class CrowFPS.CrowWorldIconWidgetBase
// Size: 0x3c8 (Inherited: 0x378)
struct UCrowWorldIconWidgetBase : UCrowPingWidgetBase {
	struct UCanvasPanel* CP_Root; // 0x378(0x08)
	struct UCanvasPanel* CP_LocateArrow; // 0x380(0x08)
	struct UCanvasPanel* CP_AnchorRoot; // 0x388(0x08)
	struct UCanvasPanel* CP_Icon; // 0x390(0x08)
	struct UTextBlock* TB_Name; // 0x398(0x08)
	struct UTextBlock* TB_Distance; // 0x3a0(0x08)
	struct TArray<struct UWidget*> IconLOD; // 0x3a8(0x10)
	struct AActor* TargetActor; // 0x3b8(0x08)
	char pad_3C0[0x8]; // 0x3c0(0x08)
};

// Class CrowFPS.CrowCharacterAliveIconWidget
// Size: 0x400 (Inherited: 0x3c8)
struct UCrowCharacterAliveIconWidget : UCrowWorldIconWidgetBase {
	struct UCanvasPanel* CP_DisconnectIcon; // 0x3c8(0x08)
	struct UImage* IMG_Icon; // 0x3d0(0x08)
	struct UTextBlock* TB_SquadNum; // 0x3d8(0x08)
	struct ACrowPlayerStateBase* LocalPlayerState; // 0x3e0(0x08)
	struct ACrowPlayerStateBase* TargetPlayerState; // 0x3e8(0x08)
	struct ACrowCharacterPawn* CharacterPawn; // 0x3f0(0x08)
	char pad_3F8[0x8]; // 0x3f8(0x08)
};

// Class CrowFPS.CrowCharacterAnimator
// Size: 0xd8 (Inherited: 0xb0)
struct UCrowCharacterAnimator : UActorComponent {
	struct UDataTable* CharacterAnimationTable; // 0xb0(0x08)
	struct UAnimInstance* AI_Mesh3P; // 0xb8(0x08)
	struct UAnimInstance* AI_Mesh1PLowBody; // 0xc0(0x08)
	struct UAnimInstance* AI_Mesh1PArm; // 0xc8(0x08)
	char bIsAnimInstanceInitialized : 1; // 0xd0(0x01)
	char pad_D0_1 : 7; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)

	void StopAnimation(struct FName AnimationName); // Function CrowFPS.CrowCharacterAnimator.StopAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x18c8e50
	void StopAllAnimation(float InBlendOutTime); // Function CrowFPS.CrowCharacterAnimator.StopAllAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x18c8dd0
	void SetPhysicsRagdoll(); // Function CrowFPS.CrowCharacterAnimator.SetPhysicsRagdoll // (Final|Native|Public|BlueprintCallable) // @ game+0x18c8ae0
	void InitializeAnimInstances(); // Function CrowFPS.CrowCharacterAnimator.InitializeAnimInstances // (Final|Native|Protected) // @ game+0x18c8760
	void AddRadialImpulse(struct FVector Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bVelChange); // Function CrowFPS.CrowCharacterAnimator.AddRadialImpulse // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x18c8200
	void AddImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName); // Function CrowFPS.CrowCharacterAnimator.AddImpulseAtLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x18c80d0
};

// Class CrowFPS.CrowCharacterAnimInst
// Size: 0x480 (Inherited: 0x2c0)
struct UCrowCharacterAnimInst : UAnimInstance {
	enum class ECrowMovementMode MovementMode; // 0x2b8(0x01)
	enum class ECrowCharacterAnimStance TargetStance; // 0x2b9(0x01)
	enum class ECrowCharacterAnimInAir InAir; // 0x2ba(0x01)
	enum class ECrowCharacterPeekState PeekState; // 0x2bb(0x01)
	bool bIsOnCombat; // 0x2bc(0x01)
	bool bIsOnAim; // 0x2bd(0x01)
	bool bIsMoving; // 0x2be(0x01)
	float MoveDirection; // 0x2c0(0x04)
	float GaitValue; // 0x2c4(0x04)
	enum class ECrowWeaponSubType WeaponType; // 0x2c8(0x01)
	enum class ECrowCharacterAnimWeapon WeaponAction; // 0x2c9(0x01)
	bool bIsWeaponStartFire; // 0x2ca(0x01)
	bool bIsWeaponLoopFire; // 0x2cb(0x01)
	bool bIsAimSecondarySight; // 0x2cc(0x01)
	struct FRotator LeftArmAdjustedOnSlopeRotation; // 0x2d0(0x0c)
	struct FRotator AimingRotation; // 0x2dc(0x0c)
	enum class ECrowCharacterAnimStance CurrentStance; // 0x2e8(0x01)
	enum class ECrowCharacterBattleStance BattleStance; // 0x2e9(0x01)
	enum class ECrowCharacterAnimActionType ActionType; // 0x2ea(0x01)
	float MovementPlayRateStand; // 0x2ec(0x04)
	float MovementPlayRateCrouch; // 0x2f0(0x04)
	float MovementPlayRateProne; // 0x2f4(0x04)
	bool bIsOnAimLocal; // 0x2f8(0x01)
	bool bIsShootAction; // 0x2f9(0x01)
	float AimOffsetAlpha; // 0x2fc(0x04)
	float HandIKAlpha; // 0x300(0x04)
	float OverlayLeftHand; // 0x304(0x04)
	float OverlayRightHand; // 0x308(0x04)
	bool bIsFallFlail; // 0x30c(0x01)
	char pad_30E[0x2]; // 0x30e(0x02)
	struct FTransform PrivateWeaponIKTarget; // 0x310(0x30)
	struct FTransform VehicleLeftHandIK; // 0x340(0x30)
	struct FTransform VehicleRightHandIK; // 0x370(0x30)
	enum class EVehicleSeatType VehicleSeatType; // 0x3a0(0x01)
	char VehicleSeatIndex; // 0x3a1(0x01)
	bool bIsInjured; // 0x3a2(0x01)
	bool bIsSkydiving; // 0x3a3(0x01)
	char SkydivingState; // 0x3a4(0x01)
	char pad_3A5[0x3]; // 0x3a5(0x03)
	float AnimatedWalkSpeed; // 0x3a8(0x04)
	float AnimatedRunSpeed; // 0x3ac(0x04)
	float AnimatedSprintSpeed; // 0x3b0(0x04)
	float AnimatedCrouchWalkSpeed; // 0x3b4(0x04)
	float AnimatedCrouchRunSpeed; // 0x3b8(0x04)
	float AnimatedCrouchSprintSpeed; // 0x3bc(0x04)
	float AnimatedProneSpeed; // 0x3c0(0x04)
	float AnimatedProneWalkSpeed; // 0x3c4(0x04)
	float SkydivingForwardValue; // 0x3c8(0x04)
	float SkydivingRightValue; // 0x3cc(0x04)
	struct FTransform ParachuteGripLeftTransform; // 0x3d0(0x30)
	struct FTransform ParachuteGripRightTransform; // 0x400(0x30)
	struct ACrowCharacterPawn* CharacterOwner; // 0x430(0x08)
	struct UCrowCharacterMovement* CharacterMovement; // 0x438(0x08)
	struct ACrowWeaponBase* WeaponActor; // 0x440(0x08)
	struct ACrowVehiclePawn* VehiclePawn; // 0x448(0x08)
	struct FName NamePrivateBase; // 0x450(0x08)
	struct FName NamePrivateShoot; // 0x458(0x08)
	struct FName NamePrivateReload; // 0x460(0x08)
	struct FName NameItemAction; // 0x468(0x08)
	struct FName NameOnVehicle; // 0x470(0x08)
	char pad_478[0x8]; // 0x478(0x08)

	void SetPrivateWeaponIK(struct FTransform LeftHandTarget); // Function CrowFPS.CrowCharacterAnimInst.SetPrivateWeaponIK // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x18cc1d0
	bool IsUsingPrivateWeapon(); // Function CrowFPS.CrowCharacterAnimInst.IsUsingPrivateWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18cbe20
	bool IsProneStanceChanging(); // Function CrowFPS.CrowCharacterAnimInst.IsProneStanceChanging // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18cbdf0
	bool IsProne(); // Function CrowFPS.CrowCharacterAnimInst.IsProne // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x18cbdc0
	bool IsAnyStanceChanging(); // Function CrowFPS.CrowCharacterAnimInst.IsAnyStanceChanging // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18cbd90
	bool IsAimSecondarySight(); // Function CrowFPS.CrowCharacterAnimInst.IsAimSecondarySight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18cbd60
	void AnimNotify_SelectWeapon(); // Function CrowFPS.CrowCharacterAnimInst.AnimNotify_SelectWeapon // (Native|Protected) // @ game+0x18cbb70
	void AnimNotify_OnLand(); // Function CrowFPS.CrowCharacterAnimInst.AnimNotify_OnLand // (Native|Protected) // @ game+0x18cbb50
};

// Class CrowFPS.CrowPlayMontageCallbackProxy
// Size: 0xc0 (Inherited: 0x28)
struct UCrowPlayMontageCallbackProxy : UObject {
	struct FMulticastInlineDelegate OnCompleted; // 0x28(0x10)
	struct FMulticastInlineDelegate OnBlendOut; // 0x38(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x48(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x58(0x10)
	struct FMulticastInlineDelegate OnNotifyEnd; // 0x68(0x10)
	char pad_78[0x48]; // 0x78(0x48)

	void OnNotifyEndReceived(struct FName NotifyName, struct FBranchingPointNotifyPayload BranchingPointNotifyPayload); // Function CrowFPS.CrowPlayMontageCallbackProxy.OnNotifyEndReceived // (Final|Native|Protected|HasOutParms) // @ game+0x18cc0e0
	void OnNotifyBeginReceived(struct FName NotifyName, struct FBranchingPointNotifyPayload BranchingPointNotifyPayload); // Function CrowFPS.CrowPlayMontageCallbackProxy.OnNotifyBeginReceived // (Final|Native|Protected|HasOutParms) // @ game+0x18cbff0
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function CrowFPS.CrowPlayMontageCallbackProxy.OnMontageEnded // (Final|Native|Protected) // @ game+0x18cbf20
	void OnMontageBlendingOut(struct UAnimMontage* Montage, bool bInterrupted); // Function CrowFPS.CrowPlayMontageCallbackProxy.OnMontageBlendingOut // (Final|Native|Protected) // @ game+0x18cbe50
	struct UCrowPlayMontageCallbackProxy* CreateProxyObjectForPlayMontage(struct USkeletalMeshComponent* InSkeletalMeshComponent, struct UAnimMontage* MontageToPlay, float PlayRate, float StartingPosition, struct FName StartingSection, bool bPendingGC); // Function CrowFPS.CrowPlayMontageCallbackProxy.CreateProxyObjectForPlayMontage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18cbb90
};

// Class CrowFPS.CrowCharacterAnimInstance
// Size: 0xbf0 (Inherited: 0xbf0)
struct UCrowCharacterAnimInstance : UCLSCharacterAnimInstance {
};

// Class CrowFPS.CrowCharacterAnimInstBase
// Size: 0x300 (Inherited: 0x2c0)
struct UCrowCharacterAnimInstBase : UAnimInstance {
	enum class ECrowWeaponSubType CurrentWeaponType; // 0x2b8(0x01)
	enum class ECrowRotationMode RotationMode; // 0x2b9(0x01)
	enum class ECrowMovementMode CurrentMovementMode; // 0x2ba(0x01)
	enum class ECrowMovementMode PrevMovementMode; // 0x2bb(0x01)
	enum class ECrowCharacterAnimStance CurrentStance; // 0x2bc(0x01)
	enum class ECrowCharacterAnimStance TransitionStance; // 0x2bd(0x01)
	enum class ECrowCharacterBattleStance BattleStance; // 0x2be(0x01)
	bool bIsMoving; // 0x2bf(0x01)
	struct FVector Velocity; // 0x2c0(0x0c)
	struct FVector2D AimOffset; // 0x2cc(0x08)
	float MoveDirection; // 0x2d4(0x04)
	float GaitValue; // 0x2d8(0x04)
	float PlayRateStand; // 0x2dc(0x04)
	float PlayRateCrouch; // 0x2e0(0x04)
	float PlayRateProne; // 0x2e4(0x04)
	bool bIsTurnInPlace; // 0x2e8(0x01)
	float StanceBlendingTime; // 0x2ec(0x04)
	bool bIsWeaponRightHanded; // 0x2f0(0x01)
	bool bIsProneMoving; // 0x2f1(0x01)
	bool bIsOnInteract; // 0x2f2(0x01)
	char pad_2F8[0x8]; // 0x2f8(0x08)

	void AnimNotify_EnterStateEntry(); // Function CrowFPS.CrowCharacterAnimInstBase.AnimNotify_EnterStateEntry // (Native|Protected) // @ game+0x18cbb30
	void AnimNotify_EndProneMoving(); // Function CrowFPS.CrowCharacterAnimInstBase.AnimNotify_EndProneMoving // (Native|Protected) // @ game+0x18cbb10
	void AnimNotify_BeginProneMoving(); // Function CrowFPS.CrowCharacterAnimInstBase.AnimNotify_BeginProneMoving // (Native|Protected) // @ game+0x18cbaf0
};

// Class CrowFPS.CrowCharacterAnimInstFP
// Size: 0x6f0 (Inherited: 0x480)
struct UCrowCharacterAnimInstFP : UCrowCharacterAnimInst {
	struct FCrowCharacterAnimPrivateWeaponFPRow PrivateBaseAnim; // 0x478(0xa0)
	struct FRotator LastLookRotation; // 0x518(0x0c)
	struct FVector2D WeaponSway; // 0x524(0x08)
	struct FVector2D LastWeaponSway; // 0x52c(0x08)
	float EndWeaponSway; // 0x534(0x04)
	struct FTransform WeaponRootTransform; // 0x540(0x30)
	struct ACrowWeaponBase* CurrentAnimWeapon; // 0x570(0x08)
	char pad_578[0x8]; // 0x578(0x08)
	struct FTransform LeftHandIK; // 0x580(0x30)
	struct FTransform RightHandIK; // 0x5b0(0x30)
	float Enable_GripIK_L; // 0x5e0(0x04)
	float Enable_GripIK_R; // 0x5e4(0x04)
	int32_t GripIKLFindPriorityIndex; // 0x5e8(0x04)
	float Enable_HandIK_L; // 0x5ec(0x04)
	float Enable_HandIK_R; // 0x5f0(0x04)
	float Enable_TargetIK_L; // 0x5f4(0x04)
	float Enable_TargetIK_R; // 0x5f8(0x04)
	float Enable_GripPose_L; // 0x5fc(0x04)
	float Enable_GripPose_R; // 0x600(0x04)
	float CameraAnimRelative; // 0x604(0x04)
	float CopyToFPArmCurveValue; // 0x608(0x04)
	char pad_60C[0x4]; // 0x60c(0x04)
	struct FTransform Clavicle_L_TR; // 0x610(0x30)
	struct FTransform Clavicle_R_TR; // 0x640(0x30)
	struct FMatrix CDInverseM; // 0x670(0x40)
	bool bIsWeaponFiring; // 0x6b0(0x01)
	char pad_6B1[0x3]; // 0x6b1(0x03)
	struct FRotator LookingDirection; // 0x6b4(0x0c)
	struct FVector SubRootOffset; // 0x6c0(0x0c)
	bool EnableAdjustLeftArmOnSlope; // 0x6cc(0x01)
	char pad_6CD[0x3]; // 0x6cd(0x03)
	struct USkeletalMeshComponent* TPMeshComponent; // 0x6d0(0x08)
	struct FCLSGripPose GripPose; // 0x6d8(0x10)
	char pad_6E8[0x8]; // 0x6e8(0x08)
};

// Class CrowFPS.CrowCharacterAnimTableManager
// Size: 0x80 (Inherited: 0x28)
struct UCrowCharacterAnimTableManager : UObject {
	struct UDataTable* PrivateTP; // 0x28(0x08)
	struct UDataTable* PrivateFP; // 0x30(0x08)
	struct UDataTable* PrivateShoot; // 0x38(0x08)
	struct UDataTable* PrivateReload; // 0x40(0x08)
	struct UDataTable* ItemAction; // 0x48(0x08)
	struct UDataTable* OnVehicle; // 0x50(0x08)
	struct UDataTable* Common; // 0x58(0x08)
	struct UDataTable* GroundPoseTable; // 0x60(0x08)
	struct UDataTable* VehiclePoseTable; // 0x68(0x08)
	struct UDataTable* GripPoseTable; // 0x70(0x08)
	struct UDataTable* CommonAnimTable; // 0x78(0x08)
};

// Class CrowFPS.CrowCharacterDamageHandler
// Size: 0x1f0 (Inherited: 0xb0)
struct UCrowCharacterDamageHandler : UCrowBattleDamageHandlerBase {
	struct ACrowCharacterPawn* Character; // 0xb0(0x08)
	struct UCrowBattleStatus* BattleStatus; // 0xb8(0x08)
	struct FCharacterHitInfo LastTakeHitInfo; // 0xc0(0x130)

	void Init(struct ACrowCharacterPawn* NewCharacter, struct UCrowBattleStatus* NewBattleStatus); // Function CrowFPS.CrowCharacterDamageHandler.Init // (Final|Native|Public) // @ game+0x18ceca0
	bool CanDie(float KillingDamage, struct FDamageEvent DamageEvent, struct AController* KillerInstigator, struct AActor* DamageCauser); // Function CrowFPS.CrowCharacterDamageHandler.CanDie // (Final|Native|Protected|HasOutParms) // @ game+0x18ce980
};

// Class CrowFPS.CrowCharacterDeathIconWidget
// Size: 0x3e0 (Inherited: 0x3c8)
struct UCrowCharacterDeathIconWidget : UCrowWorldIconWidgetBase {
	struct UCanvasPanel* CP_DisconnectIcon; // 0x3c8(0x08)
	struct ACrowPlayerStateBase* TargetPlayerState; // 0x3d0(0x08)
	char pad_3D8[0x8]; // 0x3d8(0x08)
};

// Class CrowFPS.CrowCharacterDyingIconWidget
// Size: 0x410 (Inherited: 0x3c8)
struct UCrowCharacterDyingIconWidget : UCrowWorldIconWidgetBase {
	struct UCanvasPanel* CP_DisconnectIcon; // 0x3c8(0x08)
	struct UImage* IMG_2ndWindGauge; // 0x3d0(0x08)
	struct ACrowPlayerStateBase* TargetPlayerState; // 0x3d8(0x08)
	struct ACrowCharacterPawn* CharacterPawn; // 0x3e0(0x08)
	struct UMaterialInstanceDynamic* GaugeMaterial; // 0x3e8(0x08)
	struct UWidgetAnimation* AniFastBleeding; // 0x3f0(0x08)
	struct UWidgetAnimation* AniStopBleeding; // 0x3f8(0x08)
	struct UWidgetAnimation* AniCallHelp; // 0x400(0x08)
	char pad_408[0x8]; // 0x408(0x08)
};

// Class CrowFPS.CrowCharacterFallsComponent
// Size: 0xf0 (Inherited: 0xc0)
struct UCrowCharacterFallsComponent : UCrowActorComponentBase {
	bool bIsFalling; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
	struct ACrowCharacterPawn* CharacterPawn; // 0xc8(0x08)
	struct UCrowCharacterMovement* CrowMovementComp; // 0xd0(0x08)
	enum class EVehicleIdentity CurrentVehicleType; // 0xd8(0x01)
	enum class ECrowFallsDamageType DamageType; // 0xd9(0x01)
	char pad_DA[0x2]; // 0xda(0x02)
	float Damage; // 0xdc(0x04)
	struct FVector StartPosition; // 0xe0(0x0c)
	enum class EPhysicalSurface SurfaceType; // 0xec(0x01)
	char pad_ED[0x3]; // 0xed(0x03)

	struct UCrowPassenger* GetPassenger(); // Function CrowFPS.CrowCharacterFallsComponent.GetPassenger // (Final|Native|Private) // @ game+0x18cec50
};

// Class CrowFPS.CrowCharacterHUD
// Size: 0x288 (Inherited: 0x260)
struct UCrowCharacterHUD : UUserWidget {
	struct FCrowCharacterHUDSetting HudSetting; // 0x260(0x24)
	char pad_284[0x4]; // 0x284(0x04)

	enum class ESlateVisibility UpdateVisibleState(struct APawn* InPawn, float Distance); // Function CrowFPS.CrowCharacterHUD.UpdateVisibleState // (Final|Native|Public|BlueprintCallable) // @ game+0x18cf6d0
	float UpdateScale(float Distance); // Function CrowFPS.CrowCharacterHUD.UpdateScale // (Final|Native|Public|BlueprintCallable) // @ game+0x18cf630
	float UpdateOpacity(float Distance); // Function CrowFPS.CrowCharacterHUD.UpdateOpacity // (Final|Native|Public|BlueprintCallable) // @ game+0x18cf590
	bool RaycastToOwningPlayer(struct APawn* InPawn); // Function CrowFPS.CrowCharacterHUD.RaycastToOwningPlayer // (Final|Native|Private) // @ game+0x18cf2a0
	float LerpByDistance(float currDist, float distMin, float distMax, float lerpMin, float lerpMax); // Function CrowFPS.CrowCharacterHUD.LerpByDistance // (Final|Native|Private) // @ game+0x18cee70
	bool IsSameTeam(struct APawn* InPawn); // Function CrowFPS.CrowCharacterHUD.IsSameTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x18cedd0
	float GetDistanceFromOwningPlayer(struct APawn* InPawn); // Function CrowFPS.CrowCharacterHUD.GetDistanceFromOwningPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x18ceb10
};

// Class CrowFPS.CrowCharacterMainAnimBase
// Size: 0x3a0 (Inherited: 0x300)
struct UCrowCharacterMainAnimBase : UCrowCharacterAnimInstBase {
	struct FCrowCharacterMontageDepends MontagesDepends; // 0x2f8(0x50)
	struct UCrowCharacterAnimInstBase* MontagesOwner; // 0x348(0x08)
	struct UAnimMontage* CachedTurnMontage; // 0x350(0x08)
	enum class ECrowCharacterHandIKType HandIKType; // 0x358(0x01)
	struct FTransform LeftHandIKTransform; // 0x360(0x30)
	enum class ECrowCharacterVehicleAnimType VehicleType; // 0x390(0x01)
	char pad_392[0x2]; // 0x392(0x02)
	float ElapsedHandIK; // 0x394(0x04)
	float AlphaHandIK; // 0x398(0x04)
	char pad_39C[0x4]; // 0x39c(0x04)
};

// Class CrowFPS.CrowCharacterMainAnimFPArm
// Size: 0x3d0 (Inherited: 0x3a0)
struct UCrowCharacterMainAnimFPArm : UCrowCharacterMainAnimBase {
	char pad_3A0[0xc]; // 0x3a0(0x0c)
	struct FVector2D WeaponFollowValue; // 0x3ac(0x08)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct ACrowWeaponBase* CurrentWeapon; // 0x3b8(0x08)
	enum class ECrowPrivateWeaponAnimType WeaponAnimType; // 0x3c0(0x01)
	char pad_3C1[0xf]; // 0x3c1(0x0f)
};

// Class CrowFPS.CrowCharacterMainAnimFPBody
// Size: 0x3b0 (Inherited: 0x3a0)
struct UCrowCharacterMainAnimFPBody : UCrowCharacterMainAnimBase {
	struct USkeletalMeshComponent* MeshForPoseCopy; // 0x3a0(0x08)
	char pad_3A8[0x8]; // 0x3a8(0x08)
};

// Class CrowFPS.CrowCharacterMainAnimTP
// Size: 0x500 (Inherited: 0x3a0)
struct UCrowCharacterMainAnimTP : UCrowCharacterMainAnimBase {
	struct FCrowCharacterAimOffsetDepends AimOffsetDepends; // 0x3a0(0x50)
	struct FCrowCharacterAimOffsetVehicle AimOffsetVehicle; // 0x3f0(0x58)
	struct UAnimMontage* MontageLandAdditive; // 0x448(0x08)
	struct TMap<enum class ECrowCharacterHitParts, struct UAnimMontage*> HitAnims; // 0x450(0x50)
	struct TMap<enum class ECrowCharacterAnimStance, struct FCrowCharacterDeathAnimByDirection> GroundDeathAnims; // 0x4a0(0x50)
	struct FVector2D LeanOnVehicle; // 0x4f0(0x08)
	enum class ECrowCharacterPeekState PeekState; // 0x4f8(0x01)
	char pad_4F9[0x7]; // 0x4f9(0x07)
};

// Class CrowFPS.CrowCharacterMesh
// Size: 0x2b8 (Inherited: 0x220)
struct ACrowCharacterMesh : AActor {
	int32_t FaceIndex; // 0x220(0x04)
	int32_t TopIndex; // 0x224(0x04)
	int32_t BottomIndex; // 0x228(0x04)
	int32_t GlovesIndex; // 0x22c(0x04)
	int32_t ShoesIndex; // 0x230(0x04)
	int32_t OuterIndex; // 0x234(0x04)
	int32_t BackPackIndex; // 0x238(0x04)
	int32_t GlassesIndex; // 0x23c(0x04)
	int32_t MaskIndex; // 0x240(0x04)
	int32_t HeadIndex; // 0x244(0x04)
	int32_t HairIndex; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)
	struct USkeletalMeshComponent* FaceMeshComp; // 0x250(0x08)
	struct USkeletalMeshComponent* HairMeshComp; // 0x258(0x08)
	struct USkeletalMeshComponent* TopMeshComp; // 0x260(0x08)
	struct USkeletalMeshComponent* BottomMeshComp; // 0x268(0x08)
	struct USkeletalMeshComponent* GlovesMeshComp; // 0x270(0x08)
	struct USkeletalMeshComponent* ShoesMeshComp; // 0x278(0x08)
	struct USkeletalMeshComponent* OuterMeshComp; // 0x280(0x08)
	struct USkeletalMeshComponent* BackPackMeshComp; // 0x288(0x08)
	struct USkeletalMeshComponent* GlassesMeshComp; // 0x290(0x08)
	struct USkeletalMeshComponent* MaskMeshComp; // 0x298(0x08)
	struct USkeletalMeshComponent* HeadMeshComp; // 0x2a0(0x08)
	struct UCrowLibraryMergeSKCTask* MergeMeshTask; // 0x2a8(0x08)
	char pad_2B0[0x8]; // 0x2b0(0x08)

	void OnCompleteMergedMesh(struct USkeletalMesh* InMergedMesh); // Function CrowFPS.CrowCharacterMesh.OnCompleteMergedMesh // (Native|Protected) // @ game+0xc99db0
	void B_MergeMeshes(); // Function CrowFPS.CrowCharacterMesh.B_MergeMeshes // (Final|Native|Public) // @ game+0x18ce960
	void A_ShowTransforms(); // Function CrowFPS.CrowCharacterMesh.A_ShowTransforms // (Final|Native|Public) // @ game+0x18ce940
};

// Class CrowFPS.CrowCharacterMovement
// Size: 0xf40 (Inherited: 0xb70)
struct UCrowCharacterMovement : UCLSCharacterMovement {
	char pad_B70[0xc]; // 0xb70(0x0c)
	float RotationRateMultiplier; // 0xb7c(0x04)
	struct FCrowMovementSetting MovementSetting; // 0xb80(0x60)
	float DiveImpactDelayElapsed; // 0xbe0(0x04)
	char bWantsToWeaponFiring : 1; // 0xbe4(0x01)
	char pad_BE4_1 : 7; // 0xbe4(0x01)
	bool bSaveAimState; // 0xbe5(0x01)
	enum class ECrowCharacterFallType FallType; // 0xbe6(0x01)
	char pad_BE7[0x1]; // 0xbe7(0x01)
	float TargetTimeLandDelay; // 0xbe8(0x04)
	float ElapsedTimeLandDelay; // 0xbec(0x04)
	char pad_BF0[0x4]; // 0xbf0(0x04)
	float PenetrationOverlapCheckInflation; // 0xbf4(0x04)
	struct ACrowCharacterPawn* CachedCrowCharacter; // 0xbf8(0x08)
	struct UCrowProneCapsuleComponent* ProneUpdatedComponent; // 0xc00(0x08)
	struct UPrimitiveComponent* LastBlockedComponent; // 0xc08(0x08)
	struct FCrowCharacterMovementWaterInfo WaterInfo; // 0xc10(0x60)
	uint32_t ReceivedWorldActorIndex; // 0xc70(0x04)
	int16_t ReceivedLayoutItemIndex; // 0xc74(0x02)
	bool UseReceivedIndex; // 0xc76(0x01)
	char pad_C77[0x2c9]; // 0xc77(0x2c9)
};

// Class CrowFPS.CrowCharacterMovementCollision
// Size: 0x220 (Inherited: 0x200)
struct UCrowCharacterMovementCollision : USceneComponent {
	bool bActiveHeadCollision; // 0x1f8(0x01)
	bool bHitHead; // 0x1f9(0x01)
	bool bSimulating; // 0x1fa(0x01)
	float HeadCollisionRadius; // 0x1fc(0x04)
	struct FQuat HeadRotation; // 0x200(0x10)
	struct UCrowCharacterMovement* CrowMovement; // 0x210(0x08)
	char pad_21F[0x1]; // 0x21f(0x01)

	bool SimulateHitCrowCameraTP(struct FVector InCharacterLocation, struct UCameraComponent* InTPCamera, struct FTransform InAdditiveTM); // Function CrowFPS.CrowCharacterMovementCollision.SimulateHitCrowCameraTP // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x18d3e20
	void SetHeadCollisionRadius(float InRadius); // Function CrowFPS.CrowCharacterMovementCollision.SetHeadCollisionRadius // (Final|Native|Public) // @ game+0x18d3d60
	void SetCharacterMovementComp(struct UCrowCharacterMovement* InMovementComp); // Function CrowFPS.CrowCharacterMovementCollision.SetCharacterMovementComp // (Final|Native|Public) // @ game+0x18d3bc0
	void SetActiveHeadCollision(bool bActive); // Function CrowFPS.CrowCharacterMovementCollision.SetActiveHeadCollision // (Final|Native|Public) // @ game+0x18d3b30
	bool IsEnable(); // Function CrowFPS.CrowCharacterMovementCollision.IsEnable // (Final|Native|Public) // @ game+0x18d2660
	float GetHeadCollisionRadius(); // Function CrowFPS.CrowCharacterMovementCollision.GetHeadCollisionRadius // (Final|Native|Public) // @ game+0x18d2470
	void DrawCrowCollision(); // Function CrowFPS.CrowCharacterMovementCollision.DrawCrowCollision // (Final|Native|Public) // @ game+0x18d2300
};

// Class CrowFPS.CrowCharacterNetInfo
// Size: 0x38 (Inherited: 0x28)
struct UCrowCharacterNetInfo : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class CrowFPS.CrowCharacterPostAnimTP
// Size: 0x470 (Inherited: 0x2c0)
struct UCrowCharacterPostAnimTP : UAnimInstance {
	struct FCrowCharacterFootIKSetup FootIKSetup; // 0x2b8(0x50)
	struct FCrowCharacterProneIKSetup ProneIKSetup; // 0x308(0x54)
	struct ACrowCharacterPawn* CharacterPawn; // 0x360(0x08)
	struct UCrowCharacterMovement* Movement; // 0x368(0x08)
	struct USkeletalMeshComponent* CharacterMesh; // 0x370(0x08)
	struct FFootIKOffsets FootIKOffset; // 0x378(0x1c)
	struct FProneIKOffsets ProneIKOffset; // 0x394(0x60)
	char pad_3F8[0x8]; // 0x3f8(0x08)
	struct FRagdollIKOffsets RagdollIKOffset; // 0x400(0x60)
	enum class EStance Stance; // 0x460(0x01)
	enum class ECrowMovementMode MovementMode; // 0x461(0x01)
	bool bEnableProneIK; // 0x462(0x01)
	bool bEnableFootIK; // 0x463(0x01)
	bool bDontUsePostAnims; // 0x464(0x01)
	char pad_465[0xb]; // 0x465(0x0b)

	struct FVector TraceVerticalOffset(struct FName SocketName, struct FVector2D Range, struct FVector NoHitOffset); // Function CrowFPS.CrowCharacterPostAnimTP.TraceVerticalOffset // (Final|Native|Private|HasDefaults|BlueprintCallable) // @ game+0x18d81d0
	struct FVector InterpOffset(struct FVector InCurrent, struct FVector InTarget, float DeltaSeconds, float InterpSpeed); // Function CrowFPS.CrowCharacterPostAnimTP.InterpOffset // (Final|Native|Private|HasDefaults|BlueprintCallable) // @ game+0xae9930
	struct FVector ClampFootOffset(struct FVector Origin); // Function CrowFPS.CrowCharacterPostAnimTP.ClampFootOffset // (Final|Native|Private|HasDefaults|BlueprintCallable) // @ game+0x18d7f30
};

// Class CrowFPS.CrowCharacterSKC
// Size: 0xf50 (Inherited: 0xed0)
struct UCrowCharacterSKC : USkeletalMeshComponent {
	float ComponentTransformUpdateDelayMin; // 0xed0(0x04)
	float ComponentTransformUpdateDelayMax; // 0xed4(0x04)
	float ComponentTransformUpdateDistanceMin; // 0xed8(0x04)
	char pad_EDC[0x4]; // 0xedc(0x04)
	struct FTransform CachedWorldTransform; // 0xee0(0x30)
	struct FTransform RootBoneRelativeTransform; // 0xf10(0x30)
	float TransformUpdateDelay; // 0xf40(0x04)
	char pad_F44[0xc]; // 0xf44(0x0c)
};

// Class CrowFPS.CrowCharacterSkydivingComponent
// Size: 0xf8 (Inherited: 0xb0)
struct UCrowCharacterSkydivingComponent : UActorComponent {
	enum class ECrowSkydivingState State; // 0xb0(0x01)
	enum class ECrowSkydivingAnimState AnimState; // 0xb1(0x01)
	char pad_B2[0x6]; // 0xb2(0x06)
	struct ACrowSkydivingPawn* SkydivingPawnClass; // 0xb8(0x08)
	struct ACrowSkydivingPawn* ParachuteSkillClass; // 0xc0(0x08)
	struct ACrowSkydivingPawn* SkydivingPawn; // 0xc8(0x08)
	bool bIsReadyToSkydiving; // 0xd0(0x01)
	char ParachuteSkillCount; // 0xd1(0x01)
	char pad_D2[0x6]; // 0xd2(0x06)
	struct FTimerHandle AltitudeTimerHandle; // 0xd8(0x08)
	float ParachuteSpreadHeight; // 0xe0(0x04)
	struct FName ParachuteSkillKeyName; // 0xe4(0x08)
	bool bReadyToUseParachuteSkill; // 0xec(0x01)
	bool bUseDebugAltitude; // 0xed(0x01)
	char pad_EE[0x2]; // 0xee(0x02)
	struct ACrowCharacterPawn* CharacterPawn; // 0xf0(0x08)

	void RequestUseParachuteSkill(); // Function CrowFPS.CrowCharacterSkydivingComponent.RequestUseParachuteSkill // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x18d8180
	void RequestStartSkydiving(); // Function CrowFPS.CrowCharacterSkydivingComponent.RequestStartSkydiving // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x18d8130
	void OnInputKeyModified(); // Function CrowFPS.CrowCharacterSkydivingComponent.OnInputKeyModified // (Final|Native|Protected) // @ game+0x18d8110
	void OnAltitudeCheck(); // Function CrowFPS.CrowCharacterSkydivingComponent.OnAltitudeCheck // (Final|Native|Protected) // @ game+0x18d80f0
	void MulticastStartSkydiving(); // Function CrowFPS.CrowCharacterSkydivingComponent.MulticastStartSkydiving // (Net|NetReliableNative|Event|NetMulticast|Protected|NetValidate) // @ game+0x18d80a0
	void MulticastSetParachuteSkillCount(uint32_t InCount); // Function CrowFPS.CrowCharacterSkydivingComponent.MulticastSetParachuteSkillCount // (Net|NetReliableNative|Event|NetMulticast|Protected|NetValidate) // @ game+0x18d7fe0
};

// Class CrowFPS.CrowCharacterSubAnimBase
// Size: 0x300 (Inherited: 0x300)
struct UCrowCharacterSubAnimBase : UCrowCharacterAnimInstBase {
	bool bIsPeekLeft; // 0x2f8(0x01)
	bool bIsPeekRight; // 0x2f9(0x01)
	bool bUseMotionlessOnAim; // 0x2fa(0x01)
	bool bIsHandlingWeapon; // 0x2fb(0x01)
};

// Class CrowFPS.CrowCharacterSubAnimOnGround
// Size: 0x3b0 (Inherited: 0x300)
struct UCrowCharacterSubAnimOnGround : UCrowCharacterSubAnimBase {
	struct FCrowCharacterAimOffsetDepends AimOffsetDepends; // 0x300(0x50)
	struct FCrowCharacterMontageDepends MontagesDepends; // 0x350(0x50)
	float LerpedGaitValue; // 0x3a0(0x04)
	float SprintBlendSpeed; // 0x3a4(0x04)
	char pad_3A8[0x8]; // 0x3a8(0x08)

	void AnimNotify_OnLandAdditive(); // Function CrowFPS.CrowCharacterSubAnimOnGround.AnimNotify_OnLandAdditive // (Final|Native|Protected) // @ game+0x18d7f10
};

// Class CrowFPS.CrowCharacterSubAnimOnVehicle
// Size: 0x360 (Inherited: 0x300)
struct UCrowCharacterSubAnimOnVehicle : UCrowCharacterSubAnimBase {
	struct TMap<int32_t, struct FCrowCharacterAimOffsetVehicle> AimOffsetVehicle; // 0x300(0x50)
	enum class EVehicleSeatType SeatType; // 0x350(0x01)
	char pad_351[0x3]; // 0x351(0x03)
	int32_t SeatIndex; // 0x354(0x04)
	int32_t PrevSeatIndex; // 0x358(0x04)
	char pad_35C[0x4]; // 0x35c(0x04)
};

// Class CrowFPS.CrowCharacterSwimTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowCharacterSwimTable : UDataTable {
};

// Class CrowFPS.CrowCharacterSwimTableManager
// Size: 0x80 (Inherited: 0x28)
struct UCrowCharacterSwimTableManager : UObject {
	struct UDataTable* LoadedTable; // 0x28(0x08)
	struct TMap<struct FName, struct FCrowCharacterSwimTableRow> SwimTableMap; // 0x30(0x50)
};

// Class CrowFPS.CrowCharacterTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowCharacterTable : UDataTable {
};

// Class CrowFPS.CrowChatManager
// Size: 0x38 (Inherited: 0x28)
struct UCrowChatManager : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class CrowFPS.CrowChatMessageItem
// Size: 0x3b8 (Inherited: 0x348)
struct UCrowChatMessageItem : UCrowWidgetBase {
	struct UTextBlock* TB_ChatType; // 0x348(0x08)
	struct URichTextBlock* TB_ChatMessage; // 0x350(0x08)
	struct URichTextBlock* TB_ChatSystemMessage; // 0x358(0x08)
	struct UCrowButton* BT_WisperChat; // 0x360(0x08)
	struct UWidgetSwitcher* WS_ChatMessage; // 0x368(0x08)
	struct FCrowChatData ChatData; // 0x370(0x48)

	void OnPressBTN_NickName(); // Function CrowFPS.CrowChatMessageItem.OnPressBTN_NickName // (Final|Native|Public) // @ game+0x18dc550
};

// Class CrowFPS.CrowChatTyping
// Size: 0x3d8 (Inherited: 0x348)
struct UCrowChatTyping : UCrowWidgetBase {
	struct UEditableText* TB_InputTyping; // 0x348(0x08)
	struct UTextBlock* TB_TypingType; // 0x350(0x08)
	struct UWidgetSwitcher* WS_LanguageSwap; // 0x358(0x08)
	struct TArray<struct FCrowChatTypeText> ChatTypeTexts; // 0x360(0x10)
	enum class ECrowChatType CurrentChatType; // 0x370(0x01)
	char pad_371[0x7]; // 0x371(0x07)
	struct TArray<enum class ECrowChatType> EnableChatTypeArray; // 0x378(0x10)
	struct FCrowChatData TargetWhisperData; // 0x388(0x48)
	char pad_3D0[0x8]; // 0x3d0(0x08)

	void UpdateChatInputLang(); // Function CrowFPS.CrowChatTyping.UpdateChatInputLang // (Final|Native|Protected) // @ game+0x18dd280
	void SetChatType(struct FCrowChatTypeText _chatType); // Function CrowFPS.CrowChatTyping.SetChatType // (Final|Native|Protected) // @ game+0x18dd020
	void OnInputBoxChanged(struct FText InputText); // Function CrowFPS.CrowChatTyping.OnInputBoxChanged // (Final|Native|Protected|HasOutParms) // @ game+0x18dc480
	void NextChatType(); // Function CrowFPS.CrowChatTyping.NextChatType // (Final|Native|Protected) // @ game+0x18dbdb0
	bool IsValidChatType(enum class ECrowChatType InChatType); // Function CrowFPS.CrowChatTyping.IsValidChatType // (Final|Native|Protected) // @ game+0x18dbd20
	struct FCrowChatTypeText FindChatTypeStruct(enum class ECrowChatType _chatType); // Function CrowFPS.CrowChatTyping.FindChatTypeStruct // (Final|Native|Protected) // @ game+0x18dbb70
	bool CheckShortcutKey(struct FText InputTex); // Function CrowFPS.CrowChatTyping.CheckShortcutKey // (Final|Native|Protected|HasOutParms) // @ game+0x18db8b0
};

// Class CrowFPS.CrowChatWidget
// Size: 0x3b0 (Inherited: 0x348)
struct UCrowChatWidget : UCrowWidgetBase {
	struct UCrowChatTyping* WB_CrowChatTyping; // 0x348(0x08)
	struct UScrollBox* SCB_ChatList; // 0x350(0x08)
	struct UVerticalBox* VB_ChatList; // 0x358(0x08)
	struct UWidgetSwitcher* WS_ChatSatus; // 0x360(0x08)
	struct UCanvasPanel* CP_ToolTip; // 0x368(0x08)
	struct UCanvasPanel* CP_ChatBG; // 0x370(0x08)
	struct UCrowButton* BT_StartTyping; // 0x378(0x08)
	struct UCrowChatMessageItem* WB_CrowChatMessageItem; // 0x380(0x08)
	struct UCrowChatMessageItem* ItemChatMsgItemWidgetClass; // 0x388(0x08)
	float LastChatCheckSec; // 0x390(0x04)
	float ChatListFadeOutSecond; // 0x394(0x04)
	int32_t ChatListMAX; // 0x398(0x04)
	struct FName HoverAnim; // 0x39c(0x08)
	char pad_3A4[0xc]; // 0x3a4(0x0c)

	void SetChatStatus(enum class ECrowChatWidgetStatus _status); // Function CrowFPS.CrowChatWidget.SetChatStatus // (Final|Native|Public) // @ game+0x18dcfa0
	void OnUnHoverMessageItem(); // Function CrowFPS.CrowChatWidget.OnUnHoverMessageItem // (Final|Native|Protected) // @ game+0x18dc9b0
	void OnHoverMessageItem(); // Function CrowFPS.CrowChatWidget.OnHoverMessageItem // (Final|Native|Protected) // @ game+0x18dc460
	void OnClickMessageItem(); // Function CrowFPS.CrowChatWidget.OnClickMessageItem // (Final|Native|Protected) // @ game+0x18dbdd0
};

// Class CrowFPS.CrowCheatManager
// Size: 0x168 (Inherited: 0x78)
struct UCrowCheatManager : UCheatManager {
	struct FCrowCountingLog ActorCountingLog; // 0x78(0x50)
	struct FCrowCountingLog ComponentCountingLog; // 0xc8(0x50)
	struct FCrowCountingLog OwnerActorCountingLog; // 0x118(0x50)

	void WakeUpVehicles(); // Function CrowFPS.CrowCheatManager.WakeUpVehicles // (Final|Exec|Native|Public) // @ game+0xa996d0
	void TowVehicle(); // Function CrowFPS.CrowCheatManager.TowVehicle // (Final|Exec|Native|Public) // @ game+0xa996d0
	void SpawnVehicleMany(uint32_t Key, int32_t Count); // Function CrowFPS.CrowCheatManager.SpawnVehicleMany // (Final|Exec|Native|Public) // @ game+0x18dd1b0
	void SpawnVehicleByKey(uint32_t Key); // Function CrowFPS.CrowCheatManager.SpawnVehicleByKey // (Final|Exec|Native|Public) // @ game+0x18db660
	void SpawnVehicle(struct FString VehicleNickName); // Function CrowFPS.CrowCheatManager.SpawnVehicle // (Final|Exec|Native|Public) // @ game+0x18db6f0
	void SpawnItem(struct FString InItemType, uint32_t Key); // Function CrowFPS.CrowCheatManager.SpawnItem // (Final|Exec|Native|Public) // @ game+0x18dd0d0
	void ShowRecordLog(bool bIsShow); // Function CrowFPS.CrowCheatManager.ShowRecordLog // (Final|Exec|Native|Public) // @ game+0xc9e760
	void ShowPhysicsLog(); // Function CrowFPS.CrowCheatManager.ShowPhysicsLog // (Final|Exec|Native|Public) // @ game+0xa996d0
	void ShowObjectCounts(); // Function CrowFPS.CrowCheatManager.ShowObjectCounts // (Final|Exec|Native|Public) // @ game+0xa996d0
	void ShowComponentOwnerCounts(struct FString InComponentName); // Function CrowFPS.CrowCheatManager.ShowComponentOwnerCounts // (Final|Exec|Native|Public) // @ game+0x18db6f0
	void Revive(); // Function CrowFPS.CrowCheatManager.Revive // (Final|Exec|Native|Public) // @ game+0xa996d0
	void ResultMVPIndex(uint32_t Index); // Function CrowFPS.CrowCheatManager.ResultMVPIndex // (Final|Exec|Native|Public) // @ game+0x18db660
	void RestartGame(struct FString Param); // Function CrowFPS.CrowCheatManager.RestartGame // (Final|Exec|Native|Public) // @ game+0x18db6f0
	void RandomMoveCharacterToggle(); // Function CrowFPS.CrowCheatManager.RandomMoveCharacterToggle // (Final|Exec|Native|Public) // @ game+0xa996d0
	void OnTowVehicle(struct FString UserNickName); // Function CrowFPS.CrowCheatManager.OnTowVehicle // (Final|Exec|Native|Private) // @ game+0x18db6f0
	void OnSpawnVehicleMany(uint32_t Key, int32_t Count, struct FString UserNickName); // Function CrowFPS.CrowCheatManager.OnSpawnVehicleMany // (Final|Exec|Native|Private) // @ game+0x18dc890
	void OnSpawnVehicleByKey(uint32_t Key, struct FString UserNickName); // Function CrowFPS.CrowCheatManager.OnSpawnVehicleByKey // (Final|Exec|Native|Private) // @ game+0x18dc7b0
	void OnSpawnVehicle(struct FString VehicleNickName, struct FString UserNickName); // Function CrowFPS.CrowCheatManager.OnSpawnVehicle // (Final|Exec|Native|Private) // @ game+0x18dc6b0
	void OnSpawnItem(struct FString InItemType, uint32_t Key, struct FString UserNickName); // Function CrowFPS.CrowCheatManager.OnSpawnItem // (Final|Exec|Native|Private) // @ game+0x18dc570
	void OnLocalPlayerConsoleCommand(struct FString ConsoleCommand); // Function CrowFPS.CrowCheatManager.OnLocalPlayerConsoleCommand // (Final|Native|Private|HasOutParms) // @ game+0x10ce9e0
	void KillMe(float Time); // Function CrowFPS.CrowCheatManager.KillMe // (Final|Exec|Native|Public) // @ game+0x18dbca0
	void HitMe(float Damage); // Function CrowFPS.CrowCheatManager.HitMe // (Final|Exec|Native|Public) // @ game+0x18dbca0
	void ForcedUnlockWeapons(int32_t Level); // Function CrowFPS.CrowCheatManager.ForcedUnlockWeapons // (Final|Exec|Native|Public) // @ game+0x18dbc10
	void DisconnectDediServer(); // Function CrowFPS.CrowCheatManager.DisconnectDediServer // (Final|Exec|Native|Public) // @ game+0xa996d0
	void CrowCS(struct FString ConsoleCommand); // Function CrowFPS.CrowCheatManager.CrowCS // (Final|Exec|Native|Public) // @ game+0x18db6f0
	void Crow(struct FString ConsoleCommand); // Function CrowFPS.CrowCheatManager.Crow // (Final|Exec|Native|Public) // @ game+0x18db6f0
	void ConquestSkyRespawn(); // Function CrowFPS.CrowCheatManager.ConquestSkyRespawn // (Final|Exec|Native|Public) // @ game+0x18dba80
	void ClearPhysicsCollisions(); // Function CrowFPS.CrowCheatManager.ClearPhysicsCollisions // (Final|Exec|Native|Public) // @ game+0xa996d0
	void ClearObjectCountCache(); // Function CrowFPS.CrowCheatManager.ClearObjectCountCache // (Final|Exec|Native|Public) // @ game+0x18dba60
	void CharacterAimToggle(); // Function CrowFPS.CrowCheatManager.CharacterAimToggle // (Final|Exec|Native|Public) // @ game+0xa996d0
	void ChangeZombie(); // Function CrowFPS.CrowCheatManager.ChangeZombie // (Final|Exec|Native|Public) // @ game+0xa996d0
	void ChangeAudioCulture(struct FString InCulture); // Function CrowFPS.CrowCheatManager.ChangeAudioCulture // (Final|Exec|Native|Public) // @ game+0x18db6f0
	void AddSquadPoint(uint32_t AddSquadPoint); // Function CrowFPS.CrowCheatManager.AddSquadPoint // (Final|Exec|Native|Public) // @ game+0x18db660
	void AddBattleMoney(uint32_t InAddCount); // Function CrowFPS.CrowCheatManager.AddBattleMoney // (Final|Exec|Native|Public) // @ game+0x18db660
};

// Class CrowFPS.CrowCheckReplicationBase
// Size: 0xc8 (Inherited: 0xb0)
struct UCrowCheckReplicationBase : UActorComponent {
	char pad_B0[0x18]; // 0xb0(0x18)
};

// Class CrowFPS.CrowCheckReplicationCharacter
// Size: 0xc8 (Inherited: 0xc8)
struct UCrowCheckReplicationCharacter : UCrowCheckReplicationBase {
};

// Class CrowFPS.CrowCheckReplicationPS
// Size: 0xc8 (Inherited: 0xc8)
struct UCrowCheckReplicationPS : UCrowCheckReplicationBase {
};

// Class CrowFPS.CrowClanEmblemWidget
// Size: 0x390 (Inherited: 0x348)
struct UCrowClanEmblemWidget : UCrowWidgetBase {
	char pad_348[0x10]; // 0x348(0x10)
	int32_t EmblemIndex; // 0x358(0x04)
	int32_t BGIndex; // 0x35c(0x04)
	struct UImage* IMG_ClanEmblem_Bg; // 0x360(0x08)
	struct UImage* IMG_ClanEmblem_Mark; // 0x368(0x08)
	struct UImage* IMG_Select; // 0x370(0x08)
	struct UCrowButton* BT_Select; // 0x378(0x08)
	struct UCanvasPanel* CP_Cost; // 0x380(0x08)
	struct UTextBlock* TB_Label_Money; // 0x388(0x08)

	void OnClickSelection(); // Function CrowFPS.CrowClanEmblemWidget.OnClickSelection // (Final|Native|Public) // @ game+0x18dbdf0
};

// Class CrowFPS.CrowClanExpTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowClanExpTable : UDataTable {
};

// Class CrowFPS.CrowClanExpTableManager
// Size: 0x78 (Inherited: 0x28)
struct UCrowClanExpTableManager : UObject {
	struct TMap<int32_t, struct FCrowClanExpTableRow> ClanExpData; // 0x28(0x50)
};

// Class CrowFPS.CrowHappyTimeTabWidget
// Size: 0x388 (Inherited: 0x348)
struct UCrowHappyTimeTabWidget : UCrowWidgetBase {
	struct UCrowButton* BT_Arrow_HourL; // 0x348(0x08)
	struct UCrowButton* BT_Arrow_HourR; // 0x350(0x08)
	struct UCrowButton* BT_Arrow_MinuteL; // 0x358(0x08)
	struct UCrowButton* BT_Arrow_MinuteR; // 0x360(0x08)
	struct UTextBlock* TB_HourText; // 0x368(0x08)
	struct UTextBlock* TB_MinuteText; // 0x370(0x08)
	struct UCrowButton* WB_BT_OK; // 0x378(0x08)
	char pad_380[0x8]; // 0x380(0x08)

	void SendApplyHappyTimeChange(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowHappyTimeTabWidget.SendApplyHappyTimeChange // (Final|Native|Public) // @ game+0x18dcb20
	void OnClicked_MinuteRight(); // Function CrowFPS.CrowHappyTimeTabWidget.OnClicked_MinuteRight // (Final|Native|Public) // @ game+0x18dc2a0
	void OnClicked_MinuteLeft(); // Function CrowFPS.CrowHappyTimeTabWidget.OnClicked_MinuteLeft // (Final|Native|Public) // @ game+0x18dc280
	void OnClicked_HourRight(); // Function CrowFPS.CrowHappyTimeTabWidget.OnClicked_HourRight // (Final|Native|Public) // @ game+0x18dc1e0
	void OnClicked_HourLeft(); // Function CrowFPS.CrowHappyTimeTabWidget.OnClicked_HourLeft // (Final|Native|Public) // @ game+0x18dc1c0
	void OnClicked_ApplyHappyTime(); // Function CrowFPS.CrowHappyTimeTabWidget.OnClicked_ApplyHappyTime // (Final|Native|Public) // @ game+0x18dbe10
};

// Class CrowFPS.CrowClanListSlotWidget
// Size: 0x418 (Inherited: 0x348)
struct UCrowClanListSlotWidget : UCrowWidgetBase {
	char pad_348[0x10]; // 0x348(0x10)
	struct UCrowClanEmblemWidget* WB_Info_ClanEmblem; // 0x358(0x08)
	struct UWidgetSwitcher* WS_Slot_ClanList; // 0x360(0x08)
	struct UWidgetSwitcher* WS_JoinState; // 0x368(0x08)
	struct UWidgetSwitcher* WS_ClanListSubType; // 0x370(0x08)
	struct UCrowButton* WB_BT_JoinAccept; // 0x378(0x08)
	struct UCrowButton* WB_BT_JoinAdmiss; // 0x380(0x08)
	struct UTextBlock* TB_Join_ClanLevel; // 0x388(0x08)
	struct UTextBlock* TB_Join_ClanName; // 0x390(0x08)
	struct UTextBlock* TB_ContributionPoint; // 0x398(0x08)
	struct UTextBlock* TB_Join_ClanMemberCurrent; // 0x3a0(0x08)
	struct UTextBlock* TB_Join_ClanMemberMax; // 0x3a8(0x08)
	struct UCrowButton* WB_BT_ReceptionAccept; // 0x3b0(0x08)
	struct UCrowButton* WB_BT_ReceptionAdmiss; // 0x3b8(0x08)
	struct UCrowButton* WB_BT_Cancel; // 0x3c0(0x08)
	struct UTextBlock* TB_Reception_ClanLevel; // 0x3c8(0x08)
	struct UTextBlock* TB_Reception_ClanName; // 0x3d0(0x08)
	struct UTextBlock* TB_Sent_ClanLevel; // 0x3d8(0x08)
	struct UTextBlock* TB_Sent_ClanName; // 0x3e0(0x08)
	struct UTextBlock* TB_RankNum; // 0x3e8(0x08)
	struct UTextBlock* TB_Rank_ClanLevel; // 0x3f0(0x08)
	struct UTextBlock* TB_Ranking_ClanName; // 0x3f8(0x08)
	struct UTextBlock* TB_Rank_ContributionPoint; // 0x400(0x08)
	struct UCrowClanEmblemWidget* WB_Rank_ClanEmblem; // 0x408(0x08)
	struct UWidgetSwitcher* WS_OddSwitcher; // 0x410(0x08)

	void OnClicked_ReceptionAdmiss(); // Function CrowFPS.CrowClanListSlotWidget.OnClicked_ReceptionAdmiss // (Final|Native|Protected) // @ game+0x18dc2e0
	void OnClicked_ReceptionAccept(); // Function CrowFPS.CrowClanListSlotWidget.OnClicked_ReceptionAccept // (Final|Native|Protected) // @ game+0x18dc2c0
	void OnClicked_JoinAdmiss(); // Function CrowFPS.CrowClanListSlotWidget.OnClicked_JoinAdmiss // (Final|Native|Protected) // @ game+0x18dc240
	void OnClicked_JoinAccept(); // Function CrowFPS.CrowClanListSlotWidget.OnClicked_JoinAccept // (Final|Native|Protected) // @ game+0x18dc220
	void OnClicked_CancelJoinClan(); // Function CrowFPS.CrowClanListSlotWidget.OnClicked_CancelJoinClan // (Final|Native|Protected) // @ game+0x18dbe90
};

// Class CrowFPS.CrowClanMainWidget
// Size: 0x6c0 (Inherited: 0x348)
struct UCrowClanMainWidget : UCrowWidgetBase {
	struct UUserWidget* ClanListItemClass; // 0x348(0x08)
	struct UUserWidget* UserListItemClass; // 0x350(0x08)
	struct UUserWidget* EmblemWidgetClass; // 0x358(0x08)
	struct UWidgetSwitcher* WS_Clan; // 0x360(0x08)
	struct UCrowButton* WB_BT_EscBack; // 0x368(0x08)
	char pad_370[0x28]; // 0x370(0x28)
	struct UCrowClanTabWidget* WB_ClanTab_Defualt; // 0x398(0x08)
	struct UCrowClanSubTabWidget* WB_ClanTab_Ranking; // 0x3a0(0x08)
	struct UWidgetSwitcher* WS_Clan_Defualt; // 0x3a8(0x08)
	struct UScrollBox* SCB_RecommendClanList; // 0x3b0(0x08)
	struct UScrollBox* SCB_InviteClanList; // 0x3b8(0x08)
	struct UCrowButton* BT_ClanSearch; // 0x3c0(0x08)
	struct UMultiLineEditableText* EDB_SearchClanName; // 0x3c8(0x08)
	struct UVerticalBox* VB_SearchResultClan; // 0x3d0(0x08)
	struct UTextBlock* TB_NoClanInvite; // 0x3d8(0x08)
	struct UCrowSpinSelectionWidget* WB_Clan_SlotSelection; // 0x3e0(0x08)
	struct UMultiLineEditableText* EDB_CreateClanName; // 0x3e8(0x08)
	struct UCrowButton* WB_BT_CreationClan; // 0x3f0(0x08)
	struct UCrowButton* WB_BT_ResetEmblemMark; // 0x3f8(0x08)
	struct UCrowButton* WB_BT_ResetEmblemBG; // 0x400(0x08)
	struct UCrowClanEmblemWidget* WB_ClanCreate_EmblemWidget; // 0x408(0x08)
	struct UImage* IMG_ClanCreateEmblem_Mark; // 0x410(0x08)
	struct UImage* IMG_ClanCreateEmblem_Bg; // 0x418(0x08)
	struct UGridPanel* GD_EmbleItemList; // 0x420(0x08)
	struct UCrowCategorySlotSmallWidget* BT_ClanEmblem_Mark; // 0x428(0x08)
	struct UCrowCategorySlotSmallWidget* BT_ClanEmblem_Bg; // 0x430(0x08)
	struct UCanvasPanel* CP_Clan_InfoSetting_L; // 0x438(0x08)
	struct UCanvasPanel* CP_Clan_InfoSetting_R; // 0x440(0x08)
	struct UCanvasPanel* CP_Clan_Info; // 0x448(0x08)
	struct UCanvasPanel* CP_ClanDismantleInfo; // 0x450(0x08)
	struct UCrowButton* WB_BT_ClanSetting; // 0x458(0x08)
	struct UCrowButton* WB_BT_ClanNotice; // 0x460(0x08)
	struct UScrollBox* SB_ClanMember; // 0x468(0x08)
	struct UCrowClanEmblemWidget* WB_ClanEmblem; // 0x470(0x08)
	struct UTextBlock* TB_ClanInfo_ClanName; // 0x478(0x08)
	struct UTextBlock* TB_ClanInfo_ClanLevel; // 0x480(0x08)
	struct UTextBlock* TB_ClanInfo_ClanRanking; // 0x488(0x08)
	struct UTextBlock* TB_ClanInfo_TotalPoint; // 0x490(0x08)
	struct UTextBlock* TB_ClanInfo_MonthPoint; // 0x498(0x08)
	struct URichTextBlock* RT_ClanInfo_NoticeText; // 0x4a0(0x08)
	struct UTextBlock* TB_ClanOnlineUser; // 0x4a8(0x08)
	struct UTextBlock* TB_ClanMaxUser; // 0x4b0(0x08)
	struct UTextBlock* TB_ClanInfoHappyTime; // 0x4b8(0x08)
	struct UTextBlock* TB_HappyTimeTipText; // 0x4c0(0x08)
	struct UTextBlock* TB_ClanInfo_DismantleTimer; // 0x4c8(0x08)
	struct UCrowClanNoticeWidget* WB_Clan_PopupClanNotice; // 0x4d0(0x08)
	struct UCanvasPanel* CP_Clan_Setting; // 0x4d8(0x08)
	struct UCanvasPanel* CP_HappyTime; // 0x4e0(0x08)
	struct UCanvasPanel* CP_ClanUserList; // 0x4e8(0x08)
	struct UCanvasPanel* CP_ClanInvitedSetting; // 0x4f0(0x08)
	struct UCanvasPanel* CP_ClanInvited; // 0x4f8(0x08)
	struct UCanvasPanel* CP_ClanDismantle; // 0x500(0x08)
	struct UCrowHappyTimeTabWidget* WB_Clan_PopupHappyTime; // 0x508(0x08)
	struct UBorder* BD_HappyTime; // 0x510(0x08)
	struct UBorder* BD_MemberSetting; // 0x518(0x08)
	struct UBorder* BD_OwnerSetting; // 0x520(0x08)
	struct UCrowCategorySlotSmallWidget* BT_HappytimeSet; // 0x528(0x08)
	struct UCrowCategorySlotSmallWidget* BT_AddCommander; // 0x530(0x08)
	struct UCrowCategorySlotSmallWidget* BT_CommanderSetDel; // 0x538(0x08)
	struct UCrowCategorySlotSmallWidget* BT_ClanInvited; // 0x540(0x08)
	struct UCrowCategorySlotSmallWidget* BT_KickClanUser; // 0x548(0x08)
	struct UCrowCategorySlotSmallWidget* BT_ClanInvitedSet; // 0x550(0x08)
	struct UCrowCategorySlotSmallWidget* BT_CaptainTransfer; // 0x558(0x08)
	struct UCrowCategorySlotSmallWidget* BT_Dismantle; // 0x560(0x08)
	struct UCrowCategorySlotSmallWidget* BT_ClanSecession; // 0x568(0x08)
	struct TArray<struct UCrowCategorySlotSmallWidget*> ClanSettingBtnList; // 0x570(0x10)
	struct UCrowButton* WB_BT_degrade; // 0x580(0x08)
	struct UCrowButton* WB_BT_Expulsion; // 0x588(0x08)
	struct UCrowButton* WB_BT_Transferring; // 0x590(0x08)
	struct UCrowButton* WB_BT_Appointment; // 0x598(0x08)
	struct UTextBlock* TB_ClanDismantleTimer; // 0x5a0(0x08)
	struct UWidgetSwitcher* WS_Dismantle; // 0x5a8(0x08)
	struct UCrowButton* WB_BT_Dismantle; // 0x5b0(0x08)
	struct UCrowButton* WB_BT_DeleteClan; // 0x5b8(0x08)
	struct UCrowButton* WB_BT_CancelDismantle; // 0x5c0(0x08)
	struct UCrowSpinSelectionWidget* WB_Clan_InviteSetting; // 0x5c8(0x08)
	struct UCrowButton* WB_BT_SaveInviteSetting; // 0x5d0(0x08)
	struct UScrollBox* SB_JoinRequestList; // 0x5d8(0x08)
	struct UTextBlock* JoinRequest_Empty; // 0x5e0(0x08)
	struct UMultiLineEditableText* EB_UserSearchEditBox; // 0x5e8(0x08)
	struct UCrowButton* BT_UserSearch; // 0x5f0(0x08)
	struct UScrollBox* SB_SearchUser; // 0x5f8(0x08)
	struct UScrollBox* SB_InviteUser; // 0x600(0x08)
	struct UTextBlock* InviteRequest_Empty; // 0x608(0x08)
	struct UCanvasPanel* CP_ClanRankingInfo; // 0x610(0x08)
	struct UWidgetSwitcher* WS_ClanRanking; // 0x618(0x08)
	struct UScrollBox* SCB_TotalScoreRankingList; // 0x620(0x08)
	struct UScrollBox* SCB_MonthScoreList; // 0x628(0x08)
	struct UScrollBox* SCB_MyClanRanking; // 0x630(0x08)
	struct UCanvasPanel* CP_ClanEmblemSetting; // 0x638(0x08)
	struct UCanvasPanel* CP_ClanEmblemSetPage; // 0x640(0x08)
	struct UHorizontalBox* HB_CustomizeClan_Shop_Button; // 0x648(0x08)
	struct UCrowClanSubTabWidget* WB_ClanTab_Emblem; // 0x650(0x08)
	struct UCrowCategorySlotSmallWidget* BT_ClanEmblemChange_Mark; // 0x658(0x08)
	struct UCrowCategorySlotSmallWidget* BT_ClanEmblemChange_Bg; // 0x660(0x08)
	struct UCrowButton* WB_BT_ChangeResetEmblemMark; // 0x668(0x08)
	struct UCrowButton* WB_BT_ChangeResetEmblemBG; // 0x670(0x08)
	struct UCrowButton* BT_Buy; // 0x678(0x08)
	struct UCrowButton* BT_AddShoppingBag; // 0x680(0x08)
	struct UImage* IMG_ChangeClanEmblemMark; // 0x688(0x08)
	struct UImage* IMG_ChangeClanEmblemBG; // 0x690(0x08)
	struct UCrowButton* WB_BT_ChangeEmblemSave; // 0x698(0x08)
	struct UCrowClanEmblemWidget* WB_Change_EmblemWidget; // 0x6a0(0x08)
	struct UGridPanel* GD_ChangeEmbleItemList; // 0x6a8(0x08)
	struct UCrowShopPurchasePopup* WB_Shop_Popup_ExclusivePurchase; // 0x6b0(0x08)
	struct UCrowShoppingBagWidget* WB_Shop_Popup_ExclusivePurchase_Quick; // 0x6b8(0x08)

	void SendLeaveClan(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowClanMainWidget.SendLeaveClan // (Final|Native|Public) // @ game+0x18dcf20
	void SendKickUser(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowClanMainWidget.SendKickUser // (Final|Native|Public) // @ game+0x18dcea0
	void SendInviteSettingChange(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowClanMainWidget.SendInviteSettingChange // (Final|Native|Public) // @ game+0x18dce20
	void SendDismantleClan(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowClanMainWidget.SendDismantleClan // (Final|Native|Public) // @ game+0x18dcda0
	void SendDeleteClan(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowClanMainWidget.SendDeleteClan // (Final|Native|Public) // @ game+0x18dcd20
	void SendDegrade(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowClanMainWidget.SendDegrade // (Final|Native|Public) // @ game+0x18dcca0
	void SendClanMasterChange(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowClanMainWidget.SendClanMasterChange // (Final|Native|Public) // @ game+0x18dcc20
	void SendCancelDismantle(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowClanMainWidget.SendCancelDismantle // (Final|Native|Public) // @ game+0x18dcba0
	void SendAddCommander(enum class ECrowMBButtonType ButtonType); // Function CrowFPS.CrowClanMainWidget.SendAddCommander // (Final|Native|Public) // @ game+0x18dcaa0
	void SelectShopEmblem(int32_t InEmblemIndex, int32_t InEmblemBGIndex); // Function CrowFPS.CrowClanMainWidget.SelectShopEmblem // (Final|Native|Public) // @ game+0x18dc9d0
	void OnClicked_SelectEmblemMark(struct UCrowCategorySlotSmallWidget* SelectButton); // Function CrowFPS.CrowClanMainWidget.OnClicked_SelectEmblemMark // (Final|Native|Public) // @ game+0x18dc3d0
	void OnClicked_SelectEmblemBG(struct UCrowCategorySlotSmallWidget* SelectButton); // Function CrowFPS.CrowClanMainWidget.OnClicked_SelectEmblemBG // (Final|Native|Public) // @ game+0x18dc340
	void OnClicked_SearchClan(); // Function CrowFPS.CrowClanMainWidget.OnClicked_SearchClan // (Final|Native|Public) // @ game+0x18dc320
	void OnClicked_SaveEmblem(); // Function CrowFPS.CrowClanMainWidget.OnClicked_SaveEmblem // (Final|Native|Public) // @ game+0x18dc300
	void OnClicked_KickUser(); // Function CrowFPS.CrowClanMainWidget.OnClicked_KickUser // (Final|Native|Public) // @ game+0x18dc260
	void OnClicked_InviteSettingChange(); // Function CrowFPS.CrowClanMainWidget.OnClicked_InviteSettingChange // (Final|Native|Public) // @ game+0x18dc200
	void OnClicked_Degrade(); // Function CrowFPS.CrowClanMainWidget.OnClicked_Degrade // (Final|Native|Public) // @ game+0x18dc1a0
	void OnClicked_CreateClan(); // Function CrowFPS.CrowClanMainWidget.OnClicked_CreateClan // (Final|Native|Public) // @ game+0x18dc180
	void OnClicked_ClanSettingMenu(struct UCrowCategorySlotSmallWidget* SelectButton); // Function CrowFPS.CrowClanMainWidget.OnClicked_ClanSettingMenu // (Final|Native|Public) // @ game+0x18dc0f0
	void OnClicked_ClanSetting(); // Function CrowFPS.CrowClanMainWidget.OnClicked_ClanSetting // (Final|Native|Public) // @ game+0x18dc0d0
	void OnClicked_ClanNotice(); // Function CrowFPS.CrowClanMainWidget.OnClicked_ClanNotice // (Final|Native|Public) // @ game+0x18dc0b0
	void OnClicked_ClanMasterChange(); // Function CrowFPS.CrowClanMainWidget.OnClicked_ClanMasterChange // (Final|Native|Public) // @ game+0x18dc090
	void OnClicked_ClanInviteSearchUser(); // Function CrowFPS.CrowClanMainWidget.OnClicked_ClanInviteSearchUser // (Final|Native|Public) // @ game+0x18dc070
	void OnClicked_ClanDismantle(); // Function CrowFPS.CrowClanMainWidget.OnClicked_ClanDismantle // (Final|Native|Public) // @ game+0x18dc050
	void OnClicked_ClanDelete(); // Function CrowFPS.CrowClanMainWidget.OnClicked_ClanDelete // (Final|Native|Public) // @ game+0x18dc030
	void OnClicked_ClanAddCommander(); // Function CrowFPS.CrowClanMainWidget.OnClicked_ClanAddCommander // (Final|Native|Public) // @ game+0x18dc010
	void OnClicked_ChangeSelectEmblemMark(struct UCrowCategorySlotSmallWidget* SelectButton); // Function CrowFPS.CrowClanMainWidget.OnClicked_ChangeSelectEmblemMark // (Final|Native|Public) // @ game+0x18dbf80
	void OnClicked_ChangeSelectEmblemBG(struct UCrowCategorySlotSmallWidget* SelectButton); // Function CrowFPS.CrowClanMainWidget.OnClicked_ChangeSelectEmblemBG // (Final|Native|Public) // @ game+0x18dbef0
	void OnClicked_ChangeResetEmblemMark(); // Function CrowFPS.CrowClanMainWidget.OnClicked_ChangeResetEmblemMark // (Final|Native|Public) // @ game+0x18dbed0
	void OnClicked_ChangeResetEmblemBG(); // Function CrowFPS.CrowClanMainWidget.OnClicked_ChangeResetEmblemBG // (Final|Native|Public) // @ game+0x18dbeb0
	void OnClicked_CancelDismantle(); // Function CrowFPS.CrowClanMainWidget.OnClicked_CancelDismantle // (Final|Native|Public) // @ game+0x18dbe70
	void OnClicked_BT_Buy(); // Function CrowFPS.CrowClanMainWidget.OnClicked_BT_Buy // (Final|Native|Public) // @ game+0x18dbe50
	void OnClicked_BT_AddShoppingBag(); // Function CrowFPS.CrowClanMainWidget.OnClicked_BT_AddShoppingBag // (Final|Native|Public) // @ game+0x18dbe30
	void CreateClanFromSelectEmblem(int32_t InEmblemIndex, int32_t InEmblemBGIndex); // Function CrowFPS.CrowClanMainWidget.CreateClanFromSelectEmblem // (Final|Native|Public) // @ game+0x18dbaa0
	void ClanInfoFromSelectEmblem(int32_t InEmblemIndex, int32_t InEmblemBGIndex); // Function CrowFPS.CrowClanMainWidget.ClanInfoFromSelectEmblem // (Final|Native|Public) // @ game+0x18db990
	void ChangeSelectTab(int32_t InSelect); // Function CrowFPS.CrowClanMainWidget.ChangeSelectTab // (Final|Native|Public) // @ game+0x18db820
	void ChangeSelectSubTab(int32_t InSelect); // Function CrowFPS.CrowClanMainWidget.ChangeSelectSubTab // (Final|Native|Public) // @ game+0x18db790
};

// Class CrowFPS.CrowClanManager
// Size: 0x198 (Inherited: 0x28)
struct UCrowClanManager : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TArray<struct FClanListItem> JoinClanList; // 0x38(0x10)
	struct TArray<struct FClanListItem> InviteClanList; // 0x48(0x10)
	struct TArray<struct FClanListItem> RecommandClanList; // 0x58(0x10)
	struct TArray<struct FClanListItem> RankingTotalClanList; // 0x68(0x10)
	struct TArray<struct FClanListItem> RankingMonthClanList; // 0x78(0x10)
	struct FClanListItem SearchClanInfo; // 0x88(0x40)
	struct FSearchUserInfo SearchUserInfo; // 0xc8(0x28)
	struct TArray<struct FSearchUserInfo> InviteUserList; // 0xf0(0x10)
	struct TArray<struct FSearchUserInfo> RequestUserList; // 0x100(0x10)
	struct FClanInfo MyClanInfo; // 0x110(0x78)
	struct TArray<uint32_t> UnlockClanMark; // 0x188(0x10)
};

// Class CrowFPS.CrowClanMarkTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowClanMarkTable : UDataTable {
};

// Class CrowFPS.CrowClanNoticeWidget
// Size: 0x360 (Inherited: 0x348)
struct UCrowClanNoticeWidget : UCrowWidgetBase {
	struct UEditableText* ETB_NoticeInput; // 0x348(0x08)
	struct UCrowButton* BT_Confirm; // 0x350(0x08)
	struct UCrowButton* BT_Cancel; // 0x358(0x08)

	void OnClickCancelNotice(); // Function CrowFPS.CrowClanNoticeWidget.OnClickCancelNotice // (Final|Native|Public) // @ game+0x18c8830
	void OnClickApplyNotice(); // Function CrowFPS.CrowClanNoticeWidget.OnClickApplyNotice // (Final|Native|Public) // @ game+0x18e05a0
};

// Class CrowFPS.CrowClanSubTabWidget
// Size: 0x368 (Inherited: 0x348)
struct UCrowClanSubTabWidget : UCrowWidgetBase {
	struct UCrowWidgetToggleButton* WB_RankingTotal; // 0x348(0x08)
	struct UCrowWidgetToggleButton* WB_RankingMonth; // 0x350(0x08)
	struct UCrowWidgetToggleButton* WB_EmblemSet; // 0x358(0x08)
	struct UCrowWidgetToggleButton* WB_ClanShop; // 0x360(0x08)
};

// Class CrowFPS.CrowClanTabWidget
// Size: 0x388 (Inherited: 0x348)
struct UCrowClanTabWidget : UCrowWidgetBase {
	char pad_348[0x8]; // 0x348(0x08)
	struct UWidgetSwitcher* WS_ClanTabMenu; // 0x350(0x08)
	struct UCrowWidgetToggleButton* WB_LobbyButton_Recommend; // 0x358(0x08)
	struct UCrowWidgetToggleButton* WB_LobbyButton_Creation; // 0x360(0x08)
	struct UCrowWidgetToggleButton* WB_LobbyButton_ClanRanking; // 0x368(0x08)
	struct UCrowWidgetToggleButton* WB_LobbyButton_ClanInfo; // 0x370(0x08)
	struct UCrowWidgetToggleButton* WB_LobbyButton_ClanEmblem; // 0x378(0x08)
	struct UCrowWidgetToggleButton* WB_LobbyButton_ClanRanking_2; // 0x380(0x08)
};

// Class CrowFPS.CrowClanUserSlotWidget
// Size: 0x430 (Inherited: 0x348)
struct UCrowClanUserSlotWidget : UCrowWidgetBase {
	struct UCrowButton* BT_Slot_ClanUserList; // 0x348(0x08)
	struct UWidgetSwitcher* WS_Slot_UserList; // 0x350(0x08)
	struct UImage* IMG_Selected; // 0x358(0x08)
	struct UWidgetSwitcher* WS_UserMark; // 0x360(0x08)
	struct UImage* IMG_UserMark; // 0x368(0x08)
	struct UImage* IMG_UserList_ClassMark; // 0x370(0x08)
	struct UTextBlock* TB_UserList_Level; // 0x378(0x08)
	struct UTextBlock* TB_UserList_Name; // 0x380(0x08)
	struct UWidgetSwitcher* WS_OddSwitcher; // 0x388(0x08)
	struct UWidgetSwitcher* WS_Online_Offline; // 0x390(0x08)
	struct UTextBlock* TB_UserList_ClanPoint; // 0x398(0x08)
	struct UTextBlock* TB_UserList_LastPlayTime; // 0x3a0(0x08)
	struct UCanvasPanel* CP_Offline; // 0x3a8(0x08)
	struct UCrowButton* WB_BT_Invited; // 0x3b0(0x08)
	struct UImage* IMG_UserInvite_ClassMark; // 0x3b8(0x08)
	struct UTextBlock* TB_UserInvite_Level; // 0x3c0(0x08)
	struct UTextBlock* TB_UserInvite_Name; // 0x3c8(0x08)
	struct UCrowButton* WB_BT_Cancel; // 0x3d0(0x08)
	struct UImage* IMG_UserCancel_ClassMark; // 0x3d8(0x08)
	struct UTextBlock* TB_UserCancel_Level; // 0x3e0(0x08)
	struct UTextBlock* TB_UserCancel_Name; // 0x3e8(0x08)
	struct UCrowButton* WB_BT_JoinSetOK; // 0x3f0(0x08)
	struct UCrowButton* WB_BT_JoinSetCancel; // 0x3f8(0x08)
	struct UImage* IMG_UserJoinSet_ClassMark; // 0x400(0x08)
	struct UTextBlock* TB_UserJoinSet_Level; // 0x408(0x08)
	struct UTextBlock* TB_UserJoinSet_Name; // 0x410(0x08)
	char pad_418[0x18]; // 0x418(0x18)

	void OnSelectSlot(bool bSelected); // Function CrowFPS.CrowClanUserSlotWidget.OnSelectSlot // (Final|Native|Public) // @ game+0x18e06f0
	void OnClick_RequestCancel(); // Function CrowFPS.CrowClanUserSlotWidget.OnClick_RequestCancel // (Final|Native|Public) // @ game+0x18e0640
	void OnClick_JoinSetOK(); // Function CrowFPS.CrowClanUserSlotWidget.OnClick_JoinSetOK // (Final|Native|Public) // @ game+0x18e0620
	void OnClick_JoinSetCancel(); // Function CrowFPS.CrowClanUserSlotWidget.OnClick_JoinSetCancel // (Final|Native|Public) // @ game+0x18e0600
	void OnClick_Invited(); // Function CrowFPS.CrowClanUserSlotWidget.OnClick_Invited // (Final|Native|Public) // @ game+0x18e05e0
	void OnClick_ClanUserList(); // Function CrowFPS.CrowClanUserSlotWidget.OnClick_ClanUserList // (Final|Native|Public) // @ game+0x18e05c0
};

// Class CrowFPS.CrowClientManager
// Size: 0xbd0 (Inherited: 0x28)
struct UCrowClientManager : UObject {
	char pad_28[0x18]; // 0x28(0x18)
	struct ACrowGameStateBase* GameState; // 0x40(0x08)
	struct ACrowPlayerStateBase* PlayerState; // 0x48(0x08)
	struct ACrowPlayerControllerBase* PlayerController; // 0x50(0x08)
	struct ACrowCharacterPawn* Character; // 0x58(0x08)
	struct ACrowPostProcessVolume* PostProcessVolume; // 0x60(0x08)
	struct ACrowMergedSkeletalMeshCacheActor* MergedSkeletalMeshCacheActor; // 0x68(0x08)
	struct FCrowUserInfoBase UserInfo; // 0x70(0x7c8)
	struct TArray<struct UCrowWorldMapIcon*> WorldMapIconArray; // 0x838(0x10)
	struct TArray<struct UCrowIndicatorViewInfo*> IndicatorArray; // 0x848(0x10)
	struct UCrowHUDWidgetDefault* MainWidgetDefault; // 0x858(0x08)
	struct UCrowHUDWidgetFullScreenBottom* MainWidgetFullScreenBottom; // 0x860(0x08)
	struct UCrowHUDWidgetFullScreenTop* MainWidgetFullScreenTop; // 0x868(0x08)
	struct TMap<uint64_t, struct ACrowPlayerStateBase*> TeamPlayerStateMap; // 0x870(0x50)
	struct FCrowScopeEffect ScopeEffect; // 0x8c0(0x70)
	struct TArray<struct ACrowPlayerStateBase*> AddPlayerArray; // 0x930(0x10)
	struct TArray<struct ACrowPlayerStateBase*> RemovePlayerArray; // 0x940(0x10)
	struct FCrowGameModeInfo GemeModeInfo; // 0x950(0x38)
	int32_t GetExpInfo; // 0x988(0x04)
	struct FVector ViewMatrices_ViewOrigin; // 0x98c(0x0c)
	char pad_998[0x8]; // 0x998(0x08)
	struct FMatrix ViewMatrices_ProjectionMatrix; // 0x9a0(0x40)
	char pad_9E0[0x40]; // 0x9e0(0x40)
	struct TArray<struct FCrowModPointInfo> ModPointInfoArray; // 0xa20(0x10)
	struct TArray<enum class ECrowMedalType> MedalTypeArray; // 0xa30(0x10)
	struct TArray<struct FCrowLobbyNoticeInfo> LobbyNoticeInfoArray; // 0xa40(0x10)
	struct TArray<struct FCrowAdjustMapInfo> AdjustMapInfoArray; // 0xa50(0x10)
	char pad_A60[0xe8]; // 0xa60(0xe8)
	struct FCrowTeamInfo InvalidTeam; // 0xb48(0x30)
	char pad_B78[0x58]; // 0xb78(0x58)

	void TimeNoticeDelegate(); // Function CrowFPS.CrowClientManager.TimeNoticeDelegate // (Final|Native|Private) // @ game+0x18e0890
	void OnWorldMapIconDestroyed(struct AActor* DestroyedActor); // Function CrowFPS.CrowClientManager.OnWorldMapIconDestroyed // (Final|Native|Public) // @ game+0x18e0800
	void OnTimerExitWorld(enum class ECrowExitWorldType Type); // Function CrowFPS.CrowClientManager.OnTimerExitWorld // (Final|Native|Public) // @ game+0x18e0780
	void OnIndicatorDestroyed(struct AActor* DestroyedActor); // Function CrowFPS.CrowClientManager.OnIndicatorDestroyed // (Final|Native|Public) // @ game+0x18e0660
};

// Class CrowFPS.CrowClothActorComponent
// Size: 0xe0 (Inherited: 0x28)
struct UCrowClothActorComponent : UObject {
	struct TMap<enum class ECrowClothPartsMesh, struct FCrowClothItem> ClothMeshesList; // 0x28(0x50)
	struct TMap<enum class ECrowClothPartsMesh, struct USkeletalMesh*> DefaultClothMeshesList; // 0x78(0x50)
	struct AActor* OwnerActor; // 0xc8(0x08)
	struct USkeletalMeshComponent* MasterMesh; // 0xd0(0x08)
	bool bUseTestHide; // 0xd8(0x01)
	bool bUseMeshMerge; // 0xd9(0x01)
	enum class ECrowClothComponentType ComponentType; // 0xda(0x01)
	char pad_DB[0x5]; // 0xdb(0x05)
};

// Class CrowFPS.CrowClothItemDescWidget
// Size: 0x360 (Inherited: 0x348)
struct UCrowClothItemDescWidget : UCrowWidgetBase {
	struct UTextBlock* TB_ItemName; // 0x348(0x08)
	struct UTextBlock* TB_ItemDesc_01; // 0x350(0x08)
	struct UTextBlock* TB_ItemDesc_02; // 0x358(0x08)
};

// Class CrowFPS.CrowClothMeshTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowClothMeshTable : UDataTable {
};

// Class CrowFPS.CrowCloudCollisionEventHandler
// Size: 0x110 (Inherited: 0xb0)
struct UCrowCloudCollisionEventHandler : UActorComponent {
	struct UCrowCloudDamageHandler* CloudDamageHandler; // 0xb0(0x08)
	struct TMap<int32_t, struct FCrowCloudCollisionEvent> OverlapEvents; // 0xb8(0x50)
	struct AActor* OwnerActor; // 0x108(0x08)
};

// Class CrowFPS.CrowCloudDamageHandler
// Size: 0x100 (Inherited: 0xb0)
struct UCrowCloudDamageHandler : UActorComponent {
	struct TMap<int32_t, float> LastDamagedTimeData; // 0xb0(0x50)
};

// Class CrowFPS.CrowCloudDrawComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UCrowCloudDrawComponent : UActorComponent {
	struct UTextureRenderTarget2D* RenderTarget; // 0xb0(0x08)
	struct FVector2D RenderTargetSize; // 0xb8(0x08)
	float PixelSize; // 0xc0(0x04)
	float WorldSizeKM; // 0xc4(0x04)
	struct UCanvas* Canvas; // 0xc8(0x08)
	struct FDrawToRenderTargetContext DrawToRTContext; // 0xd0(0x10)

	void Initialize(); // Function CrowFPS.CrowCloudDrawComponent.Initialize // (Final|Native|Public) // @ game+0xa996d0
	void DrawEnd(); // Function CrowFPS.CrowCloudDrawComponent.DrawEnd // (Final|Native|Public) // @ game+0x18e4a90
	void DrawBegin(); // Function CrowFPS.CrowCloudDrawComponent.DrawBegin // (Final|Native|Public) // @ game+0x18e4a70
	void Draw(struct FVector InLocation, struct FVector InScale, struct UMaterialInterface* InMI); // Function CrowFPS.CrowCloudDrawComponent.Draw // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x18e4940
	void ClearRenderTarget2D(); // Function CrowFPS.CrowCloudDrawComponent.ClearRenderTarget2D // (Final|Native|Public) // @ game+0x18e42b0
	void C_Clear(); // Function CrowFPS.CrowCloudDrawComponent.C_Clear // (Final|Native|Protected) // @ game+0xa996d0
	void B_Draw(); // Function CrowFPS.CrowCloudDrawComponent.B_Draw // (Final|Native|Protected) // @ game+0xa996d0
	void A_Initialize(); // Function CrowFPS.CrowCloudDrawComponent.A_Initialize // (Final|Native|Protected) // @ game+0xa996d0
};

// Class CrowFPS.CrowCloudRenderActor
// Size: 0x2c0 (Inherited: 0x220)
struct ACrowCloudRenderActor : AActor {
	struct UCurveVector* CurveScale; // 0x220(0x08)
	struct UCurveVector* CurveLocation; // 0x228(0x08)
	struct UMaterialInterface* MaterialInstance; // 0x230(0x08)
	struct USceneComponent* SceneComp; // 0x238(0x08)
	struct UStaticMeshComponent* PreviewMesh; // 0x240(0x08)
	struct UStaticMeshComponent* PlaneMesh; // 0x248(0x08)
	struct UTextureRenderTarget2D* RenderTarget; // 0x250(0x08)
	struct FCrowCloudAnimInfo LocationAnimInfo; // 0x258(0x14)
	struct FCrowCloudAnimInfo ScaleAnimInfo; // 0x26c(0x14)
	struct FTransform TM; // 0x280(0x30)
	struct UMaterialInstanceDynamic* Mid; // 0x2b0(0x08)
	bool bRendering; // 0x2b8(0x01)
	char pad_2B9[0x7]; // 0x2b9(0x07)

	void Initialize(); // Function CrowFPS.CrowCloudRenderActor.Initialize // (Final|Native|Private) // @ game+0x18e4bd0
	void B_Stop(); // Function CrowFPS.CrowCloudRenderActor.B_Stop // (Final|Native|Protected) // @ game+0xa996d0
	void A_Start(); // Function CrowFPS.CrowCloudRenderActor.A_Start // (Final|Native|Protected) // @ game+0xa996d0
};

// Class CrowFPS.CrowCloudScapeActor
// Size: 0x270 (Inherited: 0x220)
struct ACrowCloudScapeActor : AActor {
	int32_t Index; // 0x220(0x04)
	char pad_224[0x4]; // 0x224(0x04)
	struct UStaticMeshComponent* CloudMesh; // 0x228(0x08)
	struct UStaticMeshComponent* BoundaryMesh_Inside; // 0x230(0x08)
	struct UStaticMeshComponent* BoundaryMesh_Outside; // 0x238(0x08)
	struct UStaticMeshComponent* MeshForFixArtifacts; // 0x240(0x08)
	struct UMaterialInterface* CloudMaterial; // 0x248(0x08)
	struct UCrowCloudScapeCollision* CloudCollision; // 0x250(0x08)
	struct UBillboardComponent* BillboardComp; // 0x258(0x08)
	struct UCrowCloudScapeComponent* CloudScapeComp; // 0x260(0x08)
	struct USplineComponent* CloudScapePath; // 0x268(0x08)

	struct FCrowCloudScapeSetting SerializeActorForDebug(); // Function CrowFPS.CrowCloudScapeActor.SerializeActorForDebug // (Final|Native|Public) // @ game+0x18e4f00
	void SerializeActor(struct UCrowCloudScapeDataAsset* OutDataAsset); // Function CrowFPS.CrowCloudScapeActor.SerializeActor // (Final|Native|Public) // @ game+0x18e4e70
	void DeserializeActor(struct FCrowCloudScapeSetting Setting); // Function CrowFPS.CrowCloudScapeActor.DeserializeActor // (Final|Native|Public|HasOutParms) // @ game+0x18e4700
};

// Class CrowFPS.CrowCloudScapeCollision
// Size: 0x460 (Inherited: 0x460)
struct UCrowCloudScapeCollision : USphereComponent {
};

// Class CrowFPS.CrowCloudScapeComponent
// Size: 0x240 (Inherited: 0x200)
struct UCrowCloudScapeComponent : USceneComponent {
	bool bEnvCloud; // 0x1f8(0x01)
	bool bNoCollision; // 0x1f9(0x01)
	bool bMove; // 0x1fa(0x01)
	bool bScale; // 0x1fb(0x01)
	float MaxScaleZ; // 0x1fc(0x04)
	float Density; // 0x200(0x04)
	float CloudMoveTime; // 0x204(0x04)
	float RotationRate; // 0x208(0x04)
	struct UCurveFloat* ScaleAnimCurve; // 0x210(0x08)
	struct UCurveFloat* MoveRateCurve; // 0x218(0x08)
	struct UCurveFloat* DensityCurve; // 0x220(0x08)
	struct UCurveFloat* HeightCurve; // 0x228(0x08)
	struct UCrowCloudDamage* CloudDamageSetting; // 0x230(0x08)
	char pad_23C[0x4]; // 0x23c(0x04)

	void SerializeComponent(struct FCrowCloudScapeSetting OutDataAsset); // Function CrowFPS.CrowCloudScapeComponent.SerializeComponent // (Final|Native|Public|HasOutParms) // @ game+0x18e4fb0
	void DeserializeComponent(struct FCrowCloudScapeSetting Setting); // Function CrowFPS.CrowCloudScapeComponent.DeserializeComponent // (Final|Native|Public|HasOutParms) // @ game+0x18e4810
};

// Class CrowFPS.CrowCloudDamage
// Size: 0x48 (Inherited: 0x30)
struct UCrowCloudDamage : UDataAsset {
	float DamageTime; // 0x30(0x04)
	float MinDamage; // 0x34(0x04)
	float MaxDamage; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UDamageType* DamageType; // 0x40(0x08)
};

// Class CrowFPS.CrowCloudScapeDataAsset
// Size: 0x40 (Inherited: 0x30)
struct UCrowCloudScapeDataAsset : UDataAsset {
	struct TArray<struct FCrowCloudScapeSetting> Settings; // 0x30(0x10)
};

// Class CrowFPS.CrowCloudScapeReplicationActor
// Size: 0x270 (Inherited: 0x220)
struct ACrowCloudScapeReplicationActor : AActor {
	struct FCrowVoluemetricCloudSetting VolumetricCloudSetting; // 0x220(0x08)
	struct ACrowVolumetricCloudActor* VolumetricCloudActorTemplate; // 0x228(0x08)
	struct UCrowCloudUIHandler* CloudUIHandler; // 0x230(0x08)
	struct UCrowCloudCollisionEventHandler* CollisionEventHandler; // 0x238(0x08)
	struct UCrowCloudDamageHandler* CloudDamageHandler; // 0x240(0x08)
	struct UCrowCloudUpdaterComponent* CloudUpdaterComp; // 0x248(0x08)
	float RemainReplicationTime; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct ACrowVolumetricCloudActor* VolumetricCloudActor; // 0x258(0x08)
	struct TArray<struct FCrowCloudScapeReplication> ReplicationDatas; // 0x260(0x10)

	void ServerUpdateCollision(float DeltaTime); // Function CrowFPS.CrowCloudScapeReplicationActor.ServerUpdateCollision // (Final|Native|Private) // @ game+0x18e51c0
	void ServerTick(float DeltaTime); // Function CrowFPS.CrowCloudScapeReplicationActor.ServerTick // (Final|Native|Private) // @ game+0x18e50c0
	void OnRep_Sync(); // Function CrowFPS.CrowCloudScapeReplicationActor.OnRep_Sync // (Final|Native|Protected) // @ game+0x18e4e50
	void Initialize(); // Function CrowFPS.CrowCloudScapeReplicationActor.Initialize // (Final|Native|Private) // @ game+0x18e4bf0
	void ClientUpdateCollision(float DeltaTime); // Function CrowFPS.CrowCloudScapeReplicationActor.ClientUpdateCollision // (Final|Native|Private) // @ game+0x18e4350
	void ClientTick(float DeltaTime); // Function CrowFPS.CrowCloudScapeReplicationActor.ClientTick // (Final|Native|Private) // @ game+0x18e42d0
	void ActivateEnvClouds(); // Function CrowFPS.CrowCloudScapeReplicationActor.ActivateEnvClouds // (Final|Native|Private) // @ game+0x18e3c00
	void ActivateCloudByIndex(int32_t InIndex); // Function CrowFPS.CrowCloudScapeReplicationActor.ActivateCloudByIndex // (Final|Native|Public) // @ game+0x18e3b70
	void ActivateCloudAll(); // Function CrowFPS.CrowCloudScapeReplicationActor.ActivateCloudAll // (Final|Native|Public) // @ game+0x18e3b50
};

// Class CrowFPS.CrowCloudUIHandler
// Size: 0x188 (Inherited: 0xb0)
struct UCrowCloudUIHandler : UActorComponent {
	struct FCrowGameIconDisplayInfo GameIconDisplayInfo; // 0xb0(0x88)
	struct TMap<int32_t, struct UCrowWorldMapIcon*> ContaminationAreaIcons; // 0x138(0x50)

	void TickUI(float DeltaSeconds, struct TArray<struct FCrowCloudScapeUpdateData> InUpdaterData); // Function CrowFPS.CrowCloudUIHandler.TickUI // (Final|Native|Public|HasOutParms) // @ game+0x18e54c0
	void CreateIcon(int32_t InIndex, struct FVector InLocation); // Function CrowFPS.CrowCloudUIHandler.CreateIcon // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x18e4520
};

// Class CrowFPS.CrowCloudUpdaterComponent
// Size: 0x140 (Inherited: 0xb0)
struct UCrowCloudUpdaterComponent : UActorComponent {
	bool bInitialized; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct TArray<struct FCrowCloudScapeUpdateData> ReservedRegisterData; // 0xb8(0x10)
	struct UCrowCloudScapeDataAsset* DataAsset; // 0xc8(0x08)
	struct TArray<struct FCrowCloudScapeUpdateData> CloudScapeDatas; // 0xd0(0x10)
	struct TArray<struct FCrowCloudScapeUpdateData> HasCollisionCloudDatas; // 0xe0(0x10)
	struct TMap<int32_t, int32_t> CloudScapeDataIndexMap; // 0xf0(0x50)

	void ServerTick(float DeltaTime); // Function CrowFPS.CrowCloudUpdaterComponent.ServerTick // (Final|Native|Public) // @ game+0x18e5140
	bool IsActivatedCloud(int32_t InIndex); // Function CrowFPS.CrowCloudUpdaterComponent.IsActivatedCloud // (Final|Native|Public|Const) // @ game+0x18e4d20
	struct TArray<struct FCrowCloudScapeUpdateData> GetCloudScapeDatas(); // Function CrowFPS.CrowCloudUpdaterComponent.GetCloudScapeDatas // (Final|Native|Public) // @ game+0x18e4ab0
	void ConsumeReservationDatas(); // Function CrowFPS.CrowCloudUpdaterComponent.ConsumeReservationDatas // (Final|Native|Protected) // @ game+0xa996d0
	void AnimateScale(float DeltatTime, struct FCrowCloudScapeUpdateData AnimateData); // Function CrowFPS.CrowCloudUpdaterComponent.AnimateScale // (Final|Native|Protected|HasOutParms) // @ game+0x18e4160
	void AnimateRotation(float DeltatTime, struct FCrowCloudScapeUpdateData AnimateData); // Function CrowFPS.CrowCloudUpdaterComponent.AnimateRotation // (Final|Native|Protected|HasOutParms) // @ game+0x18e4010
	void AnimateLocation(float DeltatTime, struct FCrowCloudScapeUpdateData AnimateData); // Function CrowFPS.CrowCloudUpdaterComponent.AnimateLocation // (Final|Native|Protected|HasOutParms) // @ game+0x18e3ec0
	void AnimateHeight(float DeltatTime, struct FCrowCloudScapeUpdateData AnimateData); // Function CrowFPS.CrowCloudUpdaterComponent.AnimateHeight // (Final|Native|Protected|HasOutParms) // @ game+0x18e3d70
	void AnimateDensity(float DeltatTime, struct FCrowCloudScapeUpdateData AnimateData); // Function CrowFPS.CrowCloudUpdaterComponent.AnimateDensity // (Final|Native|Protected|HasOutParms) // @ game+0x18e3c20
};

// Class CrowFPS.CrowCloudVisualizerComponent
// Size: 0x1f0 (Inherited: 0x140)
struct UCrowCloudVisualizerComponent : UCrowCloudUpdaterComponent {
	char pad_140[0x10]; // 0x140(0x10)
	struct UCrowCloudDrawComponent* CloudDrawComponent; // 0x150(0x08)
	struct UMaterialInstanceDynamic* CloudScapeMID; // 0x158(0x08)
	struct UMaterialInstanceDynamic* ReservedCloudScapeMID; // 0x160(0x08)
	struct TArray<struct FCrowCloudVisualizeMesh> VisualizeMeshes; // 0x168(0x10)
	struct TArray<struct FCrowCloudVisualizeParticle> VisualizeParticles; // 0x178(0x10)
	bool bChangeMaterial; // 0x188(0x01)
	bool bPlayerIsInside; // 0x189(0x01)
	char pad_18A[0x2]; // 0x18a(0x02)
	float TransitionWeight; // 0x18c(0x04)
	struct FVector FirstLocation; // 0x190(0x0c)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct TMap<int32_t, struct FCrowCloudScapeMaterialParamName> MaterialParamNameInfo; // 0x1a0(0x50)

	bool SyncTime(int32_t InIndex, struct FDateTime InStartUtcTime); // Function CrowFPS.CrowCloudVisualizerComponent.SyncTime // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x18e53f0
	void SetMaterialDeferred(struct UMaterialInstanceDynamic* NewMaterial); // Function CrowFPS.CrowCloudVisualizerComponent.SetMaterialDeferred // (Final|Native|Public) // @ game+0x18e5360
	void SetMaterial(struct UMaterialInstanceDynamic* NewMaterial); // Function CrowFPS.CrowCloudVisualizerComponent.SetMaterial // (Final|Native|Public) // @ game+0x18e52d0
	void SetDrawComponent(struct UCrowCloudDrawComponent* InDrawComponent); // Function CrowFPS.CrowCloudVisualizerComponent.SetDrawComponent // (Final|Native|Public) // @ game+0x18e5240
	int32_t LivePreviewTick(float DeltaTime); // Function CrowFPS.CrowCloudVisualizerComponent.LivePreviewTick // (Final|Native|Public) // @ game+0x18e4dc0
	struct UStaticMeshComponent* Internal_CreateStaticMeshComp(struct AActor* InOwnerActor, struct UStaticMesh* InStaticMesh, struct UMaterialInterface* InMaterial); // Function CrowFPS.CrowCloudVisualizerComponent.Internal_CreateStaticMeshComp // (Final|Native|Private) // @ game+0x18e4c10
	void InitParameterName(); // Function CrowFPS.CrowCloudVisualizerComponent.InitParameterName // (Final|Native|Private) // @ game+0x18e4bb0
	void DestroyMeshes(); // Function CrowFPS.CrowCloudVisualizerComponent.DestroyMeshes // (Final|Native|Private) // @ game+0x18e4920
	bool CreateParticle(struct AActor* InOwnerActor, struct UParticleSystem* InParticleSystem, struct UNiagaraSystem* InNiagaraSystem); // Function CrowFPS.CrowCloudVisualizerComponent.CreateParticle // (Final|Native|Public) // @ game+0x18e45f0
	bool CreateCloudScapeMeshes(struct AActor* InOwnerActor, struct FCrowCloudScapeSetting InputData); // Function CrowFPS.CrowCloudVisualizerComponent.CreateCloudScapeMeshes // (Final|Native|Public|HasOutParms) // @ game+0x18e43d0
};

// Class CrowFPS.CrowCollisionPreviewActor
// Size: 0x278 (Inherited: 0x220)
struct ACrowCollisionPreviewActor : AActor {
	struct USceneComponent* SceneComponent; // 0x220(0x08)
	struct UBoxComponent* BoxComponent; // 0x228(0x08)
	struct ACrowPlayerControllerBase* PlayerController; // 0x230(0x08)
	struct ACrowPlayerStateBase* PlayerState; // 0x238(0x08)
	struct ACrowCharacterPawn* CharacterPawn; // 0x240(0x08)
	struct TArray<struct UMeshComponent*> MeshCompArray; // 0x248(0x10)
	char pad_258[0x20]; // 0x258(0x20)
};

// Class CrowFPS.CrowColorTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowColorTable : UDataTable {
};

// Class CrowFPS.CrowColorTableManager
// Size: 0x78 (Inherited: 0x28)
struct UCrowColorTableManager : UObject {
	struct TMap<struct FString, struct FCrowColorTableRow> ColorData; // 0x28(0x50)
};

// Class CrowFPS.CrowCompassEnemyFireMarker
// Size: 0x388 (Inherited: 0x348)
struct UCrowCompassEnemyFireMarker : UCrowWidgetBase {
	struct UImage* IMG_EnemyCompass; // 0x348(0x08)
	struct UMaterialInstance* CompassMaterialIns; // 0x350(0x08)
	struct UMaterialInstanceDynamic* CompassMaterialInsDynamic; // 0x358(0x08)
	struct FVector TargetActorLocation; // 0x360(0x0c)
	float Offset; // 0x36c(0x04)
	struct UCrowCompassInfoWIdget* ParentWidget; // 0x370(0x08)
	struct FName TargetActorName; // 0x378(0x08)
	char pad_380[0x8]; // 0x380(0x08)
};

// Class CrowFPS.CrowCompassInfoMarker
// Size: 0x388 (Inherited: 0x348)
struct UCrowCompassInfoMarker : UCrowWidgetBase {
	struct UUserWidget* WB_Objective_Icon_Blu; // 0x348(0x08)
	struct UUserWidget* WB_Objective_Icon_Gen; // 0x350(0x08)
	struct UUserWidget* WB_Objective_Icon_Red; // 0x358(0x08)
	struct UUserWidget* WB_SquadIcon; // 0x360(0x08)
	struct UUserWidget* WB_VehicleIcon; // 0x368(0x08)
	struct UUserWidget* WB_AllyIcon; // 0x370(0x08)
	struct UUserWidget* WB_CompassInfo_Range_Direction; // 0x378(0x08)
	enum class EIndicatorType indicatorType; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)
};

// Class CrowFPS.CrowCompassInfoWIdget
// Size: 0x3a8 (Inherited: 0x348)
struct UCrowCompassInfoWIdget : UCrowWidgetBase {
	struct UMaterialInstance* CompassMaterialIns; // 0x348(0x08)
	struct UMaterialInstanceDynamic* CompassMaterialInsDynamic; // 0x350(0x08)
	struct UTextBlock* TB_CurrentAngle; // 0x358(0x08)
	struct UImage* IMG_Compass; // 0x360(0x08)
	struct UImage* IMG_EnemyFire_Left; // 0x368(0x08)
	struct UImage* IMG_EnemyFire_Right; // 0x370(0x08)
	struct URetainerBox* RetainerBox_EnemyFire; // 0x378(0x08)
	struct UOverlay* Overlay_EnemyFire; // 0x380(0x08)
	struct UUserWidget* EnemyFireMarker; // 0x388(0x08)
	struct TArray<struct UCrowCompassEnemyFireMarker*> EnemyFireMarkerArray; // 0x390(0x10)
	char pad_3A0[0x8]; // 0x3a0(0x08)
};

// Class CrowFPS.CrowComponentContainer
// Size: 0x1a8 (Inherited: 0xb0)
struct UCrowComponentContainer : UActorComponent {
	struct TMap<struct UObject*, struct UCrowBinderActorComponent*> Binders; // 0xb0(0x50)
	struct TMap<struct UObject*, struct UCrowActorComponentBase*> CrowComponents; // 0x100(0x50)
	struct TMap<uint32_t, struct UCrowObjectBase*> CrowObjects; // 0x150(0x50)
	struct AActor* OwnerActor; // 0x1a0(0x08)

	void CollectAll(struct AActor* TargetActor); // Function CrowFPS.CrowComponentContainer.CollectAll // (Final|Native|Public) // @ game+0x18e86f0
	void ClearAll(); // Function CrowFPS.CrowComponentContainer.ClearAll // (Final|Native|Public) // @ game+0x18e86d0
};

// Class CrowFPS.CrowComponentOwnerInterface
// Size: 0x28 (Inherited: 0x28)
struct UCrowComponentOwnerInterface : UInterface {

	struct UCrowComponentContainer* GetContainer(); // Function CrowFPS.CrowComponentOwnerInterface.GetContainer // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b8770
};

// Class CrowFPS.CrowCompositionC
// Size: 0x2a0 (Inherited: 0x220)
struct ACrowCompositionC : AActor {
	char pad_220[0x10]; // 0x220(0x10)
	float BuildTime; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct USkeletalMeshComponent* Body; // 0x238(0x08)
	char OwnerTeamID; // 0x240(0x01)
	bool bIsInCompositionCVolume; // 0x241(0x01)
	char pad_242[0x6]; // 0x242(0x06)
	struct UParticleSystem* FXLight; // 0x248(0x08)
	struct UParticleSystem* FXScreen; // 0x250(0x08)
	struct UParticleSystem* FXExplosion; // 0x258(0x08)
	struct UParticleSystemComponent* FXLightComponent; // 0x260(0x08)
	struct UParticleSystemComponent* FXScreenComponent; // 0x268(0x08)
	struct TArray<struct FCrowCompositionCStepInfo> StepInfos; // 0x270(0x10)
	int32_t CurrentStepInfoIndex; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
	struct ACrowGameStateBombMission* GameStateBombMission; // 0x288(0x08)
	struct UCrowTriggerComponent* TrigerComponent; // 0x290(0x08)
	bool bIsReadyToTimer; // 0x298(0x01)
	char pad_299[0x3]; // 0x299(0x03)
	float DamageRadius; // 0x29c(0x04)
};

// Class CrowFPS.CrowCompositionCAreaIcon
// Size: 0x2c0 (Inherited: 0x220)
struct ACrowCompositionCAreaIcon : AActor {
	struct FCrowGameIconDisplayInfo GameIconDisplayInfo; // 0x220(0x88)
	struct UCrowWorldMapIcon* WorldMapIcon; // 0x2a8(0x08)
	struct UCrowCompositionCAreaIconWidget* IndicatorIconWidget; // 0x2b0(0x08)
	bool bIsPlantCompositionC; // 0x2b8(0x01)
	char pad_2B9[0x7]; // 0x2b9(0x07)
};

// Class CrowFPS.CrowCompositionCAreaIconWidget
// Size: 0x3a0 (Inherited: 0x348)
struct UCrowCompositionCAreaIconWidget : UCrowWidgetBase {
	struct UCanvasPanel* CPRoot; // 0x348(0x08)
	struct UCanvasPanel* CPLocateArrow; // 0x350(0x08)
	struct UCanvasPanel* CPIcon; // 0x358(0x08)
	struct UTextBlock* TBName; // 0x360(0x08)
	struct UTextBlock* TBDistance; // 0x368(0x08)
	struct UImage* IMGBase; // 0x370(0x08)
	bool bIsPlantCompositionC; // 0x378(0x01)
	bool bIsNearPlantCompositionC; // 0x379(0x01)
	char pad_37A[0x2]; // 0x37a(0x02)
	int32_t DistanceDisplayCompositinCColorWhenPlant; // 0x37c(0x04)
	struct FLinearColor NormalColor; // 0x380(0x10)
	struct FLinearColor PlantCompositionCColor; // 0x390(0x10)
};

// Class CrowFPS.CrowCompositionCIconWidget
// Size: 0x380 (Inherited: 0x348)
struct UCrowCompositionCIconWidget : UCrowWidgetBase {
	struct UCanvasPanel* CPRoot; // 0x348(0x08)
	struct UCanvasPanel* CPLocateArrow; // 0x350(0x08)
	struct UCanvasPanel* CPIcon; // 0x358(0x08)
	struct UTextBlock* TBName; // 0x360(0x08)
	struct UTextBlock* TBDistance; // 0x368(0x08)
	struct UImage* IMGBase; // 0x370(0x08)
	int32_t DistanceDisplayCompositinCColorWhenPlant; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)
};

// Class CrowFPS.CrowCompositionCVolume
// Size: 0x260 (Inherited: 0x258)
struct ACrowCompositionCVolume : AVolume {
	struct ACrowCompositionCAreaIcon* CompositionCAreaIcon; // 0x258(0x08)

	void OnOverlapEnd(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function CrowFPS.CrowCompositionCVolume.OnOverlapEnd // (Final|Native|Protected) // @ game+0x18e8a80
	void OnOverlapBegin(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function CrowFPS.CrowCompositionCVolume.OnOverlapBegin // (Final|Native|Protected) // @ game+0x18e89b0
};

// Class CrowFPS.CrowConfigTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowConfigTable : UDataTable {
};

// Class CrowFPS.CrowTGStealthSpawner
// Size: 0x250 (Inherited: 0x220)
struct ACrowTGStealthSpawner : AActor {
	struct USplineComponent* BomberMoveSpline; // 0x220(0x08)
	struct USceneComponent* Root; // 0x228(0x08)
	struct ACrowTGStealthBomberActor* Bomber; // 0x230(0x08)
	struct ACrowTGStealthBomberActor* BomberClass; // 0x238(0x08)
	float TotalPathTimeController; // 0x240(0x04)
	char pad_244[0xc]; // 0x244(0x0c)
};

// Class CrowFPS.CrowConqeustChinookSpawner
// Size: 0x258 (Inherited: 0x250)
struct ACrowConqeustChinookSpawner : ACrowTGStealthSpawner {
	float SpawnDelay; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
};

// Class CrowFPS.CrowMissionArea
// Size: 0x2f0 (Inherited: 0x220)
struct ACrowMissionArea : AActor {
	char pad_220[0x8]; // 0x220(0x08)
	struct UBoxComponent* Root; // 0x228(0x08)
	struct USceneComponent* IconLocation; // 0x230(0x08)
	struct UStaticMeshComponent* AreaRotation; // 0x238(0x08)
	struct TArray<enum class ECrowGameMode> EnableGameModes; // 0x240(0x10)
	bool bIsEnableIndicatorPing; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	float IndicatorPingLifeTime; // 0x254(0x04)
	struct TMap<uint32_t, struct FCrowActorOverlapRef> ActorOverlapRefMap; // 0x258(0x50)
	struct TArray<struct UShapeComponent*> CollisionShapeArray; // 0x2a8(0x10)
	struct TArray<struct UCrowMissionAreaComponent*> ComponentArray; // 0x2b8(0x10)
	struct UCrowMissionAreaRespawn* RespawnComponent; // 0x2c8(0x08)
	uint32_t AreaID; // 0x2d0(0x04)
	char pad_2D4[0x1c]; // 0x2d4(0x1c)

	void OnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function CrowFPS.CrowMissionArea.OnEndOverlap // (Final|Native|Protected) // @ game+0x194e450
	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult HitResultInfo); // Function CrowFPS.CrowMissionArea.OnBeginOverlap // (Final|Native|Protected|HasOutParms) // @ game+0x194e1e0
};

// Class CrowFPS.CrowConquestArea
// Size: 0xb30 (Inherited: 0x2f0)
struct ACrowConquestArea : ACrowMissionArea {
	struct FText AreaName; // 0x2f0(0x18)
	struct FString AlphabetName; // 0x308(0x10)
	struct FString GroupKey; // 0x318(0x10)
	enum class ECrowTeam_RedBlue InitialTeam; // 0x328(0x01)
	bool bIsEnableConquest; // 0x329(0x01)
	char ResourcePointAdd; // 0x32a(0x01)
	char ResourcePointAddTime; // 0x32b(0x01)
	char ConquestPoint; // 0x32c(0x01)
	struct FCrowConquestPointInfo ConquestPointInfo; // 0x32d(0x10)
	char NeturalRecoveryPoint; // 0x33d(0x01)
	char NeturalRecoveryTimeLimit; // 0x33e(0x01)
	char ConquestRecoveryPoint; // 0x33f(0x01)
	char ConquestRecoveryTimeLimit; // 0x340(0x01)
	char pad_341[0x3]; // 0x341(0x03)
	int32_t SupplyBaseTableIndex; // 0x344(0x04)
	struct UAkAudioEvent* CaptureCompleteSound; // 0x348(0x08)
	struct UAkAudioEvent* CapturingSound; // 0x350(0x08)
	struct UAkAudioEvent* LosingSound; // 0x358(0x08)
	struct UAkAudioEvent* LostSound; // 0x360(0x08)
	struct FCrowGameIconDisplayInfo IconNeutralityNormal; // 0x368(0x88)
	struct FCrowGameIconDisplayInfo IconMyTeamNormal; // 0x3f0(0x88)
	struct FCrowGameIconDisplayInfo IconEnemyNormal; // 0x478(0x88)
	struct FCrowGameIconDisplayInfo IconNeutralityChange; // 0x500(0x88)
	struct FCrowGameIconDisplayInfo IconMyTeamChange; // 0x588(0x88)
	struct FCrowGameIconDisplayInfo IconEnemyChange; // 0x610(0x88)
	struct FCrowGameIconDisplayInfo IconNeutralityNormalDisable; // 0x698(0x88)
	struct FCrowGameIconDisplayInfo IconMyTeamNormalDisable; // 0x720(0x88)
	struct FCrowGameIconDisplayInfo IconEnemyNormalDisable; // 0x7a8(0x88)
	struct FCrowGameIconDisplayInfo IconNeutralityChangeDisable; // 0x830(0x88)
	struct FCrowGameIconDisplayInfo IconMyTeamChangeDisable; // 0x8b8(0x88)
	struct FCrowGameIconDisplayInfo IconEnemyChangeDisable; // 0x940(0x88)
	bool bIsDisplayHUD; // 0x9c8(0x01)
	char pad_9C9[0x7]; // 0x9c9(0x07)
	struct UCrowWidgetBase* HUD_IconNeutrality; // 0x9d0(0x08)
	struct UCrowWidgetBase* HUD_IconMyTeam; // 0x9d8(0x08)
	struct UCrowWidgetBase* HUD_IconEnemy; // 0x9e0(0x08)
	struct UCrowWidgetBase* HUD_IconNeutralityDisable; // 0x9e8(0x08)
	struct UCrowWidgetBase* HUD_IconMyTeamDisable; // 0x9f0(0x08)
	struct UCrowWidgetBase* HUD_IconEnemyDisable; // 0x9f8(0x08)
	struct FCrowGameIconDisplayInfo AreaMinimapIcon; // 0xa00(0x88)
	struct UCrowGaugeInterpolate* RedGaugeInterpolate; // 0xa88(0x08)
	struct UCrowGaugeInterpolate* BlueGaugeInterpolate; // 0xa90(0x08)
	struct UCrowConquestAreaGauge* IconIndicator; // 0xa98(0x08)
	struct UCrowIndicatorViewInfo* IndicatorViewInfo; // 0xaa0(0x08)
	struct TArray<struct ACrowConquestVehicleSpawnerGround*> ConquestVehicleSpawnerGroundArray; // 0xaa8(0x10)
	char pad_AB8[0x10]; // 0xab8(0x10)
	struct FCrowConquestAreaInfo ConquestAreaInfo; // 0xac8(0x20)
	struct TArray<struct UCrowConquestAreaVehicleSpawner*> VehicleSpawnerArray; // 0xae8(0x10)
	char pad_AF8[0x38]; // 0xaf8(0x38)

	void OnRep_ConquestAreaInfo(); // Function CrowFPS.CrowConquestArea.OnRep_ConquestAreaInfo // (Final|Native|Protected) // @ game+0x18e8b70
	void MultiCastEnableConqeustTeam(char TeamID, bool IsEnable); // Function CrowFPS.CrowConquestArea.MultiCastEnableConqeustTeam // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x18e88d0
	void MultiCastChangeTeam(char Team); // Function CrowFPS.CrowConquestArea.MultiCastChangeTeam // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1032910
	void MultiCastChangeGroupTeam(char Team); // Function CrowFPS.CrowConquestArea.MultiCastChangeGroupTeam // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x10327f0
	void MultiCastChangeGauge(char Red, char Blue); // Function CrowFPS.CrowConquestArea.MultiCastChangeGauge // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x18e8800
	void MultiCastChangeBattleState(enum class ECrowConquestBattleState Team); // Function CrowFPS.CrowConquestArea.MultiCastChangeBattleState // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x18e8780
};

// Class CrowFPS.CrowMissionAreaComponent
// Size: 0x210 (Inherited: 0x200)
struct UCrowMissionAreaComponent : USceneComponent {
	struct ACrowMissionArea* ParentArea; // 0x1f8(0x08)
	char pad_208[0x8]; // 0x208(0x08)
};

// Class CrowFPS.CrowConquestAreaComponent
// Size: 0x220 (Inherited: 0x210)
struct UCrowConquestAreaComponent : UCrowMissionAreaComponent {
	struct ACrowConquestArea* ParentConquestArea; // 0x210(0x08)
	char pad_218[0x8]; // 0x218(0x08)
};

// Class CrowFPS.CrowWidgetCircleGauge
// Size: 0x4a8 (Inherited: 0x378)
struct UCrowWidgetCircleGauge : UCrowPingWidgetBase {
	struct FSlateBrush BackBrush; // 0x378(0x88)
	struct FSlateBrush GaugeBrush; // 0x400(0x88)
	struct UMaterialInterface* GaugeMaterial; // 0x488(0x08)
	float Value; // 0x490(0x04)
	char pad_494[0x4]; // 0x494(0x04)
	struct UMaterialInstanceDynamic* DynamicMaterial; // 0x498(0x08)
	struct UImage* IMG_Gauge; // 0x4a0(0x08)
};

// Class CrowFPS.CrowConquestAreaGauge
// Size: 0x558 (Inherited: 0x4a8)
struct UCrowConquestAreaGauge : UCrowWidgetCircleGauge {
	struct UWidgetAnimation* AnimIdle; // 0x4a8(0x08)
	struct UWidgetAnimation* AnimHover; // 0x4b0(0x08)
	struct UWidgetAnimation* AnimClick; // 0x4b8(0x08)
	struct UWidgetAnimation* AnimDisableActive; // 0x4c0(0x08)
	struct UCanvasPanel* CP_Root; // 0x4c8(0x08)
	struct UCanvasPanel* CP_LocateArrow; // 0x4d0(0x08)
	struct UCanvasPanel* CP_AnchorRoot; // 0x4d8(0x08)
	struct UCanvasPanel* CP_Icon; // 0x4e0(0x08)
	struct UCanvasPanel* CP_Vehicle; // 0x4e8(0x08)
	struct UTextBlock* TB_Name; // 0x4f0(0x08)
	struct UTextBlock* TB_Distance; // 0x4f8(0x08)
	struct UTextBlock* TB_BaseAlphabet; // 0x500(0x08)
	struct ACrowConquestArea* TargetActor; // 0x508(0x08)
	struct TArray<struct UCrowWidgetConquestVehicleButton*> SpawnerButtonArray; // 0x510(0x10)
	struct UCrowRespawnMapWidget* RespawnMapWidget; // 0x520(0x08)
	char pad_528[0x30]; // 0x528(0x30)
};

// Class CrowFPS.CrowConquestAreaGaugeHQ
// Size: 0x588 (Inherited: 0x558)
struct UCrowConquestAreaGaugeHQ : UCrowConquestAreaGauge {
	struct UPaperSprite* RedMyTeam; // 0x558(0x08)
	struct UPaperSprite* RedEnemy; // 0x560(0x08)
	struct UPaperSprite* BlueMyTeam; // 0x568(0x08)
	struct UPaperSprite* BlueEnemy; // 0x570(0x08)
	struct UImage* IMG_Icon; // 0x578(0x08)
	char pad_580[0x8]; // 0x580(0x08)
};

// Class CrowFPS.CrowConquestAreaMinimapWidget
// Size: 0x350 (Inherited: 0x348)
struct UCrowConquestAreaMinimapWidget : UCrowWidgetBase {
	struct UImage* IMG_Area; // 0x348(0x08)
};

// Class CrowFPS.CrowConquestAreaSquadRespawn
// Size: 0xb80 (Inherited: 0xb30)
struct ACrowConquestAreaSquadRespawn : ACrowConquestArea {
	char pad_B30[0x10]; // 0xb30(0x10)
	float MaxConstructDistance; // 0xb40(0x04)
	float MaxHealth; // 0xb44(0x04)
	float CurrentHealth; // 0xb48(0x04)
	char pad_B4C[0x4]; // 0xb4c(0x04)
	struct USkeletalMeshComponent* Body; // 0xb50(0x08)
	char RespawnCount; // 0xb58(0x01)
	char RemainRespawnCount; // 0xb59(0x01)
	char pad_B5A[0x6]; // 0xb5a(0x06)
	struct FString SquadKey; // 0xb60(0x10)
	struct ACrowPlayerStateBase* OwnerPlayerState; // 0xb70(0x08)
	char pad_B78[0x8]; // 0xb78(0x08)

	void OnRepRemainRespawnCount(); // Function CrowFPS.CrowConquestAreaSquadRespawn.OnRepRemainRespawnCount // (Final|Native|Protected) // @ game+0x18e8b50
};

// Class CrowFPS.CrowConquestAreaVehicleSpawner
// Size: 0x2a0 (Inherited: 0x220)
struct UCrowConquestAreaVehicleSpawner : UCrowConquestAreaComponent {
	struct TArray<struct FString> VehicleTextIndexArray; // 0x218(0x10)
	float CoolTime; // 0x228(0x04)
	float SpawnHeight; // 0x22c(0x04)
	float ActiveTime; // 0x230(0x04)
	float ActiveGaugePercent; // 0x234(0x04)
	bool IsNeutralityCheck; // 0x238(0x01)
	int32_t NeutralityCheckTime; // 0x23c(0x04)
	float NeutralityCharacterRadius; // 0x240(0x04)
	float NeutralitySpawnerDist; // 0x244(0x04)
	float NeutralityDotDamage; // 0x248(0x04)
	struct FCrowSpecialVehicleCondition SpecialVehicleCondition; // 0x250(0x20)
	char SpawnerID; // 0x270(0x01)
	enum class ECrowConquestAreaVehicleSpawnerState State; // 0x271(0x01)
	char VehicleArrayIndex; // 0x272(0x01)
	bool Red_SpecialVehicle; // 0x273(0x01)
	bool Blue_SpecialVehicle; // 0x274(0x01)
	char pad_276[0x2a]; // 0x276(0x2a)

	void OnVehicleDestroyed(struct AActor* DestroyedActor); // Function CrowFPS.CrowConquestAreaVehicleSpawner.OnVehicleDestroyed // (Final|Native|Protected) // @ game+0x18ebb90
	void OnRep_Red_SpecialVehicle(); // Function CrowFPS.CrowConquestAreaVehicleSpawner.OnRep_Red_SpecialVehicle // (Final|Native|Protected) // @ game+0x18ebb70
	void OnRep_Blue_SpecialVehicle(); // Function CrowFPS.CrowConquestAreaVehicleSpawner.OnRep_Blue_SpecialVehicle // (Final|Native|Protected) // @ game+0x18ebaf0
	void MulticastSetState(enum class ECrowConquestAreaVehicleSpawnerState NewState, char NewIndex); // Function CrowFPS.CrowConquestAreaVehicleSpawner.MulticastSetState // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x18eba20
};

// Class CrowFPS.CrowConquestFlagActor
// Size: 0x2d8 (Inherited: 0x220)
struct ACrowConquestFlagActor : AActor {
	struct UBoxComponent* Root; // 0x220(0x08)
	float Top; // 0x228(0x04)
	float Bottom; // 0x22c(0x04)
	struct UMaterialInterface* RedTeamMaterial; // 0x230(0x08)
	struct UMaterialInterface* BlueTeamMaterial; // 0x238(0x08)
	struct UMaterialInterface* NoTeamMaterial; // 0x240(0x08)
	struct UAnimMontage* AniIdle; // 0x248(0x08)
	struct UAnimMontage* AniStart; // 0x250(0x08)
	struct UAnimMontage* AniLoop; // 0x258(0x08)
	struct UAnimMontage* AniEnd; // 0x260(0x08)
	struct UParticleSystem* EffectGlow; // 0x268(0x08)
	struct UParticleSystem* EffectSmoke; // 0x270(0x08)
	struct UParticleSystem* EffectFloorSmoke; // 0x278(0x08)
	struct UParticleSystem* EffectLCD_On; // 0x280(0x08)
	struct UParticleSystem* EffectLCD_Off; // 0x288(0x08)
	struct UParticleSystemComponent* EffectGlowComponent; // 0x290(0x08)
	struct UParticleSystemComponent* EffectSmokeComponent; // 0x298(0x08)
	struct UParticleSystemComponent* EffectFloorSmokeComponent; // 0x2a0(0x08)
	struct UParticleSystemComponent* EffectLCD_OnComponent; // 0x2a8(0x08)
	struct UParticleSystemComponent* EffectLCD_OffComponent; // 0x2b0(0x08)
	struct ACrowConquestArea* TargetActor; // 0x2b8(0x08)
	struct UMeshComponent* FlagMeshComponent; // 0x2c0(0x08)
	struct USkeletalMeshComponent* BodyMeshComponent; // 0x2c8(0x08)
	char pad_2D0[0x8]; // 0x2d0(0x08)
};

// Class CrowFPS.CrowConquestGaugeNumber
// Size: 0x358 (Inherited: 0x348)
struct UCrowConquestGaugeNumber : UCrowWidgetBase {
	struct UTextBlock* TB_Tick; // 0x348(0x08)
	char pad_350[0x8]; // 0x350(0x08)
};

// Class CrowFPS.CrowConquestGroupWidget
// Size: 0x358 (Inherited: 0x348)
struct UCrowConquestGroupWidget : UCrowWidgetBase {
	struct UWidgetAnimation* AniConquest; // 0x348(0x08)
	char pad_350[0x8]; // 0x350(0x08)
};

// Class CrowFPS.CrowConquestHeavyBomberActor
// Size: 0x378 (Inherited: 0x220)
struct ACrowConquestHeavyBomberActor : AActor {
	float StartDelayMin; // 0x220(0x04)
	float StartDelayMax; // 0x224(0x04)
	float AttackRadius; // 0x228(0x04)
	char AttackCount; // 0x22c(0x01)
	char pad_22D[0x3]; // 0x22d(0x03)
	struct FWeaponDamageSettings Damage; // 0x230(0x28)
	struct UDamageType* DamegeType; // 0x258(0x08)
	float AttackDelayMin; // 0x260(0x04)
	float AttackDelayMax; // 0x264(0x04)
	struct UParticleSystem* ExplosionEffect; // 0x268(0x08)
	struct UAkAudioEvent* FlyBySound; // 0x270(0x08)
	struct UAkAudioEvent* ExplosionSound; // 0x278(0x08)
	struct UAkAudioEvent* WarningFriendlySound; // 0x280(0x08)
	struct UAkAudioEvent* WarningEnemySound; // 0x288(0x08)
	struct UAkAudioEvent* AttackStartSound; // 0x290(0x08)
	struct UAkAudioEvent* AttackEndSound; // 0x298(0x08)
	struct UMatineeCameraShake* CameraShake; // 0x2a0(0x08)
	float CameraShakeMinDistance; // 0x2a8(0x04)
	float CameraShakeMaxDistance; // 0x2ac(0x04)
	struct FCrowGameIconDisplayInfo IconDisplayInfo; // 0x2b0(0x88)
	enum class ECrowConquestHeavyBomberState CurrentState; // 0x338(0x01)
	char OwnerTeamID; // 0x339(0x01)
	char pad_33A[0x6]; // 0x33a(0x06)
	uint64_t OwnerServerKey; // 0x340(0x08)
	struct ACrowPlayerControllerBase* OwnerController; // 0x348(0x08)
	struct TArray<struct FCrowHeavyBomberInfo> FireInfoArray; // 0x350(0x10)
	struct TArray<struct FCrowHeavyBomberInfo> FlyByInfoArray; // 0x360(0x10)
	char pad_370[0x8]; // 0x370(0x08)

	void OnRep_ChangeCurrentState(); // Function CrowFPS.CrowConquestHeavyBomberActor.OnRep_ChangeCurrentState // (Final|Native|Protected) // @ game+0x18ebb10
	void MulticastFlyBy(struct FVector Location); // Function CrowFPS.CrowConquestHeavyBomberActor.MulticastFlyBy // (Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults) // @ game+0x18eb990
	void MulticastAttack(struct FVector Location, char RemainCount); // Function CrowFPS.CrowConquestHeavyBomberActor.MulticastAttack // (Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults) // @ game+0x18eb8b0
};

// Class CrowFPS.CrowWorldIconWidgetArea
// Size: 0x3d8 (Inherited: 0x3c8)
struct UCrowWorldIconWidgetArea : UCrowWorldIconWidgetBase {
	struct UImage* IMG_Area; // 0x3c8(0x08)
	char pad_3D0[0x8]; // 0x3d0(0x08)
};

// Class CrowFPS.CrowConquestHeavyBomberIcon
// Size: 0x3e8 (Inherited: 0x3d8)
struct UCrowConquestHeavyBomberIcon : UCrowWorldIconWidgetArea {
	struct ACrowConquestHeavyBomberActor* HeavyBomberActor; // 0x3d8(0x08)
	char pad_3E0[0x8]; // 0x3e0(0x08)
};

// Class CrowFPS.CrowConquestLineLink
// Size: 0x78 (Inherited: 0x28)
struct UCrowConquestLineLink : UObject {
	struct UCrowConquestLineWidget* ConquestLineClass; // 0x28(0x08)
	struct UCanvasPanel* LinePanel; // 0x30(0x08)
	struct TArray<struct FCrowConquestIconAreaPair> IconAreaArray; // 0x38(0x10)
	struct TArray<struct FCrowConquestLineInfo> LineArray; // 0x48(0x10)
	struct TArray<struct FString> ConquestSequenceRedTeam; // 0x58(0x10)
	char pad_68[0x10]; // 0x68(0x10)
};

// Class CrowFPS.CrowConquestLineWidget
// Size: 0x378 (Inherited: 0x348)
struct UCrowConquestLineWidget : UCrowWidgetBase {
	struct UImage* IMG_BothArrow; // 0x348(0x08)
	struct UImage* IMG_Arrow; // 0x350(0x08)
	struct UImage* IMG_Dotline; // 0x358(0x08)
	struct UImage* IMG_Line; // 0x360(0x08)
	struct UWidgetAnimation* AniArrowClash; // 0x368(0x08)
	char pad_370[0x8]; // 0x370(0x08)
};

// Class CrowFPS.CrowConquestMeteorActor
// Size: 0x270 (Inherited: 0x220)
struct ACrowConquestMeteorActor : AActor {
	struct UBoxComponent* Root; // 0x220(0x08)
	struct ACrowConquestMeteorSettings* MeteorSettingsActor; // 0x228(0x08)
	struct TArray<struct ACrowConquestMeteorPieceActor*> SmallMeteorArray; // 0x230(0x10)
	struct ACrowTargetTraceEffect* LargeMeteorEffect; // 0x240(0x08)
	bool bIsFired; // 0x248(0x01)
	char pad_249[0x3]; // 0x249(0x03)
	float MeteorDistance; // 0x24c(0x04)
	char pad_250[0x20]; // 0x250(0x20)

	void OnRep_Fired(); // Function CrowFPS.CrowConquestMeteorActor.OnRep_Fired // (Final|Native|Protected) // @ game+0x18ebb30
};

// Class CrowFPS.CrowConquestMeteorExplosionPoint
// Size: 0x210 (Inherited: 0x200)
struct UCrowConquestMeteorExplosionPoint : USceneComponent {
	struct UBillboardComponent* Billboard; // 0x1f8(0x08)
	float IconScale; // 0x200(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class CrowFPS.CrowConquestMeteorGasActor
// Size: 0x250 (Inherited: 0x220)
struct ACrowConquestMeteorGasActor : AActor {
	struct USceneComponent* SceneComponent; // 0x220(0x08)
	struct UStaticMeshComponent* StaticMeshComponent; // 0x228(0x08)
	float FadeOutTime; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct FTimerHandle TimerHandler; // 0x238(0x08)
	struct UMaterialInstanceDynamic* Mid; // 0x240(0x08)
	float ElapsedTime; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)

	void StartFadeOut(); // Function CrowFPS.CrowConquestMeteorGasActor.StartFadeOut // (Final|Native|Private) // @ game+0x18ebca0
	void SetGasLifeTime(float InLifeTime); // Function CrowFPS.CrowConquestMeteorGasActor.SetGasLifeTime // (Final|Native|Public) // @ game+0x18ebc20
};

// Class CrowFPS.CrowConquestMeteorPieceActor
// Size: 0x288 (Inherited: 0x220)
struct ACrowConquestMeteorPieceActor : AActor {
	struct FVector EndLocation; // 0x220(0x0c)
	float SmallMeteorSpeed; // 0x22c(0x04)
	enum class ECrowMMeteorPieceState MeteorState; // 0x230(0x01)
	char pad_231[0xf]; // 0x231(0x0f)
	struct UBoxComponent* Root; // 0x240(0x08)
	struct ACrowConquestMeteorSettings* MeteorSettingsActor; // 0x248(0x08)
	struct ACrowTargetTraceEffect* SmallMeteorComp; // 0x250(0x08)
	struct UParticleSystemComponent* GasComp; // 0x258(0x08)
	float MeteorDistance; // 0x260(0x04)
	char pad_264[0x24]; // 0x264(0x24)

	void OnRep_MeteorState(); // Function CrowFPS.CrowConquestMeteorPieceActor.OnRep_MeteorState // (Final|Native|Protected) // @ game+0x18ebb50
};

// Class CrowFPS.CrowConquestMeteorSettings
// Size: 0x3d0 (Inherited: 0x220)
struct ACrowConquestMeteorSettings : AActor {
	float Chance; // 0x220(0x04)
	float LargeMeteorSpeed; // 0x224(0x04)
	float LargeMeteorLifeTime; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct UAkAudioEvent* LargeMeteorFlyByLoopSound; // 0x230(0x08)
	struct UAkAudioEvent* LargeMeteorFlyByLoopEndSound; // 0x238(0x08)
	struct UAkAudioEvent* LargeMeteorExplosionSound; // 0x240(0x08)
	struct UParticleSystem* LargeMeteor; // 0x248(0x08)
	struct UParticleSystem* LargeMeteorExplosion01; // 0x250(0x08)
	struct UParticleSystem* LargeMeteorExplosion02; // 0x258(0x08)
	float SmallMeteorSpeedMin; // 0x260(0x04)
	float SmallMeteorSpeedMax; // 0x264(0x04)
	int32_t SmallMeteorCountMin; // 0x268(0x04)
	int32_t SmallMeteorCountMax; // 0x26c(0x04)
	float SmallMeteorFireDelayMin; // 0x270(0x04)
	float SmallMeteorFireDelayMax; // 0x274(0x04)
	struct FWeaponDamageSettings SmallMeteorDamage; // 0x278(0x28)
	struct UDamageType* SmallMeteorDamegeType; // 0x2a0(0x08)
	struct UMatineeCameraShake* CameraShake; // 0x2a8(0x08)
	float CameraShakeMinDistance; // 0x2b0(0x04)
	float CameraShakeMaxDistance; // 0x2b4(0x04)
	struct FCrowGameIconDisplayInfo IconDisplayInfo; // 0x2b8(0x88)
	struct UAkAudioEvent* SmallMeteorFlyByLoopSound; // 0x340(0x08)
	struct UAkAudioEvent* SmallMeteorFlyByLoopEndSound; // 0x348(0x08)
	struct UAkAudioEvent* SmallMeteorExplosionSound; // 0x350(0x08)
	struct UParticleSystem* SmallMeteor; // 0x358(0x08)
	struct UParticleSystem* SmallMeteorExplosion; // 0x360(0x08)
	float GasAreaRadiuse; // 0x368(0x04)
	float GasLifeTime; // 0x36c(0x04)
	struct UParticleSystem* Gas; // 0x370(0x08)
	struct AActor* GasActor; // 0x378(0x08)
	char pad_380[0x38]; // 0x380(0x38)
	struct UBoxComponent* Root; // 0x3b8(0x08)
	struct TArray<struct ACrowConquestMeteorPieceActor*> SmallMeteorArray; // 0x3c0(0x10)
};

// Class CrowFPS.CrowConquestMeteorShowerPoint
// Size: 0x210 (Inherited: 0x200)
struct UCrowConquestMeteorShowerPoint : USceneComponent {
	struct UBillboardComponent* Billboard; // 0x1f8(0x08)
	float IconScale; // 0x200(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class CrowFPS.CrowConquestMeteorStart
// Size: 0x210 (Inherited: 0x200)
struct UCrowConquestMeteorStart : USceneComponent {
	struct UBillboardComponent* Billboard; // 0x1f8(0x08)
	float IconScale; // 0x200(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class CrowFPS.CrowConquestOpeningEffectWidget
// Size: 0x348 (Inherited: 0x348)
struct UCrowConquestOpeningEffectWidget : UCrowWidgetBase {
};

// Class CrowFPS.CrowConquestSkillManager
// Size: 0x138 (Inherited: 0xb0)
struct UCrowConquestSkillManager : UActorComponent {
	struct ACrowPlayerStateConquest* PlayerState; // 0xb0(0x08)
	struct UCrowGameInvenComponent* GameInventory; // 0xb8(0x08)
	struct TArray<struct FCrowConquestSkillInfo> SkillArray; // 0xc0(0x10)
	struct TMap<struct FString, float> SkillCoolMap; // 0xd0(0x50)
	struct TArray<struct ACrowIronShieldActor*> IronShieldArray; // 0x120(0x10)
	char pad_130[0x8]; // 0x130(0x08)
};

// Class CrowFPS.CrowConquestSkillTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowConquestSkillTable : UDataTable {
};

// Class CrowFPS.CrowConquestSkillTableManager
// Size: 0x78 (Inherited: 0x28)
struct UCrowConquestSkillTableManager : UObject {
	struct TMap<struct FString, struct FCrowConquestSkillTableRow> TableMap; // 0x28(0x50)
};

// Class CrowFPS.CrowConquestSkyRespawnPoint
// Size: 0x2b8 (Inherited: 0x220)
struct ACrowConquestSkyRespawnPoint : AActor {
	enum class ECrowTeam_RedBlue Team; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)
	struct FCrowGameIconDisplayInfo IconInfo; // 0x228(0x88)
	char pad_2B0[0x8]; // 0x2b0(0x08)
};

// Class CrowFPS.CrowConquestSpawnPoint
// Size: 0x228 (Inherited: 0x220)
struct ACrowConquestSpawnPoint : AActor {
	enum class ECrowTeam_RedBlue Team; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)
};

// Class CrowFPS.CrowConquestSupply
// Size: 0x230 (Inherited: 0x220)
struct UCrowConquestSupply : UCrowConquestAreaComponent {
	struct TArray<struct FCrowSupplySpawnInfo> ArrSupplySpawnedInfo; // 0x218(0x10)
};

// Class CrowFPS.CrowConquestUAVSupportActor
// Size: 0x300 (Inherited: 0x220)
struct ACrowConquestUAVSupportActor : AActor {
	float StartDelay; // 0x220(0x04)
	float ReconTime; // 0x224(0x04)
	float ReconRadius; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct UAkAudioEvent* MoveStartSound; // 0x230(0x08)
	struct UAkAudioEvent* StartSound; // 0x238(0x08)
	struct UAkAudioEvent* EndSound; // 0x240(0x08)
	struct FCrowGameIconDisplayInfo IconDisplayInfo; // 0x248(0x88)
	char OwnerTeamID; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	uint64_t OwnerServerKey; // 0x2d8(0x08)
	enum class ECrowConquestUAVSupportState CurrentState; // 0x2e0(0x01)
	char pad_2E1[0x7]; // 0x2e1(0x07)
	struct ACrowGameStateConquest* GameState; // 0x2e8(0x08)
	char pad_2F0[0x10]; // 0x2f0(0x10)

	void OnRep_ChangeCurrentState(); // Function CrowFPS.CrowConquestUAVSupportActor.OnRep_ChangeCurrentState // (Final|Native|Protected) // @ game+0x18efa90
};

// Class CrowFPS.CrowVehicleRandomSpawner
// Size: 0x290 (Inherited: 0x220)
struct ACrowVehicleRandomSpawner : AActor {
	struct UBoxComponent* BoxComponent; // 0x220(0x08)
	struct TArray<struct FCrowVehicleSpawnWeight> VehicleArray; // 0x228(0x10)
	struct ACrowVehicleSpawnerGroup* OwnerGroup; // 0x238(0x08)
	struct FString GroupName; // 0x240(0x10)
	char pad_250[0x40]; // 0x250(0x40)

	void OnVehicleDestroyed(struct AActor* DestroyedActor); // Function CrowFPS.CrowVehicleRandomSpawner.OnVehicleDestroyed // (Native|Protected) // @ game+0xc9f470
};

// Class CrowFPS.CrowConquestVehicleSpawnerGround
// Size: 0x2b0 (Inherited: 0x290)
struct ACrowConquestVehicleSpawnerGround : ACrowVehicleRandomSpawner {
	float CoolTime; // 0x288(0x04)
	bool IsNeutralityCheck; // 0x28c(0x01)
	int32_t NeutralityCheckTime; // 0x290(0x04)
	float NeutralityCharacterRadius; // 0x294(0x04)
	float NeutralitySpawnerDist; // 0x298(0x04)
	float NeutralityDotDamage; // 0x29c(0x04)
	char pad_2A5[0xb]; // 0x2a5(0x0b)
};

// Class CrowFPS.CrowConqustVehicleDestroyer
// Size: 0xf0 (Inherited: 0xb0)
struct UCrowConqustVehicleDestroyer : UActorComponent {
	struct ACrowVehiclePawn* VehiclePawn; // 0xb0(0x08)
	struct ACrowGameStateConquest* GameStateConquest; // 0xb8(0x08)
	char pad_C0[0x30]; // 0xc0(0x30)
};

// Class CrowFPS.CrowConsoleInitializer
// Size: 0x230 (Inherited: 0x220)
struct ACrowConsoleInitializer : AActor {
	struct TArray<struct FString> ConsoleCommands; // 0x220(0x10)
};

// Class CrowFPS.CrowConstructProgress
// Size: 0x378 (Inherited: 0x348)
struct UCrowConstructProgress : UCrowWidgetBase {
	struct UProgressBar* PB_Progress; // 0x348(0x08)
	struct UTextBlock* TXT_Progress; // 0x350(0x08)
	char pad_358[0x10]; // 0x358(0x10)
	struct FTimerHandle ProgressTimerHandle; // 0x368(0x08)
	float BuildTime; // 0x370(0x04)
	float StartBuildTime; // 0x374(0x04)
};

// Class CrowFPS.CrowContaminationAreaEventActor
// Size: 0x370 (Inherited: 0x220)
struct ACrowContaminationAreaEventActor : AActor {
	struct UBoxComponent* Root; // 0x220(0x08)
	struct UStaticMeshComponent* OutsideMesh; // 0x228(0x08)
	struct UStaticMeshComponent* InsideMesh; // 0x230(0x08)
	bool IsActiveStart; // 0x238(0x01)
	enum class ECrowContaminationAreaType AreaType; // 0x239(0x01)
	char pad_23A[0x6]; // 0x23a(0x06)
	struct UStaticMesh* AreaShape; // 0x240(0x08)
	struct UMaterialInterface* OutSideMaterial; // 0x248(0x08)
	struct UMaterialInterface* InSideMaterial; // 0x250(0x08)
	struct FVector DefaultAreaScale; // 0x258(0x0c)
	bool ShowNextExpansionAreaUI; // 0x264(0x01)
	char pad_265[0x3]; // 0x265(0x03)
	struct TArray<struct FContaminationAreaExpansionInfo> AreaExpansion; // 0x268(0x10)
	float DamageTime; // 0x278(0x04)
	int32_t MinDamage; // 0x27c(0x04)
	int32_t MaxDamage; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
	struct UDamageType* DamageType; // 0x288(0x08)
	struct FCrowGameIconDisplayInfo IconDisplayInfoActive; // 0x290(0x88)
	bool ShowDebugShape; // 0x318(0x01)
	char pad_319[0x3]; // 0x319(0x03)
	float ScaleSyncTime; // 0x31c(0x04)
	float ScaleSyncDistinction; // 0x320(0x04)
	char pad_324[0x4]; // 0x324(0x04)
	struct TArray<struct AActor*> OverlapUserArray; // 0x328(0x10)
	struct FTimerHandle DmageTimerHandle; // 0x338(0x08)
	bool bIsCheckStart; // 0x340(0x01)
	char pad_341[0x3]; // 0x341(0x03)
	int32_t CurrentExpansionStep; // 0x344(0x04)
	enum class ECrowContaminationAreaEventState CrowContaminationAreaState; // 0x348(0x01)
	char pad_349[0x7]; // 0x349(0x07)
	struct UCrowWorldMapIcon* ContaminationAreaIcon; // 0x350(0x08)
	struct ACrowGameStateBase* GameState; // 0x358(0x08)
	struct UCrowLocalPostProcessComponent* PostProcessComp; // 0x360(0x08)
	float ScaleSyncDeletaTime; // 0x368(0x04)
	char pad_36C[0x4]; // 0x36c(0x04)

	void MulticastScaleSync(float Radius); // Function CrowFPS.CrowContaminationAreaEventActor.MulticastScaleSync // (Net|NetReliableNative|Event|NetMulticast|Protected|NetValidate) // @ game+0x18ef520
	void MulticastEventState(enum class ECrowContaminationAreaEventState NewState); // Function CrowFPS.CrowContaminationAreaEventActor.MulticastEventState // (Net|NetReliableNative|Event|NetMulticast|Protected|NetValidate) // @ game+0x18ef470
};

// Class CrowFPS.CrowCountdownWidget
// Size: 0x3e0 (Inherited: 0x348)
struct UCrowCountdownWidget : UCrowWidgetBase {
	struct UCanvasPanel* CP_Blocker; // 0x348(0x08)
	struct UCanvasPanel* CP_Countdown_Normal; // 0x350(0x08)
	struct UTextBlock* TB_Countdown_Normal; // 0x358(0x08)
	struct UTextBlock* TB_Countdown_Normal_Effect; // 0x360(0x08)
	struct UWidgetAnimation* AniCountNormal; // 0x368(0x08)
	struct UCanvasPanel* CP_Countdown_Focus; // 0x370(0x08)
	struct UTextBlock* TB_Countdown_Focus; // 0x378(0x08)
	struct UTextBlock* TB_Countdown_Focus_Effect; // 0x380(0x08)
	struct UWidgetAnimation* AniCountFocus; // 0x388(0x08)
	char pad_390[0x8]; // 0x390(0x08)
	struct UCrowRemainTimeSync* RemainTimeSync; // 0x398(0x08)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	struct UAkAudioEvent* TotalCountSound; // 0x3a8(0x08)
	char pad_3B0[0x8]; // 0x3b0(0x08)
	struct UAkAudioEvent* FocusCountSound; // 0x3b8(0x08)
	char pad_3C0[0x20]; // 0x3c0(0x20)
};

// Class CrowFPS.CrowCurrencyTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowCurrencyTable : UDataTable {
};

// Class CrowFPS.CrowCustomAppearanceListWidget
// Size: 0x3b8 (Inherited: 0x348)
struct UCrowCustomAppearanceListWidget : UCrowWidgetBase {
	struct UGridPanel* GD_ItemList; // 0x348(0x08)
	struct UBorder* BD_SubTitle_Color; // 0x350(0x08)
	struct UGridPanel* GD_ColorItemList; // 0x358(0x08)
	struct UScrollBox* SCB_Itemlist; // 0x360(0x08)
	struct UImage* IMG_Line; // 0x368(0x08)
	struct UTextBlock* TB_Title; // 0x370(0x08)
	struct UHorizontalBox* HB_Appearance_SaveBT; // 0x378(0x08)
	struct UCrowButton* WB_BT_APPLY; // 0x380(0x08)
	struct UCrowButton* WB_BT_RESET; // 0x388(0x08)
	struct UCrowCustomizeOutfitSlotWidget* CustomizeOutfitSlotWidgetClass; // 0x390(0x08)
	struct UCrowItemSlotMiniWidget* CrowItemSlotMiniWidgetClass; // 0x398(0x08)
	struct ACrowSceneLobby* SceneLobby; // 0x3a0(0x08)
	struct UCrowCategorySlotBigWidget* CurrentCategorySlotWidget; // 0x3a8(0x08)
	bool IsOwnList; // 0x3b0(0x01)
	enum class ECrowTattooType CurrTattooType; // 0x3b1(0x01)
	char pad_3B2[0x6]; // 0x3b2(0x06)

	void OnClicked_BT_RESET(); // Function CrowFPS.CrowCustomAppearanceListWidget.OnClicked_BT_RESET // (Final|Native|Public) // @ game+0x18ef9e0
	void OnClicked_BT_APPLY(); // Function CrowFPS.CrowCustomAppearanceListWidget.OnClicked_BT_APPLY // (Final|Native|Protected) // @ game+0x18ef980
};

// Class CrowFPS.CrowCustomCreateRoomPopupWidget
// Size: 0x450 (Inherited: 0x348)
struct UCrowCustomCreateRoomPopupWidget : UCrowWidgetBase {
	struct UTextBlock* TB_Title; // 0x348(0x08)
	struct UEditableText* ET_RoomName; // 0x350(0x08)
	struct UEditableText* ET_RoomPass; // 0x358(0x08)
	struct UCrowButton* BT_Ok; // 0x360(0x08)
	struct UCrowButton* BT_ChangeOK; // 0x368(0x08)
	struct UCrowButton* BT_Cancel; // 0x370(0x08)
	struct UCrowCustomSettingSlotWidget* WB_CustomSettingSlot_Mode; // 0x378(0x08)
	struct UCrowCustomSettingSlotWidget* WB_CustomSettingSlot_Map; // 0x380(0x08)
	struct UCrowCustomSettingSlotWidget* WB_CustomSettingSlot_MaxPlayer; // 0x388(0x08)
	struct UCrowCustomSettingSlotWidget* WB_CustomSettingSlot_PlayTime; // 0x390(0x08)
	struct UCrowCustomSettingSlotWidget* WB_CustomSettingSlot_WinPoint; // 0x398(0x08)
	struct TArray<int32_t> SquadMatchMaxUsers; // 0x3a0(0x10)
	int32_t SquadMatchMaxUser; // 0x3b0(0x04)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct TArray<int32_t> TeamMatchMaxUsers; // 0x3b8(0x10)
	int32_t TeamMatchMaxUser; // 0x3c8(0x04)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct TArray<int32_t> WinPoints; // 0x3d0(0x10)
	int32_t WinPoint; // 0x3e0(0x04)
	char pad_3E4[0x4]; // 0x3e4(0x04)
	struct TArray<int32_t> PlayTimes; // 0x3e8(0x10)
	int32_t PlayTime; // 0x3f8(0x04)
	bool CreateMode; // 0x3fc(0x01)
	char pad_3FD[0x3]; // 0x3fd(0x03)
	struct FCrowCustomRoomSettingInfo CurrentRoomSettingInfo; // 0x400(0x40)
	struct TArray<struct FCrowMatchInfo> GameModeInfoArray; // 0x440(0x10)

	void OnClickWinPointSlotArrowButton(bool Next); // Function CrowFPS.CrowCustomCreateRoomPopupWidget.OnClickWinPointSlotArrowButton // (Final|Native|Protected) // @ game+0x18ef8f0
	void OnClickPlayTimeArrowButton(bool Next); // Function CrowFPS.CrowCustomCreateRoomPopupWidget.OnClickPlayTimeArrowButton // (Final|Native|Protected) // @ game+0x18ef860
	void OnClickModeSlotArrowButton(bool Next); // Function CrowFPS.CrowCustomCreateRoomPopupWidget.OnClickModeSlotArrowButton // (Final|Native|Protected) // @ game+0x18ef7d0
	void OnClickMaxPlayerSlotArrowButton(bool Next); // Function CrowFPS.CrowCustomCreateRoomPopupWidget.OnClickMaxPlayerSlotArrowButton // (Final|Native|Protected) // @ game+0x18ef740
	void OnClickMapSlotArrowButton(bool Next); // Function CrowFPS.CrowCustomCreateRoomPopupWidget.OnClickMapSlotArrowButton // (Final|Native|Protected) // @ game+0x18ef6b0
	void OnClicked_BT_Ok(); // Function CrowFPS.CrowCustomCreateRoomPopupWidget.OnClicked_BT_Ok // (Final|Native|Protected) // @ game+0x18ef9c0
	void OnClicked_BT_Cancel(); // Function CrowFPS.CrowCustomCreateRoomPopupWidget.OnClicked_BT_Cancel // (Final|Native|Protected) // @ game+0x18ef9a0
};

// Class CrowFPS.CrowCustomCursorBase
// Size: 0x350 (Inherited: 0x348)
struct UCrowCustomCursorBase : UCrowWidgetBase {
	struct UAkAudioEvent* ClickSound; // 0x348(0x08)
};

// Class CrowFPS.CrowCustomCursorHeavyBomber
// Size: 0x360 (Inherited: 0x350)
struct UCrowCustomCursorHeavyBomber : UCrowCustomCursorBase {
	char pad_350[0x10]; // 0x350(0x10)

	void OnAniFinished(); // Function CrowFPS.CrowCustomCursorHeavyBomber.OnAniFinished // (Final|Native|Protected) // @ game+0x18ef5e0
};

// Class CrowFPS.CrowCustomCursorSpaceWidget
// Size: 0x360 (Inherited: 0x348)
struct UCrowCustomCursorSpaceWidget : UCrowWidgetBase {
	struct UCanvasPanel* CP_Root; // 0x348(0x08)
	struct UCrowCustomCursorBase* CustomCursor; // 0x350(0x08)
	struct UCanvasPanelSlot* CursorPanelSlot; // 0x358(0x08)
};

// Class CrowFPS.CrowCustomCursorUAV
// Size: 0x368 (Inherited: 0x350)
struct UCrowCustomCursorUAV : UCrowCustomCursorBase {
	struct UCanvasPanel* CP_Area; // 0x350(0x08)
	char pad_358[0x10]; // 0x358(0x10)

	void OnAniFinished(); // Function CrowFPS.CrowCustomCursorUAV.OnAniFinished // (Final|Native|Protected) // @ game+0x18ef600
};

// Class CrowFPS.CrowCustomDepthDecal
// Size: 0x500 (Inherited: 0x4d0)
struct UCrowCustomDepthDecal : UStaticMeshComponent {
	struct UMaterialInstanceDynamic* MaterialDynamic; // 0x4d0(0x08)
	struct UCurveFloat* FadeOutCurve; // 0x4d8(0x08)
	struct FName AttachedBoneName; // 0x4e0(0x08)
	struct UCrowDecalManager* DecalManager; // 0x4e8(0x08)
	char pad_4F0[0x10]; // 0x4f0(0x10)
};

// Class CrowFPS.CrowCustomDepthMeshContainer
// Size: 0x200 (Inherited: 0x200)
struct UCrowCustomDepthMeshContainer : USceneComponent {
};

// Class CrowFPS.CrowCustomFilterSlotWidge
// Size: 0x390 (Inherited: 0x348)
struct UCrowCustomFilterSlotWidge : UCrowWidgetBase {
	struct UCrowToggleButton* BT_Toggle; // 0x348(0x08)
	struct UTextBlock* TB_SlotName; // 0x350(0x08)
	struct UTextBlock* TB_SelectedSlotName; // 0x358(0x08)
	char pad_360[0x10]; // 0x360(0x10)
	uint32_t SlotValue; // 0x370(0x04)
	char pad_374[0x4]; // 0x374(0x04)
	struct FText LabelName; // 0x378(0x18)

	void OnChangeedStateToggle(bool IsChecked); // Function CrowFPS.CrowCustomFilterSlotWidge.OnChangeedStateToggle // (Final|Native|Protected) // @ game+0x18ef620
};

// Class CrowFPS.CrowCustomFxLODComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UCrowCustomFxLODComponent : UActorComponent {
	char pad_B0[0x18]; // 0xb0(0x18)

	void OnDestroy_Delegate(struct UParticleSystemComponent* FxSystemComp); // Function CrowFPS.CrowCustomFxLODComponent.OnDestroy_Delegate // (Final|Native|Public) // @ game+0x18efa00
};

// Class CrowFPS.CrowCustomFxLODTable
// Size: 0xb0 (Inherited: 0xb0)
struct UCrowCustomFxLODTable : UDataTable {
};

// Class CrowFPS.CrowCustomFxLODManager
// Size: 0x78 (Inherited: 0x28)
struct UCrowCustomFxLODManager : UObject {
	struct TMap<struct FString, struct FCrowCustomFxLODRow> TableMap; // 0x28(0x50)
};

// Class CrowFPS.CrowCustomInvitePopupWidget
// Size: 0x360 (Inherited: 0x348)
struct UCrowCustomInvitePopupWidget : UCrowWidgetBase {
	struct UCrowButton* BT_Close; // 0x348(0x08)
	struct UScrollBox* SB_FriendsList; // 0x350(0x08)
	struct UCrowFriendSlotWidget* FriendSlotWidgetClass; // 0x358(0x08)

	void OnClicked_BT_Close(); // Function CrowFPS.CrowCustomInvitePopupWidget.OnClicked_BT_Close // (Final|Native|Protected) // @ game+0x18c8830
};

// Class CrowFPS.CrowCustomizeCategorySmallWidget
// Size: 0x388 (Inherited: 0x348)
struct UCrowCustomizeCategorySmallWidget : UCrowWidgetBase {
	struct UVerticalBox* VB_Custmize_Outfitlist; // 0x348(0x08)
	struct UCrowCustomOutfitItemListWidget* CustomOutfitItemListWidget; // 0x350(0x08)
	struct UCrowCustomAppearanceListWidget* CustomAppearanceListWidget; // 0x358(0x08)
	struct TArray<struct UCrowCategorySlotSmallWidget*> OutFitSlotWidgetArray; // 0x360(0x10)
	struct ACrowSceneLobby* SceneLobby; // 0x370(0x08)
	struct UCrowCategorySlotSmallWidget* CurrentCategorySlot; // 0x378(0x08)
	bool IsOwnItemList; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)
};

// Class CrowFPS.CrowCustomizeCategryBigWidget
// Size: 0x3b0 (Inherited: 0x348)
struct UCrowCustomizeCategryBigWidget : UCrowWidgetBase {
	struct UHorizontalBox* HB_WeaponParts; // 0x348(0x08)
	struct UCrowCategorySlotBigWidget* WB_Customize_Category_Barrel; // 0x350(0x08)
	struct UCrowCategorySlotBigWidget* WB_Customize_Category_Magazine; // 0x358(0x08)
	struct UCrowCategorySlotBigWidget* WB_Customize_Category_Muzzle; // 0x360(0x08)
	struct UCrowCategorySlotBigWidget* WB_Customize_Category_PistolGrip; // 0x368(0x08)
	struct UCrowCategorySlotBigWidget* WB_Customize_Category_PrimarySight; // 0x370(0x08)
	struct UCrowCategorySlotBigWidget* WB_Customize_Category_SecondarySight; // 0x378(0x08)
	struct UCrowCategorySlotBigWidget* WB_Customize_Category_SideBarrel; // 0x380(0x08)
	struct UCrowCategorySlotBigWidget* WB_Customize_Category_Stock; // 0x388(0x08)
	struct UCrowCategorySlotBigWidget* WB_Customize_Category_UnderBarrel; // 0x390(0x08)
	struct TArray<struct UCrowCategorySlotBigWidget*> WeaponPartsSlotWidgetArray; // 0x398(0x10)
	struct UCrowCustomizeItemDescWidget* CustomizeItemDescWidget; // 0x3a8(0x08)
};

// Class CrowFPS.CrowCustomizeCharacterDescWidget
// Size: 0x468 (Inherited: 0x348)
struct UCrowCustomizeCharacterDescWidget : UCrowWidgetBase {
	struct UCrowLobbyOutfitSlotListWidget* WB_Lobby_OutfitSlotList; // 0x348(0x08)
	struct UCrowCustomizeCategorySmallWidget* WB_CustomizeCategoryOutfit; // 0x350(0x08)
	struct UCrowCustomOutfitItemListWidget* WB_CustomizeOutfitItemlist; // 0x358(0x08)
	struct UCrowCategoryAppearanceWidget* WB_CustomizeCategoryAppearance; // 0x360(0x08)
	struct UCrowCustomAppearanceListWidget* WB_CustomizeAppearanceItemlist; // 0x368(0x08)
	struct UCrowShopPurchasePopup* WB_Shop_Popup_ExclusivePurchase; // 0x370(0x08)
	struct UCrowShoppingBagWidget* WB_Shop_Popup_ExclusivePurchase_Quick; // 0x378(0x08)
	struct UCrowLobbySlotPurchasePopupWidget* WB_LobbySlotPurchasePopup; // 0x380(0x08)
	struct UCrowButton* WB_BT_Change; // 0x388(0x08)
	struct UCrowButton* WB_BT_Back; // 0x390(0x08)
	struct UCrowButton* WB_BT_Home; // 0x398(0x08)
	struct UCrowButton* WB_BT_RESET; // 0x3a0(0x08)
	struct UCrowButton* BT_Buy; // 0x3a8(0x08)
	struct UCrowButton* BT_AddShoppingBag; // 0x3b0(0x08)
	struct UCrowTabGenderWidget* WB_TabGender; // 0x3b8(0x08)
	struct UCrowTabOutfitWidget* WB_TabMenuOutfit; // 0x3c0(0x08)
	struct UCrowTabOutfitWidget* WB_TabMenu_AppearanceCategory; // 0x3c8(0x08)
	struct UVerticalBox* VB_TattooSlotList; // 0x3d0(0x08)
	struct UHorizontalBox* HB_CustomizeOutfit_Shop_Button; // 0x3d8(0x08)
	struct UHorizontalBox* HB_Tutorial_Customize; // 0x3e0(0x08)
	struct UImage* IMG_New; // 0x3e8(0x08)
	struct UCrowButton* BtCustomizeTattooFace; // 0x3f0(0x08)
	struct UImage* ImgTattooFaceSelect; // 0x3f8(0x08)
	struct UImage* ImgSelectedTattooFace; // 0x400(0x08)
	struct UTextBlock* TbTattooFace; // 0x408(0x08)
	struct UCrowButton* BtCustomizeTattooArm; // 0x410(0x08)
	struct UImage* ImgTattooArmSelect; // 0x418(0x08)
	struct UImage* ImgSelectedTattooArm; // 0x420(0x08)
	struct UTextBlock* TbTattooArm; // 0x428(0x08)
	struct FLinearColor NormalTattooTextColor; // 0x430(0x10)
	struct FLinearColor SelectTattooTextColor; // 0x440(0x10)
	enum class ECrowTattooType CurrentTatooType; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
	struct UCrowCustomizeOutfitSlotWidget* CurrentOutfitSlot; // 0x458(0x08)
	struct ACrowSceneLobby* SceneLobby; // 0x460(0x08)

	void OnSelect_TabMenuOutFit(char SelectIndex); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnSelect_TabMenuOutFit // (Final|Native|Public) // @ game+0x18f2d60
	void OnSelect_ShopMenuAppearance(char SelectIndex); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnSelect_ShopMenuAppearance // (Final|Native|Public) // @ game+0x18f2ce0
	void OnClose_ShopPopup(bool IsConfirm); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnClose_ShopPopup // (Final|Native|Public) // @ game+0x18f24d0
	void OnClicked_BtCustomizeTattooFace(); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnClicked_BtCustomizeTattooFace // (Final|Native|Protected) // @ game+0x18f20d0
	void OnClicked_BtCustomizeTattooArm(); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnClicked_BtCustomizeTattooArm // (Final|Native|Protected) // @ game+0x18f20b0
	void OnClicked_BT_RESET(); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnClicked_BT_RESET // (Final|Native|Protected) // @ game+0xa996d0
	void OnClicked_BT_Home(); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnClicked_BT_Home // (Final|Native|Protected) // @ game+0x18f2010
	void OnClicked_BT_Change(); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnClicked_BT_Change // (Final|Native|Protected) // @ game+0x18f1fd0
	void OnClicked_BT_Buy(); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnClicked_BT_Buy // (Final|Native|Protected) // @ game+0x18f1f30
	void OnClicked_BT_Back(); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnClicked_BT_Back // (Final|Native|Protected) // @ game+0x18f1ef0
	void OnClicked_BT_AddShoppingBag(); // Function CrowFPS.CrowCustomizeCharacterDescWidget.OnClicked_BT_AddShoppingBag // (Final|Native|Protected) // @ game+0x18f1e70
};

// Class CrowFPS.CrowCustomizeEmotionDescWidget
// Size: 0x440 (Inherited: 0x348)
struct UCrowCustomizeEmotionDescWidget : UCrowWidgetBase {
	struct UCrowTabOutfitWidget* WB_Customize_TopMenu; // 0x348(0x08)
	struct UHorizontalBox* HB_CustomizeEmotion_Shop_Button; // 0x350(0x08)
	struct UCrowButton* BT_AddShoppingBag; // 0x358(0x08)
	struct UCrowButton* BT_Buy; // 0x360(0x08)
	struct UCrowShopPurchasePopup* WB_Shop_Popup_ExclusivePurchase; // 0x368(0x08)
	struct UCrowShoppingBagWidget* WB_Shop_Popup_ExclusivePurchase_Quick; // 0x370(0x08)
	enum class ECrowCustomizeEmotionDescState State; // 0x378(0x01)
	char pad_379[0x7]; // 0x379(0x07)
	struct UCrowWidgetToggleButton* CategoryEmotionWidget; // 0x380(0x08)
	struct UCrowWidgetToggleButton* CategoryResultMVPWidget; // 0x388(0x08)
	struct UCrowCustomizeEmotionListWidget* EmotionListWidget; // 0x390(0x08)
	struct UCrowCustomizeEmotionRadialWidget* EmotionRadialWidget; // 0x398(0x08)
	struct UCrowCustomizeEmotionListWidget* ResultMVPListWidget; // 0x3a0(0x08)
	struct UCrowCustomizeEmotionSlotWidget* SelectedSlotWidget; // 0x3a8(0x08)
	struct ACrowSceneLobby* SceneLobby; // 0x3b0(0x08)
	struct ACrowLobbyCharacterPawn* LobbyCharacterPawn; // 0x3b8(0x08)
	struct TArray<struct ASkeletalMeshActor*> SkeletalMeshActors; // 0x3c0(0x10)
	struct FTimerHandle EndPlayMontageTimerHandle; // 0x3d0(0x08)
	char pad_3D8[0x8]; // 0x3d8(0x08)
	struct FCrowCustomizeEmotionListInfo EmotionListInfo; // 0x3e0(0x28)
	struct FCrowCustomizeEmotionListInfo ResultMVPListInfo; // 0x408(0x28)
	struct UAnimMontage* CurrentAnimMontage; // 0x430(0x08)
	bool IsOwnList; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)

	void OnUnequipEmotion(uint32_t InSlotIndex); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnUnequipEmotion // (Final|Native|Protected) // @ game+0x18f2de0
	void OnSelectTabButton(char SelectIndex); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnSelectTabButton // (Final|Native|Public) // @ game+0x18f2c60
	void OnResultMVPUnhoverSlot(struct UCrowWidgetBase* InSlotWidget); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnResultMVPUnhoverSlot // (Final|Native|Protected) // @ game+0x18f2850
	void OnResultMVPSelectSlot(struct UCrowWidgetBase* InSlotWidget); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnResultMVPSelectSlot // (Final|Native|Protected) // @ game+0x18f2b40
	void OnResultMVPHoverSlot(struct UCrowWidgetBase* InSlotWidget); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnResultMVPHoverSlot // (Final|Native|Protected) // @ game+0x18f2ab0
	void OnResultMVPDeselectSlot(struct UCrowWidgetBase* InSlotWidget); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnResultMVPDeselectSlot // (Final|Native|Protected) // @ game+0x18f2a20
	void OnEquipEmotion(uint32_t InSlotIndex); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnEquipEmotion // (Final|Native|Protected) // @ game+0x18f28e0
	void OnEmotionUnhoverSlot(struct UCrowWidgetBase* InSlotWidget); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnEmotionUnhoverSlot // (Final|Native|Protected) // @ game+0x18f2850
	void OnEmotionSelectSlot(struct UCrowWidgetBase* InSlotWidget); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnEmotionSelectSlot // (Final|Native|Protected) // @ game+0x18f27c0
	void OnEmotionHoverSlot(struct UCrowWidgetBase* InSlotWidget); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnEmotionHoverSlot // (Final|Native|Protected) // @ game+0x18f2730
	void OnEmotionDeselectSlot(struct UCrowWidgetBase* InSlotWidget); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnEmotionDeselectSlot // (Final|Native|Protected) // @ game+0x18f26a0
	void OnClose_ShopPopup(bool IsConfirm); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnClose_ShopPopup // (Final|Native|Public) // @ game+0x18f2560
	void OnClicked_BT_Buy(); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnClicked_BT_Buy // (Final|Native|Protected) // @ game+0x18f1f50
	void OnClicked_BT_AddShoppingBag(); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnClicked_BT_AddShoppingBag // (Final|Native|Protected) // @ game+0x18f1e90
	void OnClickCategory(int32_t Index); // Function CrowFPS.CrowCustomizeEmotionDescWidget.OnClickCategory // (Final|Native|Public) // @ game+0x18f1dc0
};

// Class CrowFPS.CrowCustomizeEmotionListWidget
// Size: 0x3a0 (Inherited: 0x348)
struct UCrowCustomizeEmotionListWidget : UCrowWidgetBase {
	struct UCrowCustomizeEmotionSlotWidget* SlotWidgetClass; // 0x348(0x08)
	struct UGridPanel* GD_ItemList; // 0x350(0x08)
	struct UCrowCustomizeEmotionSlotWidget* SelectedSlotWidget; // 0x358(0x08)
	char pad_360[0x40]; // 0x360(0x40)

	void OnUnselectSlot(struct UCrowWidgetBase* InWidget); // Function CrowFPS.CrowCustomizeEmotionListWidget.OnUnselectSlot // (Final|Native|Protected) // @ game+0x18f2f20
	void OnUnhoverSlot(struct UCrowWidgetBase* InWidget); // Function CrowFPS.CrowCustomizeEmotionListWidget.OnUnhoverSlot // (Final|Native|Protected) // @ game+0x18f2e90
	void OnSelectSlot(struct UCrowWidgetBase* InWidget); // Function CrowFPS.CrowCustomizeEmotionListWidget.OnSelectSlot // (Final|Native|Protected) // @ game+0x18f2bd0
	void OnHoverSlot(struct UCrowWidgetBase* InWidget); // Function CrowFPS.CrowCustomizeEmotionListWidget.OnHoverSlot // (Final|Native|Protected) // @ game+0x18f2990
};

// Class CrowFPS.CrowRadialMenuWidgetBase
// Size: 0x3d0 (Inherited: 0x368)
struct UCrowRadialMenuWidgetBase : UCrowFullScreenWidgetBase {
	struct UCanvasPanel* CP_RadialMenu; // 0x368(0x08)
	struct UImage* IMG_Circle; // 0x370(0x08)
	struct UImage* IMG_CircleArrow; // 0x378(0x08)
	struct UImage* HoverIcon; // 0x380(0x08)
	struct UTextBlock* HoverText; // 0x388(0x08)
	struct TArray<struct FString> ItemTextIndexes; // 0x390(0x10)
	struct UWidgetAnimation* AniWidgetShow; // 0x3a0(0x08)
	bool InitializeRadialMenu; // 0x3a8(0x01)
	char pad_3A9[0x3]; // 0x3a9(0x03)
	int32_t SelectedIndex; // 0x3ac(0x04)
	bool Hiding; // 0x3b0(0x01)
	char pad_3B1[0x7]; // 0x3b1(0x07)
	struct UCrowWidgetTweenAlpha* WidgetTweenAlpha; // 0x3b8(0x08)
	struct TArray<struct UCrowRadialMenuButtonWidget*> Radial_MenuBTN_Array; // 0x3c0(0x10)

	void OnClicked_Radial_BTN(struct UCrowRadialMenuButtonWidget* SeletedButton); // Function CrowFPS.CrowRadialMenuWidgetBase.OnClicked_Radial_BTN // (Native|Protected) // @ game+0x197caa0
};

// Class CrowFPS.CrowCustomizeEmotionRadialWidget
// Size: 0x440 (Inherited: 0x3d0)
struct UCrowCustomizeEmotionRadialWidget : UCrowRadialMenuWidgetBase {
	struct UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_1; // 0x3d0(0x08)
	struct UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_2; // 0x3d8(0x08)
	struct UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_3; // 0x3e0(0x08)
	struct UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_4; // 0x3e8(0x08)
	struct UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_5; // 0x3f0(0x08)
	struct UImage* IMG_CircleSelect; // 0x3f8(0x08)
	struct UCanvasPanel* CP_MouseTip; // 0x400(0x08)
	struct UCanvasPanel* CP_HoverIcon; // 0x408(0x08)
	enum class ECrowCustomizeEmotionRadialState State; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct UWidgetAnimation* RegistAnimation; // 0x418(0x08)
	char pad_420[0x20]; // 0x420(0x20)

	void OnClicked_RightMouse_Radial_BTN(struct UCrowRadialMenuButtonWidget* InSelectBtn); // Function CrowFPS.CrowCustomizeEmotionRadialWidget.OnClicked_RightMouse_Radial_BTN // (Final|Native|Protected) // @ game+0x18f20f0
};

// Class CrowFPS.CrowCustomizeEmotionSlotWidget
// Size: 0x490 (Inherited: 0x348)
struct UCrowCustomizeEmotionSlotWidget : UCrowWidgetBase {
	struct UImage* IMG_Icon; // 0x348(0x08)
	struct UWidgetSwitcher* WS_Grade; // 0x350(0x08)
	struct UImage* IMG_Lock; // 0x358(0x08)
	struct UImage* IMG_Equiped; // 0x360(0x08)
	struct UImage* IMG_Selected; // 0x368(0x08)
	struct UImage* IMG_NewIcon; // 0x370(0x08)
	struct UCrowButton* BT_Customize_Slot; // 0x378(0x08)
	struct UCanvasPanel* CP_Cost; // 0x380(0x08)
	struct UTextBlock* TB_Label_Money; // 0x388(0x08)
	uint32_t ItemIndex; // 0x390(0x04)
	bool bIsSelect; // 0x394(0x01)
	bool bIsEquip; // 0x395(0x01)
	bool bIsEmotion; // 0x396(0x01)
	char pad_397[0x1]; // 0x397(0x01)
	float DelayTimeHover; // 0x398(0x04)
	char pad_39C[0x4]; // 0x39c(0x04)
	struct FTimerHandle DelayTimeHoverTimerHandle; // 0x3a0(0x08)
	struct FCrowShopTableRow ShopTableRow; // 0x3a8(0x78)
	struct FCrowItemData ItemData; // 0x420(0x30)
	char pad_450[0x40]; // 0x450(0x40)

	void OnUnhover(); // Function CrowFPS.CrowCustomizeEmotionSlotWidget.OnUnhover // (Final|Native|Protected) // @ game+0x18f2e70
	void OnHover(); // Function CrowFPS.CrowCustomizeEmotionSlotWidget.OnHover // (Final|Native|Protected) // @ game+0x18f2970
	void OnDelayHover(); // Function CrowFPS.CrowCustomizeEmotionSlotWidget.OnDelayHover // (Final|Native|Protected) // @ game+0x18f2680
	void OnClick(); // Function CrowFPS.CrowCustomizeEmotionSlotWidget.OnClick // (Final|Native|Protected) // @ game+0x18f1da0
};

// Class CrowFPS.CrowCustomizeEtcDescWidget
// Size: 0x390 (Inherited: 0x348)
struct UCrowCustomizeEtcDescWidget : UCrowWidgetBase {
	struct UCrowCustomSprayItemListWidget* WB_Cutomize_SprayList; // 0x348(0x08)
	struct UCrowRadialMenuSprayWidget* WB_Customize_SprayRadialMenu; // 0x350(0x08)
	struct UCrowTabOutfitWidget* WB_Customize_TopMenu; // 0x358(0x08)
	struct UCrowButton* BT_AddShoppingBag; // 0x360(0x08)
	struct UCrowButton* BT_Buy; // 0x368(0x08)
	struct UCrowShopPurchasePopup* WB_Shop_Popup_ExclusivePurchase; // 0x370(0x08)
	struct UCrowShoppingBagWidget* WB_Shop_Popup_ExclusivePurchase_Quick; // 0x378(0x08)
	struct UHorizontalBox* HB_CustomizeSpray_Shop_Button; // 0x380(0x08)
	char pad_388[0x4]; // 0x388(0x04)
	bool IsOwnList; // 0x38c(0x01)
	char pad_38D[0x3]; // 0x38d(0x03)

	void OnClose_ShopPopup(bool IsConfirm); // Function CrowFPS.CrowCustomizeEtcDescWidget.OnClose_ShopPopup // (Final|Native|Public) // @ game+0x18f25f0
	void OnClicked_BT_Buy(); // Function CrowFPS.CrowCustomizeEtcDescWidget.OnClicked_BT_Buy // (Final|Native|Protected) // @ game+0x18f1f70
	void OnClicked_BT_AddShoppingBag(); // Function CrowFPS.CrowCustomizeEtcDescWidget.OnClicked_BT_AddShoppingBag // (Final|Native|Protected) // @ game+0x18f1eb0
	void OnChangeTopMenuState(char SelectIndex); // Function CrowFPS.CrowCustomizeEtcDescWidget.OnChangeTopMenuState // (Final|Native|Public) // @ game+0x18f1d20
};

// Class CrowFPS.CrowCustomizeItemDescWidget
// Size: 0x1900 (Inherited: 0x348)
struct UCrowCustomizeItemDescWidget : UCrowWidgetBase {
	struct UCanvasPanel* CP_Lobby_MOD; // 0x348(0x08)
	struct UTextBlock* TB_Item_Category; // 0x350(0x08)
	struct UTextBlock* TB_AmmoType; // 0x358(0x08)
	struct UTextBlock* TB_ItemName; // 0x360(0x08)
	struct URichTextBlock* TB_ItemCompare; // 0x368(0x08)
	struct UMultiLineEditableText* MLETB_ItemDesc; // 0x370(0x08)
	struct UVerticalBox* VB_ItemName; // 0x378(0x08)
	struct UHorizontalBox* HB_WeaponParts; // 0x380(0x08)
	struct UHorizontalBox* HB_AmmoType; // 0x388(0x08)
	struct UCanvasPanel* CP_WeaponStatus; // 0x390(0x08)
	struct UCanvasPanel* CP_WeaponStat; // 0x398(0x08)
	struct UVerticalBox* VB_WeaponInfo; // 0x3a0(0x08)
	struct UVerticalBox* VB_WeaponProgress; // 0x3a8(0x08)
	struct UTextBlock* TB_FireMode; // 0x3b0(0x08)
	struct UHorizontalBox* HB_FireModeIcon; // 0x3b8(0x08)
	struct UCrowWidgetImage* IMG_FireMode_Semiauto; // 0x3c0(0x08)
	struct UCrowWidgetImage* IMG_FireMode_Burst; // 0x3c8(0x08)
	struct UCrowWidgetImage* IMG_FireMode_auto; // 0x3d0(0x08)
	struct UTextBlock* TB_Ammo; // 0x3d8(0x08)
	struct UTextBlock* TB_AmmoCount; // 0x3e0(0x08)
	struct UTextBlock* TB_Damage; // 0x3e8(0x08)
	struct UProgressBar* PB_Damage; // 0x3f0(0x08)
	struct UProgressBar* PB_Damage_Compare; // 0x3f8(0x08)
	struct UTextBlock* TB_Accuracy; // 0x400(0x08)
	struct UProgressBar* PB_Accuracy; // 0x408(0x08)
	struct UProgressBar* PB_Accuracy_Compare; // 0x410(0x08)
	struct UTextBlock* TB_Control; // 0x418(0x08)
	struct UProgressBar* PB_Control; // 0x420(0x08)
	struct UProgressBar* PB_Control_Compare; // 0x428(0x08)
	struct UTextBlock* TB_FireSpeed; // 0x430(0x08)
	struct UProgressBar* PB_FireSpeed; // 0x438(0x08)
	struct UProgressBar* PB_FireSpeed_Compare; // 0x440(0x08)
	struct UTextBlock* TB_Distance; // 0x448(0x08)
	struct UProgressBar* PB_Distance; // 0x450(0x08)
	struct UProgressBar* PB_Distance_Compare; // 0x458(0x08)
	struct UTextBlock* TB_Reload; // 0x460(0x08)
	struct UProgressBar* PB_Reload; // 0x468(0x08)
	struct UProgressBar* PB_Reload_Compare; // 0x470(0x08)
	struct UCrowButton* WB_BT_MOD; // 0x478(0x08)
	struct UCrowButton* WB_BT_ARMORY; // 0x480(0x08)
	struct UCrowButton* WB_BT_Back; // 0x488(0x08)
	struct UCrowButton* WB_BT_Home; // 0x490(0x08)
	struct UCrowButton* WB_BT_RESET; // 0x498(0x08)
	struct UCrowButton* WB_BT_LevelJump; // 0x4a0(0x08)
	struct UHorizontalBox* HB_Tutorial_Customize; // 0x4a8(0x08)
	struct UCrowLobbyLoadoutListWidget* WB_Lobby_LoadoutList; // 0x4b0(0x08)
	struct UCrowLobbyLoadoutWidget* WB_Lobby_Loadout; // 0x4b8(0x08)
	struct UCrowWeaponPartsListWidget* WB_WeaponPartsList; // 0x4c0(0x08)
	struct UCanvasPanel* CP_PartAdditionalEffect; // 0x4c8(0x08)
	struct UVerticalBox* VB_Advantage; // 0x4d0(0x08)
	struct UCrowTabMenuWeaponCategoryWidget* WB_TabMenuWeaponCategory; // 0x4d8(0x08)
	struct UCrowTabMenuWeaponSettingWidget* WB_TabMenu_WeaponSetting; // 0x4e0(0x08)
	struct UCrowCustomizeCategryBigWidget* WB_TabMenuWeaponPartsCategory; // 0x4e8(0x08)
	struct UCrowCustomizeItemListWidget* WB_CustomizeItemlist; // 0x4f0(0x08)
	struct UCrowCustomizeWeaponAccWidget* WB_Customize_WeaponAcc; // 0x4f8(0x08)
	struct UCrowCustomizeWeaponNumSlotList* WB_Customize_WeaponAccNumberSlot; // 0x500(0x08)
	struct UCrowLobbyShopMenuTabWidget* WB_TabMenu_WeaponCategory; // 0x508(0x08)
	struct UHorizontalBox* HB_CustomizeWeapon_Shop_Button; // 0x510(0x08)
	struct UCrowShopPurchasePopup* WB_Shop_Popup_ExclusivePurchase; // 0x518(0x08)
	struct UCrowShoppingBagWidget* WB_Shop_Popup_ExclusivePurchase_Quick; // 0x520(0x08)
	struct UCrowButton* BT_AddShoppingBag; // 0x528(0x08)
	struct UCrowButton* BT_Buy; // 0x530(0x08)
	struct UCrowWeaponLevelJumpPopupWidget* WB_WeaponLevelJumpPopup; // 0x538(0x08)
	struct UCrowLobbySlotPurchasePopupWidget* WB_LobbySlotPurchasePopup; // 0x540(0x08)
	struct FLinearColor NormalColor; // 0x548(0x10)
	struct FLinearColor IncreaseColor; // 0x558(0x10)
	struct FLinearColor DecreaseColor; // 0x568(0x10)
	struct FCrowWeaponData CurrentWeaponData; // 0x578(0x168)
	struct FCrowWeaponTableRow WeaponItemTable; // 0x6e0(0x11e0)
	struct ACrowSceneLobby* SceneLobby; // 0x18c0(0x08)
	struct ACrowSceneGame* SceneGame; // 0x18c8(0x08)
	struct UCrowInventoryInputEventHandler* SelectDragWidget; // 0x18d0(0x08)
	float ProgressMaxValue; // 0x18d8(0x04)
	bool StatusMoved; // 0x18dc(0x01)
	bool IsCustomizeSticker; // 0x18dd(0x01)
	char pad_18DE[0x2]; // 0x18de(0x02)
	struct TArray<struct UTextBlock*> PartsOptionArray; // 0x18e0(0x10)
	bool IsWeaponCustomizeMode; // 0x18f0(0x01)
	char pad_18F1[0x7]; // 0x18f1(0x07)
	struct UCrowCustomizeWeaponAccSlotWidget* CurrentWeaponAccSlotWidget; // 0x18f8(0x08)

	void OnCloseWeaponLevelJumpPopup(struct FCrowWeaponData WeaponData); // Function CrowFPS.CrowCustomizeItemDescWidget.OnCloseWeaponLevelJumpPopup // (Final|Native|Public) // @ game+0x18f22a0
	void OnCloseShopPopup(bool IsBuy); // Function CrowFPS.CrowCustomizeItemDescWidget.OnCloseShopPopup // (Final|Native|Public) // @ game+0x18f2210
	void OnClicked_Tab_ShopModeChange(bool IsShop); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_Tab_ShopModeChange // (Final|Native|Protected) // @ game+0x18f2180
	void OnClicked_BT_RESET(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_RESET // (Final|Native|Protected) // @ game+0x18f2090
	void OnClicked_BT_MOD(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_MOD // (Final|Native|Protected) // @ game+0x18f2070
	void OnClicked_BT_LevelJump(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_LevelJump // (Final|Native|Protected) // @ game+0x18f2050
	void OnClicked_BT_Home(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_Home // (Final|Native|Protected) // @ game+0x18f2030
	void OnClicked_BT_Change(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_Change // (Final|Native|Protected) // @ game+0x18f1ff0
	void OnClicked_BT_BuyWeapon(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_BuyWeapon // (Final|Native|Public) // @ game+0x18f1fb0
	void OnClicked_BT_Buy(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_Buy // (Final|Native|Public) // @ game+0x18f1f90
	void OnClicked_BT_Back(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_Back // (Final|Native|Protected) // @ game+0x18f1f10
	void OnClicked_BT_ARMORY(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_ARMORY // (Final|Native|Protected) // @ game+0x18f1e50
	void OnClicked_BT_AddShoppingBag(); // Function CrowFPS.CrowCustomizeItemDescWidget.OnClicked_BT_AddShoppingBag // (Final|Native|Protected) // @ game+0x18f1ed0
};

// Class CrowFPS.CrowCustomizeItemListMiniWidget
// Size: 0x368 (Inherited: 0x348)
struct UCrowCustomizeItemListMiniWidget : UCrowWidgetBase {
	struct UGridPanel* GD_ItemList; // 0x348(0x08)
	struct ACrowSceneLobby* SceneLobby; // 0x350(0x08)
	struct UCrowCategorySlotBigWidget* CurrentCategorySlotBigWidget; // 0x358(0x08)
	bool NotSave; // 0x360(0x01)
	char pad_361[0x7]; // 0x361(0x07)
};

// Class CrowFPS.CrowCustomizeItemListWidget
// Size: 0x390 (Inherited: 0x348)
struct UCrowCustomizeItemListWidget : UCrowWidgetBase {
	struct UScrollBox* SCB_Itemlist; // 0x348(0x08)
	struct UTextBlock* TB_Title; // 0x350(0x08)
	struct UCrowItemSlotWidget* ItemSlotWidgetClass; // 0x358(0x08)
	struct ACrowSceneLobby* SceneLobby; // 0x360(0x08)
	struct ACrowSceneGame* SceneGame; // 0x368(0x08)
	struct UCrowCategorySlotBigWidget* CurrentCategorySlotBigWidget; // 0x370(0x08)
	enum class ECrowWeaponUIType CurrentWeaponUIType; // 0x378(0x01)
	char pad_379[0x7]; // 0x379(0x07)
	struct UCrowItemSlotWidget* SelectedWidgetItem; // 0x380(0x08)
	char pad_388[0x1]; // 0x388(0x01)
	bool NotSave; // 0x389(0x01)
	bool IsShopMode; // 0x38a(0x01)
	char pad_38B[0x1]; // 0x38b(0x01)
	float ItemSize; // 0x38c(0x04)
};

// Class CrowFPS.CrowCustomizeOutfitSlotWidget
// Size: 0x658 (Inherited: 0x348)
struct UCrowCustomizeOutfitSlotWidget : UCrowWidgetBase {
	struct UImage* IMG_Selected; // 0x348(0x08)
	struct UImage* IMG_Equiped; // 0x350(0x08)
	struct UImage* IMG_NewIcon; // 0x358(0x08)
	struct UCrowButton* BT_Customize_List_Slot; // 0x360(0x08)
	struct UTextBlock* TB_ItemName; // 0x368(0x08)
	struct UWidgetSwitcher* WS_IconIMG; // 0x370(0x08)
	struct UImage* IMG_IconIMG_OutFit; // 0x378(0x08)
	struct UImage* IMG_IconIMG_Appearance; // 0x380(0x08)
	struct UImage* IMG_MoneyIcon; // 0x388(0x08)
	struct UImage* IMG_MoneyBack; // 0x390(0x08)
	struct UTextBlock* TB_Label_Money; // 0x398(0x08)
	struct UHorizontalBox* HB_Cost; // 0x3a0(0x08)
	struct UWidgetSwitcher* WS_Grade; // 0x3a8(0x08)
	struct UCanvasPanel* CP_RewardPanel; // 0x3b0(0x08)
	struct UCanvasPanel* CP_Count; // 0x3b8(0x08)
	struct UTextBlock* TB_ItemCount; // 0x3c0(0x08)
	struct UPaperSprite* GPointIcon; // 0x3c8(0x08)
	struct UPaperSprite* RCPIcon; // 0x3d0(0x08)
	char pad_3D8[0x40]; // 0x3d8(0x40)
	struct UTextBlock* TBItemName_Sel; // 0x418(0x08)
	bool Selected; // 0x420(0x01)
	bool Equiped; // 0x421(0x01)
	bool useDeselect; // 0x422(0x01)
	bool IsShopItem; // 0x423(0x01)
	int32_t SlotValue; // 0x424(0x04)
	int32_t IntValue; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FCrowItemTableBaseRow CurrentItemTable; // 0x430(0x168)
	struct FCrowItemData CurrentItemData; // 0x598(0x30)
	enum class ECrowCustomizeCategoryType CurrentItemSlotType; // 0x5c8(0x01)
	enum class ECrowCharacterAppearanceType AppearanceCategoryType; // 0x5c9(0x01)
	char pad_5CA[0x6]; // 0x5ca(0x06)
	struct ACrowSceneLobby* SceneLobby; // 0x5d0(0x08)
	struct FCrowShopTableRow ShopTableData; // 0x5d8(0x78)
	int32_t GridRow; // 0x650(0x04)
	char pad_654[0x4]; // 0x654(0x04)

	void OnUnHovered_ItemSlot(); // Function CrowFPS.CrowCustomizeOutfitSlotWidget.OnUnHovered_ItemSlot // (Final|Native|Protected) // @ game+0x18f6b10
	void OnHovered_ItemSlot(); // Function CrowFPS.CrowCustomizeOutfitSlotWidget.OnHovered_ItemSlot // (Final|Native|Protected) // @ game+0x18f6a20
	void OnClicked_ItemSlot(); // Function CrowFPS.CrowCustomizeOutfitSlotWidget.OnClicked_ItemSlot // (Final|Native|Protected) // @ game+0x18f6860
};

// Class CrowFPS.CrowCustomizeSpraySlotWidget
// Size: 0x680 (Inherited: 0x348)
struct UCrowCustomizeSpraySlotWidget : UCrowWidgetBase {
	struct UImage* IMG_Icon; // 0x348(0x08)
	struct UImage* IMG_Lock; // 0x350(0x08)
	struct UImage* IMG_Equiped; // 0x358(0x08)
	struct UImage* IMG_Selected; // 0x360(0x08)
	struct UImage* IMG_NewIcon; // 0x368(0x08)
	struct UWidgetSwitcher* WS_Grade; // 0x370(0x08)
	struct UCrowButton* BT_Customize_Spray_Slot; // 0x378(0x08)
	struct UCanvasPanel* CP_Cost; // 0x380(0x08)
	struct UTextBlock* TB_Label_Money; // 0x388(0x08)
	char pad_390[0x273]; // 0x390(0x273)
	bool IsShopMode; // 0x603(0x01)
	char pad_604[0x4]; // 0x604(0x04)
	struct FCrowShopTableRow CurrentShopTable; // 0x608(0x78)

	void OnClieck_Slot(); // Function CrowFPS.CrowCustomizeSpraySlotWidget.OnClieck_Slot // (Final|Native|Public) // @ game+0x18f69c0
};

// Class CrowFPS.CrowCustomizeWeaponAccSlotWidget
// Size: 0x460 (Inherited: 0x348)
struct UCrowCustomizeWeaponAccSlotWidget : UCrowWidgetBase {
	struct UImage* IMG_Selected; // 0x348(0x08)
	struct UImage* IMG_Equiped; // 0x350(0x08)
	struct UImage* IMG_Lock; // 0x358(0x08)
	struct UImage* IMG_Icon; // 0x360(0x08)
	struct UWidgetSwitcher* WS_Grade; // 0x368(0x08)
	struct UCrowButton* BT_WeaponAccSlot; // 0x370(0x08)
	struct UTextBlock* TB_Name; // 0x378(0x08)
	struct UCanvasPanel* CP_Cost; // 0x380(0x08)
	struct UTextBlock* TB_Label_Money; // 0x388(0x08)
	char pad_390[0x40]; // 0x390(0x40)
	bool Selected; // 0x3d0(0x01)
	bool Equiped; // 0x3d1(0x01)
	bool useDeselect; // 0x3d2(0x01)
	bool Locked; // 0x3d3(0x01)
	uint32_t AccIndex; // 0x3d4(0x04)
	enum class ECrowWeaponAccType AccType; // 0x3d8(0x01)
	char pad_3D9[0x3]; // 0x3d9(0x03)
	struct FCrowWeaponStickerInfo StickerInfo; // 0x3dc(0x08)
	char pad_3E4[0x4]; // 0x3e4(0x04)
	struct FCrowShopTableRow ShopTableData; // 0x3e8(0x78)

	void OnUnHovered_AccSlot(); // Function CrowFPS.CrowCustomizeWeaponAccSlotWidget.OnUnHovered_AccSlot // (Final|Native|Protected) // @ game+0x18f6af0
	void OnHovered_AccSlot(); // Function CrowFPS.CrowCustomizeWeaponAccSlotWidget.OnHovered_AccSlot // (Final|Native|Protected) // @ game+0x18f6a00
	void OnClicked_AccSlot(); // Function CrowFPS.CrowCustomizeWeaponAccSlotWidget.OnClicked_AccSlot // (Final|Native|Protected) // @ game+0x18f67e0
};

// Class CrowFPS.CrowCustomizeWeaponAccWidget
// Size: 0x390 (Inherited: 0x348)
struct UCrowCustomizeWeaponAccWidget : UCrowWidgetBase {
	struct UGridPanel* GD_SlotList; // 0x348(0x08)
	struct UScrollBox* SCB_Itemlist; // 0x350(0x08)
	struct UCrowCustomizeWeaponAccSlotWidget* WeaponAccSlotWidgetClass; // 0x358(0x08)
	struct ACrowSceneLobby* SceneLobby; // 0x360(0x08)
	struct ACrowSceneGame* SceneGame; // 0x368(0x08)
	struct TArray<struct UCrowCustomizeWeaponAccSlotWidget*> WeaponAccSlotWidgetArray; // 0x370(0x10)
	struct FCrowWeaponStickerInfo CurrentStickerSlotInfo; // 0x380(0x08)
	enum class ECrowWeaponAccType CurrentAccType; // 0x388(0x01)
	bool IsShopMode; // 0x389(0x01)
	char pad_38A[0x6]; // 0x38a(0x06)
};

// Class CrowFPS.CrowCustomizeWeaponNumSlotList
// Size: 0x370 (Inherited: 0x348)
struct UCrowCustomizeWeaponNumSlotList : UCrowWidgetBase {
	struct UHorizontalBox* HB_Buttons; // 0x348(0x08)
	struct TArray<struct UCrowCustomizeWeaponNumSlotWidget*> ButtonList; // 0x350(0x10)
	struct ACrowSceneLobby* SceneLobby; // 0x360(0x08)
	struct ACrowSceneGame* SceneGame; // 0x368(0x08)

	void OnSelectCustomizeNumSlot(struct UCrowCustomizeWeaponNumSlotWidget* SelectSlot); // Function CrowFPS.CrowCustomizeWeaponNumSlotList.OnSelectCustomizeNumSlot // (Final|Native|Protected) // @ game+0x18f6a40
};

// Class CrowFPS.CrowCustomizeWeaponNumSlotWidget
// Size: 0x3b8 (Inherited: 0x348)
struct UCrowCustomizeWeaponNumSlotWidget : UCrowWidgetBase {
	struct UTextBlock* TB_Number; // 0x348(0x08)
	struct UImage* IMG_Acc; // 0x350(0x08)
	struct UImage* IMG_Hover; // 0x358(0x08)
	struct UImage* IMG_Select; // 0x360(0x08)
	struct UCrowButton* BT_Customize_WeaponAccNumberSlot; // 0x368(0x08)
	struct UWidgetSwitcher* WS_NumberEquip; // 0x370(0x08)
	char pad_378[0x30]; // 0x378(0x30)
	struct FCrowWeaponStickerInfo SlotInfo; // 0x3a8(0x08)
	bool bIsSelect; // 0x3b0(0x01)
	char pad_3B1[0x7]; // 0x3b1(0x07)

	void SetSelect(bool IsSelect); // Function CrowFPS.CrowCustomizeWeaponNumSlotWidget.SetSelect // (Final|Native|Public) // @ game+0x18f6c50
	void SetButtonNumber(int32_t Index); // Function CrowFPS.CrowCustomizeWeaponNumSlotWidget.SetButtonNumber // (Final|Native|Public) // @ game+0x18f6bc0
	void SetAccImage(struct UPaperSprite* AccImage); // Function CrowFPS.CrowCustomizeWeaponNumSlotWidget.SetAccImage // (Final|Native|Public) // @ game+0x18f6b30
	void OnUnHover_NumSlot(); // Function CrowFPS.CrowCustomizeWeaponNumSlotWidget.OnUnHover_NumSlot // (Final|Native|Private) // @ game+0x18f6ad0
	void OnHover_NumSlot(); // Function CrowFPS.CrowCustomizeWeaponNumSlotWidget.OnHover_NumSlot // (Final|Native|Private) // @ game+0x18f69e0
	void OnClicked_NumSlot(); // Function CrowFPS.CrowCustomizeWeaponNumSlotWidget.OnClicked_NumSlot // (Final|Native|Private) // @ game+0x18f6880
	void InitButtonInfo(struct FCrowWeaponStickerInfo StickerSlotInfo); // Function CrowFPS.CrowCustomizeWeaponNumSlotWidget.InitButtonInfo // (Final|Native|Public) // @ game+0x18f6750
	struct UCrowWeaponModel* GetWeaponModel(); // Function CrowFPS.CrowCustomizeWeaponNumSlotWidget.GetWeaponModel // (Final|Native|Private) // @ game+0x18f6720
	struct UCrowButton* GetButton(); // Function CrowFPS.CrowCustomizeWeaponNumSlotWidget.GetButton // (Final|Native|Public) // @ game+0x18f66f0
};

// Class CrowFPS.CrowCustomModeManager
// Size: 0x148 (Inherited: 0x28)
struct UCrowCustomModeManager : UObject {
	struct TArray<struct FCrowCustomDisplayRoomInfo> CustomDisplayRoomInfoArray; // 0x28(0x10)
	struct FCrowCustomRoomInfo CurrentCustomRoomInfo; // 0x38(0xb8)
	struct TMap<uint64_t, struct FCrowCustomModeInvitation> ReceivedCustomModeInvitationMap; // 0xf0(0x50)
	bool IsStart; // 0x140(0x01)
	char pad_141[0x7]; // 0x141(0x07)
};

// Class CrowFPS.CrowCustomOutfitItemListWidget
// Size: 0x398 (Inherited: 0x348)
struct UCrowCustomOutfitItemListWidget : UCrowWidgetBase {
	struct UGridPanel* GD_ItemList; // 0x348(0x08)
	struct UScrollBox* SCB_Itemlist; // 0x350(0x08)
	struct UTextBlock* TB_Title; // 0x358(0x08)
	struct UCrowClothItemDescWidget* WB_Function_Tooltip; // 0x360(0x08)
	struct UCrowCustomizeOutfitSlotWidget* CustomizeOutfitSlotWidgetClass; // 0x368(0x08)
	struct ACrowSceneLobby* SceneLobby; // 0x370(0x08)
	struct UCrowCategorySlotSmallWidget* CurrentCategorySlotSmallWidget; // 0x378(0x08)
	bool IsOwnMode; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)
	struct UCrowCustomizeOutfitSlotWidget* ShopModeSelectItem; // 0x388(0x08)
	float ItemSize; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)
};

// Class CrowFPS.CrowCustomPasswordPopupWidget
// Size: 0x3b0 (Inherited: 0x348)
struct UCrowCustomPasswordPopupWidget : UCrowWidgetBase {
	struct UTextBlock* TB_SessionName_Value; // 0x348(0x08)
	struct UEditableTextBox* ETB_Password; // 0x350(0x08)
	struct UCrowButton* BT_Ok; // 0x358(0x08)
	struct UCrowButton* BT_Cancel; // 0x360(0x08)
	struct FCrowCustomDisplayRoomInfo SelectedRoomInfo; // 0x368(0x48)

	void OnClicked_BT_Ok(); // Function CrowFPS.CrowCustomPasswordPopupWidget.OnClicked_BT_Ok // (Final|Native|Protected) // @ game+0x18f6820
	void OnClicked_BT_Cancel(); // Function CrowFPS.CrowCustomPasswordPopupWidget.OnClicked_BT_Cancel // (Final|Native|Protected) // @ game+0x18c8830
};

// Class CrowFPS.CrowCustomSettingSlotWidget
// Size: 0x390 (Inherited: 0x348)
struct UCrowCustomSettingSlotWidget : UCrowWidgetBase {
	struct UTextBlock* TB_SlotName; // 0x348(0x08)
	struct UTextBlock* TB_SelectedItem; // 0x350(0x08)
	struct UCrowButton* BT_Prev; // 0x358(0x08)
	struct UCrowButton* BT_Next; // 0x360(0x08)
	struct FText SlotName; // 0x368(0x18)
	char pad_380[0x10]; // 0x380(0x10)

	void OnClicked_BT_Prev(); // Function CrowFPS.CrowCustomSettingSlotWidget.OnClicked_BT_Prev // (Final|Native|Protected) // @ game+0x18f6840
	void OnClicked_BT_Next(); // Function CrowFPS.CrowCustomSettingSlotWidget.OnClicked_BT_Next // (Final|Native|Protected) // @ game+0x18f6800
};

// Class CrowFPS.CrowCustomSprayItemListWidget
// Size: 0x370 (Inherited: 0x348)
struct UCrowCustomSprayItemListWidget : UCrowWidgetBase {
	char pad_348[0x8]; // 0x348(0x08)
	struct UCrowCustomizeSpraySlotWidget* SpraySlotWidgetClass; // 0x350(0x08)
	struct UGridPanel* GD_ItemList; // 0x358(0x08)
	struct UCrowCustomizeEtcDescWidget* ParentWidget; // 0x360(0x08)
	struct UCrowCustomizeSpraySlotWidget* CurrSelectSlot; // 0x368(0x08)

	void OnClicked_SpraySlot(struct UCrowCustomizeSpraySlotWidget* InSlot); // Function CrowFPS.CrowCustomSprayItemListWidget.OnClicked_SpraySlot // (Final|Native|Public) // @ game+0x18f6930
	void OnClicked_ShopSlotlot(struct UCrowCustomizeSpraySlotWidget* InSlot); // Function CrowFPS.CrowCustomSprayItemListWidget.OnClicked_ShopSlotlot // (Final|Native|Public) // @ game+0x18f68a0
};

// Class CrowFPS.CrowCustomSquadSlotWidget
// Size: 0x388 (Inherited: 0x348)
struct UCrowCustomSquadSlotWidget : UCrowWidgetBase {
	struct UTextBlock* TB_SquadName; // 0x348(0x08)
	struct UCrowCustomUserSlotWidget* WB_CustomUserSlot_2; // 0x350(0x08)
	struct UCrowCustomUserSlotWidget* WB_CustomUserSlot_3; // 0x358(0x08)
	struct UCrowCustomUserSlotWidget* WB_CustomUserSlot_4; // 0x360(0x08)
	struct UCrowCustomUserSlotWidget* WB_CustomUserSlot_5; // 0x368(0x08)
	enum class ECrowCustomTeamType TeamType; // 0x370(0x01)
	char SquadIndex; // 0x371(0x01)
	char pad_372[0x6]; // 0x372(0x06)
	struct TArray<struct UCrowCustomUserSlotWidget*> CustomUserSlotArray; // 0x378(0x10)
};

// Class CrowFPS.CrowCustomUserSlotWidget
// Size: 0x3f8 (Inherited: 0x348)
struct UCrowCustomUserSlotWidget : UCrowWidgetBase {
	struct UCrowToggleButton* BT_Toggle; // 0x348(0x08)
	struct UCrowButton* BT_Change; // 0x350(0x08)
	struct UCrowButton* BT_Profile; // 0x358(0x08)
	struct UCrowButton* BT_Kick; // 0x360(0x08)
	struct UCrowWidgetImage* IMG_SessionLeader; // 0x368(0x08)
	struct UTextBlock* TB_Username; // 0x370(0x08)
	struct UWidgetSwitcher* WS_Status; // 0x378(0x08)
	char pad_380[0x50]; // 0x380(0x50)
	enum class ECrowCustomTeamType TeamType; // 0x3d0(0x01)
	char SquadIndex; // 0x3d1(0x01)
	char SlotIndex; // 0x3d2(0x01)
	char pad_3D3[0x5]; // 0x3d3(0x05)
	struct FCrowCustomUserInfo CustomUserInfo; // 0x3d8(0x20)

	void OnUnHovered_UserSlot(); // Function CrowFPS.CrowCustomUserSlotWidget.OnUnHovered_UserSlot // (Final|Native|Protected) // @ game+0x18fa080
	void OnHovered_UserSlot(); // Function CrowFPS.CrowCustomUserSlotWidget.OnHovered_UserSlot // (Final|Native|Protected) // @ game+0x18f9df0
	void OnClicked_BT_Profile(); // Function CrowFPS.CrowCustomUserSlotWidget.OnClicked_BT_Profile // (Final|Native|Protected) // @ game+0x18f9820
	void OnClicked_BT_Kick(); // Function CrowFPS.CrowCustomUserSlotWidget.OnClicked_BT_Kick // (Final|Native|Protected) // @ game+0x18f9750
	void OnClicked_BT_Change(); // Function CrowFPS.CrowCustomUserSlotWidget.OnClicked_BT_Change // (Final|Native|Protected) // @ game+0x18f95e0
	void OnChangeedStateToggle(bool IsChecked); // Function CrowFPS.CrowCustomUserSlotWidget.OnChangeedStateToggle // (Final|Native|Protected) // @ game+0x18f9390
};

// Class CrowFPS.CrowCustomWaitingRoomSlotWidget
// Size: 0x418 (Inherited: 0x348)
struct UCrowCustomWaitingRoomSlotWidget : UCrowWidgetBase {
	struct UCrowToggleButton* BT_RoomSlot; // 0x348(0x08)
	struct UImage* IMG_Deselec_01; // 0x350(0x08)
	struct UImage* IMG_Deselect_02; // 0x358(0x08)
	struct UImage* IMG_DeselecLock; // 0x360(0x08)
	struct UImage* IMG_SelectLock; // 0x368(0x08)
	struct UTextBlock* TB_RoomName; // 0x370(0x08)
	struct UTextBlock* TB_ModeName; // 0x378(0x08)
	struct UTextBlock* TB_MapName; // 0x380(0x08)
	struct UTextBlock* TB_UserCount; // 0x388(0x08)
	struct UTextBlock* TB_State; // 0x390(0x08)
	struct UTextBlock* TB_RoomName_Select; // 0x398(0x08)
	struct UTextBlock* TB_ModeName_Select; // 0x3a0(0x08)
	struct UTextBlock* TB_MapName_Select; // 0x3a8(0x08)
	struct UTextBlock* TB_UserCount_Select; // 0x3b0(0x08)
	struct UTextBlock* TB_State_Select; // 0x3b8(0x08)
	char pad_3C0[0x10]; // 0x3c0(0x10)
	struct FCrowCustomDisplayRoomInfo SelectedRoomInfo; // 0x3d0(0x48)

	void OnChangeedStateToggle(bool IsChecked); // Function CrowFPS.CrowCustomWaitingRoomSlotWidget.OnChangeedStateToggle // (Final|Native|Protected) // @ game+0x18f9420
};

// Class CrowFPS.CrowCustomWaitingRoomWidget
// Size: 0x748 (Inherited: 0x348)
struct UCrowCustomWaitingRoomWidget : UCrowWidgetBase {
	struct UCrowCustomWaitingRoomSlotWidget* CustomWaitingRoomSlotClass; // 0x348(0x08)
	struct UCrowCustomUserSlotWidget* CustomUserSlotWidgetClass; // 0x350(0x08)
	float RoomListRefreshTime; // 0x358(0x04)
	uint32_t MinUser; // 0x35c(0x04)
	uint32_t TeamMinUser; // 0x360(0x04)
	char pad_364[0x4]; // 0x364(0x04)
	struct UWidgetSwitcher* WS_CustomMod; // 0x368(0x08)
	struct UMultiLineEditableText* EDB_SearchCustomName; // 0x370(0x08)
	struct UCrowButton* BT_Refresh; // 0x378(0x08)
	struct UCrowSortButtonWidget* WB_Button_Sorting_Room; // 0x380(0x08)
	struct UCrowSortButtonWidget* WB_Button_Sorting_Mode; // 0x388(0x08)
	struct UCrowSortButtonWidget* WB_Button_Sorting_Map; // 0x390(0x08)
	struct UCrowSortButtonWidget* WB_Button_Sorting_UserCount; // 0x398(0x08)
	struct UCrowSortButtonWidget* WB_Button_Sorting_State; // 0x3a0(0x08)
	struct UVerticalBox* VB_FilterState; // 0x3a8(0x08)
	struct UVerticalBox* VB_FilterMode; // 0x3b0(0x08)
	struct UVerticalBox* VB_FilterMaxUser; // 0x3b8(0x08)
	struct UVerticalBox* VB_FilterRemainSlot; // 0x3c0(0x08)
	struct UScrollBox* SB_SessionList; // 0x3c8(0x08)
	struct UCrowButton* BT_Join; // 0x3d0(0x08)
	struct UCrowButton* BT_Create; // 0x3d8(0x08)
	struct UCrowButton* BT_WaitingRoomExit; // 0x3e0(0x08)
	struct UCrowToggleButton* BT_Customfilter; // 0x3e8(0x08)
	struct UCanvasPanel* CP_FilterPopup; // 0x3f0(0x08)
	struct UCrowButton* BT_FilterCancel; // 0x3f8(0x08)
	struct UCrowButton* BT_FilterOK; // 0x400(0x08)
	struct UWidgetSwitcher* WS_SwitchMod; // 0x408(0x08)
	struct UVerticalBox* VB_Ateam; // 0x410(0x08)
	struct UVerticalBox* VB_Bteam; // 0x418(0x08)
	struct UScrollBox* SB_SquadList; // 0x420(0x08)
	struct UVerticalBox* VB_SquadList; // 0x428(0x08)
	struct UCanvasPanel* CP_Spctating; // 0x430(0x08)
	struct UGridPanel* GP_SpectatingList; // 0x438(0x08)
	struct UCanvasPanel* CP_unassigned; // 0x440(0x08)
	struct UGridPanel* GP_unassignedList; // 0x448(0x08)
	struct UCrowButton* BT_Setting; // 0x450(0x08)
	struct UCrowButton* BT_Invite; // 0x458(0x08)
	struct UCrowButton* BT_Exit; // 0x460(0x08)
	struct UCanvasPanel* CP_CustomListDesc; // 0x468(0x08)
	struct UCrowWidgetImage* IMG_Map; // 0x470(0x08)
	struct UTextBlock* TB_RoomName; // 0x478(0x08)
	struct UTextBlock* TB_ModeName; // 0x480(0x08)
	struct UTextBlock* TB_MapName; // 0x488(0x08)
	struct UTextBlock* TB_RoomOnwer; // 0x490(0x08)
	struct UTextBlock* TB_UserCount; // 0x498(0x08)
	struct UTextBlock* TB_PlayTime; // 0x4a0(0x08)
	struct UHorizontalBox* HB_WinPoint; // 0x4a8(0x08)
	struct UTextBlock* TB_WinPoint; // 0x4b0(0x08)
	struct UCrowCustomCreateRoomPopupWidget* WB_Custom_CreateSession_Popup; // 0x4b8(0x08)
	struct UCrowCustomInvitePopupWidget* WB_CustomInvitePopup; // 0x4c0(0x08)
	struct UCrowCustomPasswordPopupWidget* WB_CustomPasswordPopup; // 0x4c8(0x08)
	struct UCrowButton* BT_Play; // 0x4d0(0x08)
	enum class ECrowCustomMode CurrentCustomMode; // 0x4d8(0x01)
	char pad_4D9[0x7]; // 0x4d9(0x07)
	struct FCrowCustomDisplayRoomInfo SelectedRoomInfo; // 0x4e0(0x48)
	struct UCrowCustomUserSlotWidget* SelectedCustomUserSlot; // 0x528(0x08)
	struct FTimerHandle RoomListTimerHandle; // 0x530(0x08)
	uint64_t KickUserID; // 0x538(0x08)
	struct TArray<struct UCrowSortButtonWidget*> SortButtonList; // 0x540(0x10)
	struct FCrowCustomFilterInfo FilterInfo; // 0x550(0x0c)
	struct FCrowCustomFilterInfo FilterInfoTemp; // 0x55c(0x0c)
	struct TMap<char, struct UCrowCustomSquadSlotWidget*> CustomATeamSquadMap; // 0x568(0x50)
	struct TMap<char, struct UCrowCustomSquadSlotWidget*> CustomBTeamSquadMap; // 0x5b8(0x50)
	struct TMap<char, struct UCrowCustomSquadSlotWidget*> CustomSquadMap; // 0x608(0x50)
	struct TMap<char, struct UCrowCustomUserSlotWidget*> CustomWatcherMap; // 0x658(0x50)
	struct TMap<char, struct UCrowCustomUserSlotWidget*> CustomMisassignMap; // 0x6a8(0x50)
	struct TArray<struct UCrowCustomFilterSlotWidge*> FilterSlotStateArray; // 0x6f8(0x10)
	struct TArray<struct UCrowCustomFilterSlotWidge*> FilterSlotGameModeArray; // 0x708(0x10)
	struct TArray<struct UCrowCustomFilterSlotWidge*> FilterSlotMaxUserArray; // 0x718(0x10)
	struct TArray<struct UCrowCustomFilterSlotWidge*> FilterSlotReaminSlotArray; // 0x728(0x10)
	struct FString SearchName; // 0x738(0x10)

	void OnInputChanged_SearchCustomName(struct FText InputText); // Function CrowFPS.CrowCustomWaitingRoomWidget.OnInputChanged_SearchCustomName // (Final|Native|Protected|HasOutParms) // @ game+0x18f9e10
	void OnClickSortByUserCount(); // Function CrowFPS.CrowCustomWaitingRoomWidget.OnClickSortByUserCount // (Final|Native|Protected) // @ game+0x18f95c0
	void OnClickSortByState(); // Function CrowFPS.CrowCustomWaitingRoomWidget.OnClickSortByState // (Final|Native|Protected) // @ game+0x18f95a0
