// WidgetBlueprintGeneratedClass WB_CrossHairPreset.WB_CrossHairPreset_C
// Size: 0x2d0 (Inherited: 0x260)
struct UWB_CrossHairPreset_C : UUserWidget {
	struct UCrowButton* BT_Blue; // 0x260(0x08)
	struct UCrowButton* BT_Green; // 0x268(0x08)
	struct UCrowButton* BT_Navy; // 0x270(0x08)
	struct UCrowButton* BT_Orange; // 0x278(0x08)
	struct UCrowButton* BT_Red; // 0x280(0x08)
	struct UCrowButton* BT_Violet; // 0x288(0x08)
	struct UCrowButton* BT_Yellow; // 0x290(0x08)
	struct UImage* IMG_Blue_BackGround; // 0x298(0x08)
	struct UImage* IMG_Green_BackGround; // 0x2a0(0x08)
	struct UImage* IMG_Navy_BackGround; // 0x2a8(0x08)
	struct UImage* IMG_Navy_BackGround_2; // 0x2b0(0x08)
	struct UImage* IMG_Orange_BackGround; // 0x2b8(0x08)
	struct UImage* IMG_Red_BackGround; // 0x2c0(0x08)
	struct UImage* IMG_Yellow_BackGround; // 0x2c8(0x08)
};

