// WidgetBlueprintGeneratedClass WB_Loading.WB_Loading_C
// Size: 0x3d8 (Inherited: 0x398)
struct UWB_Loading_C : UCrowLoadingWidget {
	struct UWidgetAnimation* ANI_LoadingStart; // 0x398(0x08)
	struct UWidgetAnimation* ANI_Loading; // 0x3a0(0x08)
	struct UImage* Image_31; // 0x3a8(0x08)
	struct UImage* IMG_ContentBG; // 0x3b0(0x08)
	struct UCrowWidgetImage* IMG_Loading_In_2; // 0x3b8(0x08)
	struct UWB_LoadingModeDescSlot_C* WB_LoadingModeDescSlot_1; // 0x3c0(0x08)
	struct UWB_LoadingModeDescSlot_C* WB_LoadingModeDescSlot_2; // 0x3c8(0x08)
	struct UWB_LoadingModeDescSlot_C* WB_LoadingModeDescSlot_3; // 0x3d0(0x08)
};

