// WidgetBlueprintGeneratedClass WB_MatchingTimer.WB_MatchingTimer_C
// Size: 0x3f8 (Inherited: 0x3a8)
struct UWB_MatchingTimer_C : UCrowMatchingTimerWidget {
	struct UWidgetAnimation* Ani_Show; // 0x3a8(0x08)
	struct UImage* IMG_BackGround; // 0x3b0(0x08)
	struct UImage* IMG_BackGround_2; // 0x3b8(0x08)
	struct UImage* IMG_BG; // 0x3c0(0x08)
	struct UImage* IMG_Cancel_BackGround; // 0x3c8(0x08)
	struct UImage* IMG_Cancel_Hover; // 0x3d0(0x08)
	struct UImage* IMG_MatchingComplete_Bg; // 0x3d8(0x08)
	struct UImage* IMG_MatchingComplete_DecoT; // 0x3e0(0x08)
	struct UImage* MatchingComplete_DecoB; // 0x3e8(0x08)
	struct UTextBlock* TB_MenuTitle_2; // 0x3f0(0x08)
};

