// WidgetBlueprintGeneratedClass WB_MultiSystemMessage.WB_MultiSystemMessage_C
// Size: 0x3d8 (Inherited: 0x398)
struct UWB_MultiSystemMessage_C : UCrowMultiSystemMessageWidget {
	struct UWidgetAnimation* Ani_Fade_Out_3; // 0x398(0x08)
	struct UWidgetAnimation* Ani_Fade_Out_1; // 0x3a0(0x08)
	struct UWidgetAnimation* Ani_Fade_Out_2; // 0x3a8(0x08)
	struct UWidgetAnimation* Ani_Move_3; // 0x3b0(0x08)
	struct UWidgetAnimation* Ani_Move_2; // 0x3b8(0x08)
	struct UWidgetAnimation* Ani_Move_1; // 0x3c0(0x08)
	struct UImage* Image; // 0x3c8(0x08)
	struct UImage* Image_75; // 0x3d0(0x08)
};

