// WidgetBlueprintGeneratedClass WB_SettingsSlotKeyBinding.WB_SettingsSlotKeyBinding_C
// Size: 0x498 (Inherited: 0x440)
struct UWB_SettingsSlotKeyBinding_C : UCrowSettingsSlotKeyBindingWidget {
	struct UImage* IMG_BackGround; // 0x440(0x08)
	struct UImage* IMG_BackGround_2; // 0x448(0x08)
	struct UImage* IMG_BackGround_3; // 0x450(0x08)
	struct UImage* IMG_BackGround_Second_2; // 0x458(0x08)
	struct UImage* IMG_Blue00; // 0x460(0x08)
	struct UImage* IMG_Blue00_2; // 0x468(0x08)
	struct UImage* IMG_Blue00_3; // 0x470(0x08)
	struct UImage* IMG_ChangeKeyBackGround; // 0x478(0x08)
	struct UImage* IMG_ChangeKeyBackGround_2; // 0x480(0x08)
	struct UImage* IMG_ChangeKeyBackGround_Second; // 0x488(0x08)
	struct UImage* IMG_ChangeKeyBackGround_Second_2; // 0x490(0x08)
};

