// WidgetBlueprintGeneratedClass WB_Settings.WB_Settings_C
// Size: 0x528 (Inherited: 0x458)
struct UWB_Settings_C : UCrowSettingsWidget {
	struct UCrowWidgetImage* CrowWidgetImage_74; // 0x458(0x08)
	struct UImage* Image_64; // 0x460(0x08)
	struct UImage* Image_Icon_ESC_2; // 0x468(0x08)
	struct UImage* IMG_Apply_BackGround; // 0x470(0x08)
	struct UImage* IMG_Apply_BackGround_2; // 0x478(0x08)
	struct UImage* IMG_Apply_Hover; // 0x480(0x08)
	struct UImage* IMG_Back_Effect; // 0x488(0x08)
	struct UImage* IMG_Blue00; // 0x490(0x08)
	struct UImage* IMG_Default_BackGround; // 0x498(0x08)
	struct UCrowWidgetImage* IMG_GRAC_GameInfo00; // 0x4a0(0x08)
	struct UCrowWidgetImage* IMG_GRAC_GameInfo01; // 0x4a8(0x08)
	struct UCrowWidgetImage* IMG_GRAC_GameInfo02; // 0x4b0(0x08)
	struct UCrowWidgetImage* IMG_GRAC_GameInfo03; // 0x4b8(0x08)
	struct UCrowWidgetImage* IMG_GRAC_GameInfo04; // 0x4c0(0x08)
	struct UCrowWidgetImage* IMG_GRAC_GameInfo05; // 0x4c8(0x08)
	struct UCrowWidgetImage* IMG_GRAC_GameInfo06; // 0x4d0(0x08)
	struct UCrowWidgetImage* IMG_GRAC_GameInfo07; // 0x4d8(0x08)
	struct UCrowWidgetImage* IMG_GRAC_rating; // 0x4e0(0x08)
	struct UImage* IMG_OptionBg; // 0x4e8(0x08)
	struct UImage* IMG_OptionContentsBg; // 0x4f0(0x08)
	struct UImage* IMG_ResetAll_BackGround_2; // 0x4f8(0x08)
	struct UImage* IMG_ResetAll_Hover; // 0x500(0x08)
	struct UTextBlock* TB_Label_Back_2; // 0x508(0x08)
	struct UTextBlock* TB_MenuTitle; // 0x510(0x08)
	struct UTextBlock* TB_MenuTitle_Apply; // 0x518(0x08)
	struct UTextBlock* TB_MenuTitle_ResetAll; // 0x520(0x08)
};

